{"url": "https://rollingout.com/2017/10/15/former-pussycat-dolls-member-calls-group-prostitution-ring/", "text": "A former member of the hit-making Pussycat Dolls, Kaya Jones, airs out the group’s dirty laundry.\n\nIn case you missed it, the singer recently took to Twitter where she alleged that her former group mates were a part of a prostitution ring.\n\n“My truth. I wasn’t in a girl group. I was in a prostitution ring. Oh & we happened to sing & be famous. While everyone who owned us made the $,” she began. “How bad was it? People ask—bad enough that I walked away from my dreams, my band mates & a 13 million dollar record deal. We knew we were going to be #1.”\n\nJones, 33, took it one step further, calling out her “den mother” by writing, “I want the den mother from hell to confess why another 1 of her girl group girls committed suicide? Tell the public how you mentally broke us.”\n\nOf course, it wasn’t long before fans suggested that the singer was referring to G.R.L. singer Simone Battle, who committed suicide in September of 2014.\n\n“To be a part of the team you must be a team player. Meaning sleep with whoever they say. If you don’t they have nothing on you to leverage…Yes I said leverage. Meaning after they turn you out or get you hooked on drugs they use it against you. Correct. Victimizing the victim again,” continued Jones. “That’s why I have so much respect for our military. I’ve been through way. But my scars you can’t see. At least real war is honest. Why don’t we report it? Because we were all abused! I personally have been warned if I tell I will…you know end up dead or no more career.”\n\nMeanwhile, neither a rep for the Pussycat Dolls nor Nicole Scherzinger has commented on Jones’ allegations.\n\nHowever, Asia Nitollano, who was briefly a part of the group in 2007, took to Twitter to write, “Who is Kaya Jones? Lol She was not apart of The Pussycat Dolls the recording group so I do not know her. If she was in the Vegas show then I know nothing about that nor have I ever heard such a thing. But judging from google she looks like she just wants her 15min of fame. (Side note… it says she’s a Trump supporter… but yet she’s Canadian, which means her vote doesn’t count!!!! ) Same with this comment about The Pussycat Dolls; she wasn’t in the group so her opinion doesn’t count!!!!”\n\nWhat are your thoughts on the claims surrounding the former hit-makers? Sound off in the comment section below.", "images": ["https://rollingout.com/wp-content/uploads/2017/10/pussycatdolls.jpg?x33186", "https://rollingout.com/wp-content/uploads/2016/12/Ruu-Hawkins_avatar_1483156460-164x164.jpg?x33186", "https://rollingout.com/wp-content/uploads/2018/06/ro-logo-18.png?x33186", "https://www.facebook.com/tr?id=666484143716324&ev=PageView\r\n&noscript=1", "https://rollingout.com/wp-content/uploads/2019/06/fcclub.jpg?x33186", "https://rollingout.com/wp-content/uploads/2018/06/ro-logo-18-100.png?x33186", "https://rollingout.com/wp-content/uploads/2017/10/pussycatdolls.jpg", "https://rollingout.com/wp-content/uploads/2019/05/sws2b.jpg?x33186"], "top_img": "https://rollingout.com/wp-content/uploads/2017/10/pussycatdolls.jpg", "keywords": [], "authors": ["R. Hawkins"], "canonical_link": "https://rollingout.com/2017/10/15/former-pussycat-dolls-member-calls-group-prostitution-ring/", "title": "Former Pussycat Dolls member calls group a ‘prostitution ring’", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1", "google-site-verification": "0Yj3tUrHdnc2yWCwimJKlw92aQSuA-NlLsRRxJ8FFOI", "dailymotion-domain-verification": "dmo4qzl4r7iqtl9wm", "spotim": {"recommended_page": "false"}, "og": {"title": "Former Pussycat Dolls member calls group a ‘prostitution ring’", "description": "A former member of the hit-making Pussycat Dolls, Kaya Jones, airs out the group’s dirty laundry. In case you missed it, the singer recently took to Twitter where she alleged that her former group mates were a part of a prostitution ring. “My truth. I wasn’t in a girl group. I was in a prostitution…", "image": "https://rollingout.com/wp-content/uploads/2017/10/pussycatdolls.jpg", "url": "https://rollingout.com/2017/10/15/former-pussycat-dolls-member-calls-group-prostitution-ring/"}, "description": "A former member of the hit-making Pussycat Dolls, Kaya Jones, airs out the groups dirty laundry. In case you missed it, the singer recently", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "twitter": {"card": "summary_large_image", "description": "A former member of the hit-making Pussycat Dolls, Kaya Jones, airs out the groups dirty laundry. In case you missed it, the singer recently", "title": "Former Pussycat Dolls member calls group a 'prostitution ring' - Rolling Out", "site": "@rollingoutnews", "image": "https://rollingout.com/wp-content/uploads/2017/10/pussycatdolls.jpg", "creator": "@ruubabie"}, "generator": "WordPress 5.2.4"}, "movies": [], "publish_date": 1508040000.0, "source": "https://rollingout.com", "summary": ""}