{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nThe small business half of the economy continued its remarkable economic streak, posting a 0.6 point gain in October’s Optimism Index. The 102.4 reading was buoyed by eight of the 10 Index components advancing, as talk of a recession waned in October. The Uncertainty Index declined 4 points but remains historically high heading into an election year.\n\n“A continued focus on a recession by policymakers, talking heads, and the media clearly caused some consternation among small businesses in previous months, but after shifting their focus to other topics, it’s become clear that owners are not experiencing the predicted turmoil,” said NFIB President and CEO Juanita D. Duggan. “Small business owners are continuing to create jobs, raise wages, and grow their businesses, thanks to tax cuts and deregulation, and nothing is stopping them except for finding qualified workers.”\n\nKey findings from October’s index included:\n\n– The October increase was led by GDP-producing plans for job creation, inventory investment, and capital spending.\n\n– Reports of actual capital spending increased and inventory investment improved from a modest negative level in September.\n\n– Reports of rising labor compensation increased and remained strong historically, and the frequency of plans to raise compensation also rose in October.\n\n– Reports of higher selling prices remained subdued, so rising labor costs are still not pushing up inflation on Main Street.\n\n– Actual job creation in October exceeded that in September, as small businesses continued to hire and create new jobs.\n\nThe reported increase in sales put pressure on inventory stocks, reducing them. Owners reporting inventory increases remained unchanged at a net 0 percent. The net percent of owners planning to expand inventory holdings increased 3 points to a net 5 percent, a solid number and one of the best in a year. Overall, owners feel that the prospects for growth justify adding to inventory stocks.\n\nFifty-nine percent reported capital outlays, up 2 points from September’s reading. Of those making expenditures, 40 percent reported spending on new equipment (up 2 points), 24 percent acquired vehicles (up 1 point), and 18 percent improved or expanded facilities (up 4 points). Seven percent acquired new buildings or land for expansion (unchanged) and 14 percent spent money for new fixtures and furniture (unchanged).\n\nTwenty-nine percent plan capital outlays in the next few months, up 2 points. Plans to invest were strong in agriculture and the wholesale trades (34 percent each), and manufacturing and transportation (33 percent each). Thirty percent of small firms reported negative effects from trade policy. Making major commitments about production and distribution will be more difficult until import and export prices are stabilized with trade agreements.\n\n““Labor shortages are impacting investment adversely – a new truck, or tractor, or crane is of no value if operators cannot be hired to operate them,” said NFIB Chief Economist William Dunkelberg. “The economy will likely remain steady at its current level of activity for the next 12 months as Congress will be focused on other matters, and an election cycle will limit action. Any significant change in trade issues will impact financial markets more than the real economy during this period. Adjustments to a new set of ‘prices,’ such as tariffs, will take time.”\n\nTwenty-five percent of the owners selected “finding qualified labor” as their top business problem, more than cited taxes or regulations. Reports of higher worker compensation rose 1 point to a net 30 percent of all firms – a historically high reading. Plans to raise compensation rose 4 points to a net 22 percent. Firms are likely to continue to offer improved compensation to attract and retain qualified workers because the only solution in the short term to an employee shortage is to raise compensation to attract new workers and to train less qualified employees. Owners are still not passing on higher compensation costs, with only 10 percent reporting higher selling prices.\n\n“The economy is doing well given the labor constraints it faces. Unemployment is very low, incomes are rising, and inflation is low. That’s a good economy,” Dunkelberg concluded.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}