{"url": "http://www.state.gov/r/pa/ei/bgn/5375.htm#econ", "text": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet.\n\nU.S.-UNITED KINGDOM RELATIONS\n\nThe first, short-lived British colony in Virginia was organized in 1584, and permanent English settlement began in 1607. The United States declared its independence from Great Britain in 1776. The American Revolutionary War ended in 1783, with Great Britain recognizing U.S. independence. The two countries established diplomatic relations in 1785. The United States broke relations when it declared war on the United Kingdom during the War of 1812; relations were reestablished in 1815.\n\nThe United States has no closer ally than the United Kingdom, and British foreign policy emphasizes close coordination with the United States. Bilateral cooperation reflects the common language, ideals, and democratic practices of the two nations. Relations were strengthened by the United Kingdom’s alliance with the United States during both World Wars, in the Korean conflict, in the Persian Gulf War, in Operation Iraqi Freedom, and in Afghanistan, as well as through its role as a founding member of the North Atlantic Treaty Organization (NATO). The United Kingdom and the United States continually consult on foreign policy issues and global problems and share major foreign and security policy objectives.\n\nRegarding Northern Ireland, which is part of the United Kingdom, “Nationalist” and “Republican” groups seek a united Ireland that includes Northern Ireland, while “Unionists” and “Loyalists” want Northern Ireland to remain part of the United Kingdom. U.S. priorities continue to be supporting the peace process and devolved political institutions in Northern Ireland and encouraging the implementation of the U.S.-brokered 1998 Belfast Agreement, also known as the Good Friday Agreement.\n\nU.S. Assistance to the United Kingdom\n\nThe International Fund for Ireland (IFI), created in 1986, provides funding for projects to generate cross-community engagement and economic opportunity in Northern Ireland (the United Kingdom) and the border counties of Ireland. Since the IFI’s establishment, the United States and EU have contributed the vast majority of funds, with the United States allocating more than $540 million.\n\nBilateral Economic Relations\n\nThe United Kingdom is a member of the European Union and a major international trading power. By October 31, 2019, the United Kingdom expects to be outside of the EU known as “Brexit.” The United Kingdom is one of the largest markets for U.S. goods exports and one of the largest suppliers of U.S. imports. The United States and the United Kingdom share the world’s largest bilateral foreign direct investment partnership. The United Kingdom and United States are holding scoping discussions to determine how best to deepen and broaden the bilateral economic relationship, including ensuring continuity through Brexit and laying the groundwork for a possible free trade deal in the future. The United Kingdom is a large source of foreign tourists visiting the United States. It participates in the Visa Waiver Program, which allows nationals of participating countries to travel to the United States for certain business or tourism purposes for stays of 90 days or less without obtaining a visa.\n\nThe United Kingdom’s Membership in International Organizations\n\nThe United Kingdom and the United States belong to a number of the same international organizations, including the United Nations, North Atlantic Treaty Organization, Euro-Atlantic Partnership Council, Organization for Security and Cooperation in Europe, G-20, G-7, Organization for Economic Cooperation and Development, International Monetary Fund, World Bank, and World Trade Organization. The United Kingdom also is an observer to the Organization of American States.\n\nBilateral Representation\n\nThe U.S. Ambassador to the United Kingdom is Robert Wood Johnson; other principal embassy officials are listed in the Department’s Key Officers List.\n\nThe United Kingdom maintains an embassy in the United States at 3100 Massachusetts Ave. NW, Washington, DC 20008; tel. 202-588-6500.\n\nMore information about the United Kingdom is available from the Department of State and other sources, some of which are listed here:\n\nCIA World Factbook United Kingdom Page\n\nU.S. Embassy\n\nHistory of U.S. Relations With the United Kingdom\n\nU.S. Census Bureau Foreign Trade Statistics\n\nExport.gov International Offices Page\n\nTravel Information", "images": ["https://www.state.gov/wp-content/uploads/2019/02/cropped-Seal-of-the-U.S.-Department-of-State-32x32.png"], "top_img": "https://www.state.gov/wp-content/uploads/2019/02/cropped-Seal-of-the-U.S.-Department-of-State-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.state.gov/u-s-relations-with-united-kingdom/", "title": "U.S. Relations With United Kingdom", "meta_data": {"viewport": "width=device-width, initial-scale=1", "msapplication-tap-highlight": "no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "U.S. Relations With United Kingdom - United States Department of State", "description": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet. U.S.-UNITED KINGDOM RELATIONS The first, short-lived British colony in Virginia was organized in 1584, and permanent English settlement began in 1607. The United States declared its …", "url": "https://www.state.gov/u-s-relations-with-united-kingdom/", "site_name": "United States Department of State"}, "twitter": {"card": "summary_large_image", "description": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet. U.S.-UNITED KINGDOM RELATIONS The first, short-lived British colony in Virginia was organized in 1584, and permanent English settlement began in 1607. The United States declared its […]", "title": "U.S. Relations With United Kingdom - United States Department of State", "image": "https://www.state.gov/wp-content/uploads/2019/06/state_social_card.png"}, "generator": "WordPress 5.3", "msapplication-TileImage": "https://www.state.gov/wp-content/uploads/2019/02/cropped-Seal-of-the-U.S.-Department-of-State-270x270.png"}, "movies": [], "publish_date": null, "source": "http://www.state.gov", "summary": ""}