{"url": "http://www.facebook.com/notes/sarah-palin/peace-through-strength-and-american-pride-vs-enemy-centric-policy/403777543434", "text": "Earlier this week, I spoke at the Freedom Fest in Norfolk, Virginia; and, evidently, the media was asked to leave – not by me, that’s for sure. I want my message out, so despite reporters making up a story about “Palin people kicking us out” (uh, the “Palin people” entourage would consist of one person – my 15-year-old daughter, Willow – and I have no doubt she could take on any reporter, but I know for certain she didn’t “kick ‘em out” of the event). Anyway, here are some of the key issues I spoke about.\n\n\n\nDEFENSE SPENDING\n\n\n\nIt takes a lot of resources to maintain the best fighting force in the world – especially at a time when we face financial uncertainty and a mountain of debt that threatens all of our futures.\n\n\n\nWe have a federal government that is spending trillions, and that has nationalized whole sections of our economy: the auto industry, the insurance industry, health care, student loans, the list goes on – all of it at enormous cost to the tax payer. The cost of Obamacare alone is likely to exceed $2.5 trillion dollars.\n\n\n\nAs a result of all these trillion dollar spending bills, America’s going bust in a hurry. By 2020 we may reach debt levels of $20 trillion – twice the debt that we have today! It reminds me of that joke I read the other day: “Please don’t tell Obama what comes after a trillion!”\n\n\n\nSomething has to be done urgently to stop the out of control Obama-Reid-Pelosi spending machine, and no government agency should be immune from budget scrutiny. We must make sure, however, that we do nothing to undermine the effectiveness of our military. If we lose wars, if we lose the ability to deter adversaries, if we lose the ability to provide security for ourselves and for our allies, we risk losing all that makes America great! That is a price we cannot afford to pay.\n\n\n\nThis may be obvious to you and me, but I am not sure the Obama Administration gets it. There isn’t a single progressive pet cause which they haven’t been willing to throw billions at. But when it comes to defense spending, all of a sudden they start preaching a message of “fiscal restraint.” Our Defense Secretary recently stated the “gusher” of defense spending was over and that it was time for the Department of Defense to tighten its belt. There’s a gusher of spending alright, but it’s not on defense. Did you know the US actually only ranks 25th worldwide on defense spending as a percentage of GDP? We spend three times more on entitlements and debt services than we do on defense.\n\n\n\nNow don’t get me wrong: there’s nothing wrong with preaching fiscal conservatism. I want the federal government to balance its budget right now! And not the Washington way – which is raising your taxes to pay for their irresponsible spending habits. I want it done the American way: by cutting spending, reducing the size of government, and letting people keep more of their hard-earned cash.\n\n\n\nBut the Obama administration doesn’t practice what it preaches. This is an administration that won’t produce a budget for fear that we discover how reckless they’ve been as fiscal managers. At the same time, it threatens to veto a defense bill because of an extra jet engine!\n\n\n\nThis administration may be willing to cut defense spending, but it’s increasing it everywhere else. I think we should do it the other way round: cut spending in other departments – apart from defense. We should not be cutting corners on our national security.\n\n\n\nTHE U.S. NAVY\n\n\n\nSecretary Gates recently spoke about the future of the US Navy. He said we have to “ask whether the nation can really afford a Navy that relies on $3 to $6 billion destroyers, $7 billion submarines, and $11 billion carriers.” He went on to ask, “Do we really need... more strike groups for another 30 years when no other country has more than one?”\n\n\n\nWell, my answer is pretty simple: Yes, we can and, yes, we do because we must. Our Navy has global responsibilities. It patrols sea lanes and safeguards the freedoms of our allies – and ourselves. The Navy right now only has 286 ships, and that number may decrease. That will limit our options, extend tours for Navy personnel, lessen our ability to secure our allies and deter our adversaries. The Obama administration seems strangely unconcerned about this prospect.\n\n\n\nOBAMA’S FOREIGN POLICY INHERITANCE\n\n\n\nWhen George W. Bush came into office, he inherited a military that had been cut deeply, an al Qaeda that had been unchallenged, and an approach to terrorism that focused on bringing court cases rather than destroying those who sought to destroy us. We saw the result of some of that on 9/11.\n\n\n\nWhen President Obama came into office, he inherited a military that was winning in Iraq. He inherited loyal allies and strong alliances. And thanks to the lamestream media pawing and purring over him, he had the benefit of unparalleled global popularity. What an advantage! So their basic foreign policy outlines should have been clear. Commit to the War on Terror. Commit to winning – not ending, but winning the war in Afghanistan. Commit to the fight against violent Islamic extremism wherever it finds sanctuary. Work with our allies. Be resolute with our adversaries. Promote liberty, not least because it enhances our security. Unfortunately, these basic principles seem to have been discarded by Washington.\n\n\n\nTHE WAR ON TERROR\n\n\n\nHis administration has banned the phrase “war on terror,” preferring instead politically correct nonsense like “overseas contingency operations.” His Homeland Security Secretary calls acts of terrorism “man-caused disasters.” His reckless plan to close Guantanamo (because there’s no place to go after it’s closed) faces bipartisan opposition now.\n\n\n\nThe Attorney General just announced that a decision about where to try terrorists like 9/11 master mind Khalid Sheikh Mohammed would not be announced until after the mid-term elections. Is there something he’s afraid to tell us?\n\n\n\nThe President’s new National Security Strategy does not even use the word “Islamic” when referring to violent extremism. Does he think the ideology of those who seek to kill Americans is irrelevant? How can we seek to defeat an enemy if we don’t acknowledge what motivates them and what their ultimate goals are? President Obama may think he is being politically correct by dropping the term, but it flies in the face of reality. As Senator Joe Lieberman noted, refusing to use the word Islamic when describing the nature of the threat we face is “Orwellian and counterproductive.”\n\n\n\nAFGHANISTAN\n\n\n\nIn Afghanistan, it is true that President Obama approved deploying additional forces to the conflict – most, but not all the troops requested by commanders on the ground. But it took months of indecision to get to that point, and it came at a very high price – a July 2011 date to begin withdrawal.\n\n\n\nThis date was arbitrary! It bears no relation to conditions on the ground. It sends all the wrong signals to our friends and to our enemies. We know our commanders on the ground are not comfortable with it.\n\n\n\nAs that great Navy war hero, Senator John McCain recently put it: “The decision to begin withdrawing our forces from Afghanistan arbitrarily in July 2011 seems to be having exactly the effect that many of us predicted it would: It is convincing the key actors inside and outside of Afghanistan that the United States is more interested in leaving than succeeding in this conflict.”\n\n\n\nDoes the President really believe the Taliban and al Qaeda won’t be empowered by his naming of a starting date for withdrawal? They now believe they can beat him simply by outlasting us. What sort of effect does he think this will have on the morale of our troops – and of our allies?\n\n\n\nALIENATING OUR ALLIES\n\n\n\nIt’s not the only area where the Obama administration has failed our allies. They escalated a minor zoning issue in Jerusalem into a major dispute with our most important ally in the Middle East, Israel. They treated the Israeli Prime Minister shabbily in Washington. When a Turkish sponsored flotilla threatened to violate a legal Israeli blockade of Hamas-run Gaza, the Obama Administration was silent. When Israeli commandos were assaulted as they sought to prevent unmonitored cargoes from being delivered to Hamas terrorists, the Obama Administration sent signals it might allow a UN investigation into the matter – an investigation that would be sure to condemn our ally Israel and bemoan the plight of Hamas. Loyal NATO allies in central Europe were undermined by the cancellation of a missile defense program with virtually no warning. At the same time, Russia and China are given preferential treatment, while remaining silent on their human rights violations.\n\n\n\nCODDLING ADVERSARIES\n\n\n\nMeanwhile, the Obama Administration reaches out to some of the world’s worst regimes. They shake hands with dictators like Hugo Chavez, send letters to the Iranian mullahs and envoys to North Korea, ease sanctions on Cuba and talk about doing the same with Burma. That’s when they’re not on one of their worldwide apology tours.\n\n\n\nDo we get anything in return for all this bowing and apologizing? No, we don’t. Yes, Russia voted for a weak sanctions resolution on Iran, but it immediately stated it could sell advanced anti-aircraft missile to Iran anyway, and would not end its nuclear cooperation. In response to North Korea’s unprovoked sinking of a South Korean Navy ship, China warned us not to take part in military exercises with our ally.\n\n\n\nAnd while President Obama lets America get pushed around by the likes of Russia and China, our allies are left to wonder about the value of an alliance with the U.S. They have to be wondering if it’s worth it.\n\n\n\nAN “ENEMY-CENTRIC” FOREIGN POLICY\n\n\n\nIt has led one prominent Czech official to call Obama’s foreign policy “enemy-centric.” And this “enemy-centric” approach has real consequences. It not only baffles our allies, it worries them. When coupled with less defense spending, it signals to the world that maybe we can no longer be counted on, and that we have other priorities than being the world leader that keeps the peace and provides security in Europe, in Asia and throughout the world.\n\n\n\nTogether with this enemy-centric foreign policy, we see a lessening of the long, bipartisan tradition of speaking out for human rights and democracy. The Secretary of State said she would not raise human rights with China because “we pretty much know what they are going to say.” Democracy promotion programs have been cut. Support for the brave Iranians protesting their government was not forthcoming because President Obama would rather try to cut a deal with their oppressors.\n\n\n\nWhen the world’s dictators see the United States unconcerned with human rights and political freedom, they breathe a sigh of relief, because they know they have a free hand to repress their own people.\n\n\n\nThis goes against the very ideals on which our republic was founded. There is a long bipartisan tradition of speaking out in favor of freedom – from FDR to Ronald Reagan. America loses something very important when its President consigns human rights and freedom to the back burner of its international priorities.\n\n\n\nA DIFFERENT VIEW OF AMERICA\n\n\n\nWe have a President, perhaps for the very first time since the founding of our republic, who doesn’t appear to believe that America is the greatest earthly force for good the world has ever known.\n\n\n\nWhen asked whether he believed in American exceptionalism, President Obama answered, “I believe in American exceptionalism, just as I suspect that the Brits believe in British exceptionalism and the Greeks believe in Greek exceptionalism.” Amazing. Amazing.\n\n\n\nI think this statement speaks volumes about his world view. He sees nothing unique in the American experience? Really? Our founding, and our founding mothers and fathers? Really? And our history over the past two and half centuries?\n\n\n\nReally? He sees nothing unique in an America that fought and won two world wars and in victory sought not one inch of territory or one dollar of plunder? He sees nothing unique in an America that, though exhausted by conflict, still laid the foundation for security in Europe and Asia after World War II? He sees nothing unique in an America that prevailed against an evil ideology in the Cold War? Does he just see a country that has to be apologized for around the world, especially to dictators?\n\n\n\nPresident Obama actually seems reluctant to even embrace American power. Earlier this year when he was asked about his faltering Middle East peace process, he said “whether we like it or not, we remain a dominant military superpower.” Whether we like it or not?! Really? Mr. President, this may come as news to you, but most Americans actually do like it. And so do our allies. They know it was our military might that liberated countless millions from tyranny, slavery, and oppression over the last 234 years. Yes, we do like it. As a dominant superpower, the United States has won wars hot and cold; our military has advanced the cause of freedom and kept authoritarian powers in check.\n\n\n\nIt is in America’s and the world’s best interests for our country to remain the dominant military superpower, but under President Obama’s leadership that dominance may be slipping away. It’s the result of an agenda that reeks of complacency and defeatism.\n\n\n\n(I went on from there to talk about our need to end the negative, defeatist attitudes of those in leadership. I spoke further on American exceptionalism, and Willow and I ended a great evening with some great patriots. Sorry the media chose to report anything other than what actually happened at the event.)\n\n\n\n- Sarah Palin\n\n", "images": ["https://scontent.fphl2-2.fna.fbcdn.net/v/t1.0-0/p118x118/15940934_10154944886183588_1687778827788911684_n.jpg?_nc_cat=105&_nc_ohc=F40CqnB7W2gAQmNZFrbdUPuLO_6iFk4k9KffmH6viSQmVFWQS21l-Le8A&_nc_ht=scontent.fphl2-2.fna&oh=01969b96d0455df08f5544cfa4297623&oe=5E6AAC6E", "https://scontent.fphl2-1.fna.fbcdn.net/v/t1.0-1/p56x56/12540980_10153896234888588_936131237342835554_n.png?_nc_cat=1&_nc_ohc=fdrla8MeLIIAQkwtmviZ9kmwTxeYcikXLFGXz9cDupQ-Bn-m2whrCe00w&_nc_ht=scontent.fphl2-1.fna&oh=2a6465110db75f2e6a059038790ef252&oe=5E89F7BD", "https://facebook.com/security/hsts-pixel.gif?c=3.2.5", "https://static.xx.fbcdn.net/rsrc.php/yz/r/KFyVIAWzntM.ico"], "top_img": "https://static.xx.fbcdn.net/rsrc.php/yz/r/KFyVIAWzntM.ico", "keywords": [], "authors": [], "canonical_link": "https://www.facebook.com/notes/sarah-palin/peace-through-strength-and-american-pride-vs-enemy-centric-policy/403777543434/", "title": "Peace Through Strength and American Pride vs. “Enemy-Centric” Policy", "meta_data": {"referrer": "default", "description": "Earlier this week, I spoke at the Freedom Fest in Norfolk, Virginia; and, evidently, the media was asked to leave – not by me, that’s for sure. I want"}, "movies": [], "publish_date": null, "source": "http://www.facebook.com", "summary": ""}