{"url": "www.mensjournal.com/entertainment/baywatch-review-dwayne-rock-johnson-and-zac-efron-bring-muscles-and-fun-beach/", "text": "\n\n\n\nWith studios all over Hollywood mining past intellectual properties for reboots, remakes, sequels, and prequels, it was only a matter of time before Baywatch got similar treatment.\n\nThe ’90s TV phenomenon battled through early cancellation to become one of the most popular series in the world, lasting for 242 episodes and countless slow-motion runs on the beach featuring beautiful lifeguards before it ended. So it’s pretty fitting that Dwayne “The Rock” Johnson, America’s current muscular hero and highest-paid movie star in the world, would bring it to the big screen.\n\nAs a raunchy, R-rated comedy, Baywatch touches all the bases you’d expect: Plenty of male genitalia jokes, cursing, and flattering shots of beautiful women, but it also has room for fun, action-packed set pieces, a few heartwarming moments, and great chemistry between Johnson and Zac Efron, which powers the funniest parts of the film. Sure, it won’t win any Academy Awards and there are a few too many obvious jokes, but with a killer soundtrack and Johnson’s charm, it’s a fun movie experience.\n\nJohnson leads the way as Lieutenant Mitch Buchannon, the top dog of Emerald City’s titular lifeguard team and a sort-of local hero to the citizens of the town (“He started Google and then gave it away anonymously,” says one beachgoer as Buchannon walks by.). After diving into the water to save a wind surfer who crashes into the ocean, Buchannon jogs down the shore and gives an introduction to the inhabitants of the beach: We meet Stephanie (Ilfenesh Hadera) and CJ (Kelly Rohrbach), the unbelievably beautiful fellow lifeguards; a group of recruits who hope to join the team in the annual tryouts, Summer (Alexandra Daddario), Ronnie (Jon Bass), and Olympic bad-boy Matt Brody (Efron); and the mysterious Victoria Leeds (Priyanka Chopra), a sand-averse private club owner who has some nefarious plans up her sleeve.\n\nCourtesy of Paramount Pictures / Baywatch\n\nBrody is a cocky, party-loving two-time Olympic gold medalist who has fallen on hard times after blowing the team relay at the Rio Olympics. Brody gets nicknamed the “Vomit Comet” after hurling in the pool after a hard-drinking night, letting his team and country down. While Brody’s backstory is meant to reference real-life Olympian Ryan Lochte, the filmmakers had no idea art would imitate life so much after Lochte actually got involved in shenanigans in Brazil following a night of partying in summer 2016.\n\nBrody’s cockiness pushes against Buchannon’s gung-ho attitude about the lifeguard team, and, after resisting the tryout, thinking that he deserves a spot based on his world-record swimming alone, the two go head-to-head in a pseudo-strongman contest that’s basically a reason to show off Johnson and Efron’s muscles. Both stars are absolutely jacked in this film, with Efron looking like he was carved by a sculptor into a perfect specimen with rock-hard abs and bulging pecs, while Johnson is a bit leaner than his Luke Hobbs character in Fate of the Furious, but still huge. (Efron told Men’s Fitness about the workout he used to get ripped for Baywatch, and, after seeing the film, one thing’s for certain: It worked.)\n\nThings get moving pretty quickly once Buchannon finds some drugs washed up on the beach, eventually tracing things back to Leeds. The team investigates a dead body that washes up and connects it to Leeds’ plan of buying up real estate along the beach with the profits from selling drugs. The only problem? The Baywatch team doesn’t have much authority.\n\nCourtesy of Paramount Pictures / Baywatch\n\nAquaman villain Yahya Abdul-Mateen plays a local cop who loves to remind Buchannon any chance he can get that his “Lieutenant” position doesn’t mean a thing. But that doesn’t stop the team from going undercover to try and expose Leeds’ plan anyway, bringing out some of the most ridiculous sequences of the film. If you ever wanted to hear Johnson and Efron argue about a dead man’s “taint,” well, you’re in luck. The team breaks into the city morgue to see if Leeds is covering up a murder, and Brody ends up with a handful of balls and later a mouthful of liquified fat.\n\nApart from the gross-out factor, this scene highlights why Johnson and Efron’s chemistry makes for some of the funniest moments of the film. One of the best running gags is Buchannon refusing to call Brody by name, using nicknames like “Bieber,” “N’Sync,” “One Direction,” and the super-meta “High School Musical” instead, eventually warming to the bad boy as the team investigates more dead bodies showing up on the beach.\n\nChopra is a standout among the cast, smoldering in every scene she’s in. While her character isn’t sketched out much—there’s only so much time to spare in a two-hour movie—she has a few highlight moments, including when she has a dance off with Ronnie at her club, and in the climax of the film when she goes full supervillain during a fight with Brody and Buchannon.\n\nCourtesy of Paramount Pictures / Baywatch\n\nBass gives a laugh-out-loud performance as the nerdy “tech guy” who is in love with CJ, and makes the Baywatch team by showing “no quit” in the tryout. Despite being very pretty faces, Daddario, Hadera, and Rohrbach aren’t just there to look good—although they certainly do—but they all have a part to play on the team, which becomes abundantly clear when they save Brody from a fiery, exploding boat during a rescue mission.\n\nComparisons will be made to the 21 Jump Street film series due to the fact that both are remakes/reboots of old TV shows and follow a story tied to drug dealers, but director Seth Gordon (Horrible Bosses) does a very solid job of making Baywatch unique, creating some fun action scenes (Johnson’s character gets to slam a garbage can of used diapers onto one of Leeds’ henchmen after a jet ski chase), and making sure the team comes across as a “family,” and not just some people who work together and rush home at the end of the day.\n\nSpeaking of going home, one of the most hilarious moments of the film comes when Brody has to crash at Buchannon’s house—a place that looks so expensive, there’s no way a lifeguard has any business owning, renting, or living in it—and finds something in a fish tank staring directly back at him while he sleeps: A miniature version of Buchannon in his lifeguard uniform holding a trident. Later in the film the figurine changes for hilarious effect, but we won’t spoil that gag for you—just be sure to keep an eye on the fish tank.\n\nThere are two major cameos in the film with actors from the original series, and while we won’t spoil that either, it’s pretty obvious who will show up if you’re familiar with the television show. Both cameos are mined for laughs and actually fit in pretty naturally with the storyline, so they don’t feel superfluous at all.\n\nThe final scene hints at a potential sequel for the film, and the end credits show off some hilarious outtakes and deleted scenes that didn’t make it into the final cut.\n\nBaywatch may not go down in the pantheon of all-time comedies, but the film is wildly entertaining, features hilarious performances, and is a welcome respite from the big-budget, save-the-world, save-humanity blockbusters that are all too common at the cineplex these days.\n\nCourtesy of Paramount Pictures / Baywatch\n\nFor access to exclusive gear videos, celebrity interviews, and more, subscribe on YouTube!", "images": ["https://www.mensjournal.com/wp-content/uploads/2019/08/Guides.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/mf/chopra-baywatch-main.jpg", "https://www.mensjournal.com/wp-content/themes/mens-journal/assets/img/logo-tag-registered.svg", "https://www.mensjournal.com/wp-content/uploads/mf/rock-dwayne-johnson-baywatch-movie.jpg", "https://www.mensjournal.com/wp-content/uploads/2019/08/Ab-workouts.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Full-Body-Workouts.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/12/black-widow-scarlett-mainers-ee3341.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/12/bond-trailer-main-craig.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Shoes.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Outdoor.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Arm-workouts.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Tech.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2018/08/yellowstone-tv-gallery-1.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/12/shutterstock_589767479.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Autos.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Wellness.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/12/free-guy-ryan-reynolds-1.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Travel-Tips.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Grooming.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/mf/baywatch-cast-review.jpg?w=1200&h=630&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Public-Lands.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/06/Sailgp.jpg?w=200&h=113&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/4-day-weekend.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Weight-Loss.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/mf/baywatch-cast-review.jpg?w=200&h=113&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Chest-workouts.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Beer.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/12/ghostbusters-main-143.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Watches.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Trips.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/mf/zac-efron-baywatch-movie.jpg", "https://www.mensjournal.com/wp-content/uploads/2019/08/Workouts.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/mf/baywatch-kelly-rohrbach-rock-main.jpg", "https://www.mensjournal.com/wp-content/uploads/2019/08/Leg-workouts.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/themes/mens-journal/assets/img/logo-tag-registered-green.svg", "https://www.mensjournal.com/wp-content/uploads/2019/12/billy-dee-williams.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Celebrity-Workouts.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Features.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Home-Lifestyle.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/12/ryan-reynolds-main-2.jpg?w=100&h=100&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Outdoors.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/CocktailsSpirits.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Healthy-Food.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Whiskey.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2014/09/difference-between-bourbon-and-whiskey.jpg?w=200&h=113&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Fashion.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Fitness.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/06/tony-hawk-main-1.jpg?w=200&h=113&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/National-Parks.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Reviews.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Recipes.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/08/Travel-Guides.jpg?w=200&h=200&crop=1", "https://www.mensjournal.com/wp-content/uploads/2019/12/golden-globes.jpg?w=100&h=100&crop=1"], "top_img": "https://www.mensjournal.com/wp-content/uploads/mf/baywatch-cast-review.jpg?w=1200&h=630&crop=1", "keywords": [], "authors": ["Matthew Jussim"], "canonical_link": "https://www.mensjournal.com/entertainment/baywatch-review-dwayne-rock-johnson-and-zac-efron-bring-muscles-and-fun-beach/", "title": "‘Baywatch’ Review: Dwayne ‘The Rock’ Johnson and Zac Efron Bring Muscles and Fun to the Beach", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": 1588896957, "theme-color": "#eb212e", "msvalidate.01": "097DBAAF43A9B61E9E4259AA7D75B069", "description": "With raunchy humor and an absurdly good-looking cast—including Alexandra Daddario, Kelly Rohrbach, Ilfenesh Hadera, and Priyanka Chopra—this straight-up hilarious crowd-pleaser is a welcome respite from self-serious superhero fare.", "og": {"locale": "en_US", "type": "article", "title": "‘Baywatch’ Review: Dwayne ‘The Rock’ Johnson and Zac Efron bring muscles and fun to the beach", "description": "", "url": "https://www.mensjournal.com/entertainment/baywatch-review-dwayne-rock-johnson-and-zac-efron-bring-muscles-and-fun-beach/", "site_name": "Men's Journal", "updated_time": "2018-08-27T19:54:59+00:00", "image": {"identifier": "https://www.mensjournal.com/wp-content/uploads/mf/baywatch-cast-review.jpg?w=1200&h=630&crop=1", "secure_url": "https://www.mensjournal.com/wp-content/uploads/mf/baywatch-cast-review.jpg?w=1200&h=630&crop=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/MensJournal/", "tag": "Movies and TV", "section": "Entertainment", "published_time": "2017-05-24T22:25:29+00:00", "modified_time": "2018-08-27T19:54:59+00:00"}, "fb": {"app_id": 1680151055560550}, "twitter": {"card": "summary_large_image", "description": "With raunchy humor and an absurdly good-looking cast—including Alexandra Daddario, Kelly Rohrbach, Ilfenesh Hadera, and Priyanka Chopra—this straight-up hilarious crowd-pleaser is a welcome respite from self-serious superhero fare.", "title": "‘Baywatch’ Review: Bringing fun to the beach", "site": "@MensJournal", "image": "https://www.mensjournal.com/wp-content/uploads/mf/baywatch-cast-review.jpg?w=1200&h=630&crop=1", "creator": "@Matthew_Jussim"}, "generator": "WordPress 5.2.4"}, "movies": [], "publish_date": 1495664729.0, "source": "http://www.mensjournal.com", "summary": ""}