{"url": "https://web.archive.org/web/20171211235903/http://eveningw.com/breaking-woman-says-offered-big-money-washington-post-accuse-roy-moore-misconduct/", "text": "Allegations of misconduct against Alabama Republican Senate candidate Roy Moore have come in recently. The allegations claim that Moore had intimate relations with an underage female around 40 years ago.\n\nMore reports have come to the surface that are bringing the bizarre story to an entirely new level.\n\nThe Washington Post reported on Thursday allegations about an incident involving Moore that took place in 1979 between Moore (who was 39 at the time) and a 14-year-old girl.\n\nA Twitter user named Doug Lewis posted on his page that a family friend had reached out to him about the situation. Lewis’s profile shows him as a Trump supporter and a Navy veteran. The woman, who is remaining anonymous, apparently told Lewis that a Washington Post reporter who was called “Beth” had offered to pay the woman a large sum of money if she wold accuse GOP candidate Moore of the crime.\n\nLewis’s tweet read, “A family friend who lives in Alabama just told my wife that a WAPO reporter named Beth offered her 1000$ to accuse Roy Moore.”\n\nA family friend who lives in Alabama just told my wife that a WAPO reporter named Beth offered her 1000$ to accuse Roy Moore????\n\nIn later tweets, Lewis continued to report that the family friend had photographs of the reporter who reached out to her. She had even recorded the phone conversation. Lewis explained that he told the family friend to bring the recording and the photograph to her local district attorney’s office. He also insisted that she make a copy of both the recording and the photo for herself as back up.\n\nJustBrenda, another Twitter user, wrote a response to Lewis’s tweet. She stated that she “wouldn’t be surprised” if the allegations about the reporter stood to be true. She went on to say that anyone who makes up sexual offenses “make things harder” for real victims.\n\nLewis wrote a response to JustBrenda explaining hat he would “find out” the truth. He also stated that “Jean,” who we can only assume to be the family friend, had spoken to the Etowah County District Attorney about the evidence that she had obtained. According to Lewis, someone from the office was sent to pick up the phone call.\n\nBradd Powless, another user on Twitter, told Lewis that he should report the occurrence to the FBI as well as the Secret Service.\n\nLewis wrote back to Powless explaining that he had already done so, but “Jean” didn’t trust the agencies so she chose to talk to her local law enforcement.\n\n“Can’t blame her with FBI in stories every day,” Lewis added.\n\nIt is important that while these allegations haven’t been proven true or disproven to be true, there may be bits and pieces that are accurate. There have been so many reports of sexual misconduct these days that it is important that all evidence and reports be investigated properly so the people of America can find out the truth.\n\nMoore has come forward to say that the allegations of sexual misconduct are false.\n\nMoore spoke to Newsweek and stated, “These allegations are completely false and are a desperate political attack by the National Democrat Party and The Washington Post on this campaign. After over 40 years of public service, if any of these allegations were true, they surely would have been made public long before now.”\n\nThe Alabama special election is only a few weeks away. By December 12th people will be voting, so Moore only has a limited amount of time to prove the allegations to be false. He must reassure conservative voters that he is the right choice for Senate now that former Senator and current Attorney General Jeff Sessions is gone.\n\nLet’s hope the truth comes out in time for voters to be able to make a rational decision.", "images": ["https://web.archive.org/web/20171211235903im_/http://eveningw.com/wp-content/uploads/2017/11/roy-moore-678x380.jpg", "https://web.archive.org/web/20171211235903im_/http://eveningw.com/wp-content/uploads/2017/11/roy-moore.jpg"], "top_img": "https://web.archive.org/web/20171211235903im_/http://eveningw.com/wp-content/uploads/2017/11/roy-moore.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20171211235903/http://eveningw.com/breaking-woman-says-offered-big-money-washington-post-accuse-roy-moore-misconduct/", "title": "Breaking: Woman Says She Was Offered Big Money By Washington Post to Accuse Roy Moore of Misconduct", "meta_data": {"fb": {"pages": 155846988222348}, "viewport": "width=device-width, initial-scale=1", "og": {"type": "article", "title": "Breaking: Woman Says She Was Offered Big Money By Washington Post to Accuse Roy Moore of Misconduct", "description": "Allegations of misconduct against Alabama Republican Senate candidate Roy Moore have come in recently. The allegations claim that Moore had intimate relations with an underage female around 40 years ago.   More reports have come to", "image": {"identifier": "https://web.archive.org/web/20171211235903im_/http://eveningw.com/wp-content/uploads/2017/11/roy-moore.jpg", "width": 678, "height": 381}, "url": "https://web.archive.org/web/20171211235903/http://eveningw.com/breaking-woman-says-offered-big-money-washington-post-accuse-roy-moore-misconduct/", "site_name": "Evening World", "updated_time": "2017-11-13T14:53:49+00:00"}, "article": {"published_time": "2017-11-13T14:53:49+00:00", "modified_time": "2017-11-13T14:53:49+00:00"}, "twitter": {"card": "summary_large_image", "title": "Breaking: Woman Says She Was Offered Big Money By Washington Post to Accuse Roy Moore of Misconduct", "description": "Allegations of misconduct against Alabama Republican Senate candidate Roy Moore have come in recently. The allegations claim that Moore had intimate relations with an underage female around 40 years ago.   More reports have come to", "image": "https://web.archive.org/web/20171211235903im_/http://eveningw.com/wp-content/uploads/2017/11/roy-moore.jpg"}, "generator": "WordPress 4.9.1", "msapplication-TileImage": "http://eveningw.com/wp-content/uploads/2017/10/cropped-photo-270x270.jpg"}, "movies": [], "publish_date": 1510584829.0, "source": "https://web.archive.org", "summary": ""}