{"url": "nymag.com/nymetro/health/features/9909/index1.html", "text": "The Perfect Little Bump\n\nMargot Tenenbaum, now 21 weeks pregnant. (Photograph by Katherine Wolkoff)\n\nManhattan, of course, has long been proudly gaunt, inhabited as it is by legions of celebrities, socialites, fashionistas, and those who would be them (remember Edith Wharton’s ethereal creatures, Lily Bart of the \u0093long, light step\u0094 and the \u0093slender pink nails\u0094? Slender nails?). Only in the past few years, however, have the \u0093bump,\u0094 the \u0093basketball,\u0094 and the \u0093belly on two sticks\u0094 entered the local lexicon. Blooming stars now strut the red carpet at the Oscars and pregnant supermodels flaunt their exposed bellies, while Us Weekly, People, and the Star intrepidly report on who has stayed admirably attenuated (Gwyneth Paltrow, Sarah Jessica Parker) and who has not (Debra Messing, Kate Hudson). In late spring, the hot gossip swirled around paparazzi shots of Paltrow emerging smilingly (triumphantly?) svelte from a London hospital. The conspiracy theory was that she hid out in the hospital for a few weeks after giving birth\u0097there’s just no way she could’ve lost so much weight so quickly. The pregnant-celeb watch is about to reach a new peak this fall, as Julia Roberts waddles\u0097she’s having twins; she can’t help it\u0097toward a January due date. Toss into this roiling mix the Atkins and South Beach diets\u0097the latest devotionals in New York’s Church of Divine Diminishment\u0097and you’ve got a freshly minted group neurosis. You’ve also got an unnerving question: Are women starving their babies by starving themselves?\n\nW ay back when, in the late fifties, a woman as tortured as Sylvia Plath could be at her sunniest when she was \u0093cow-heavy and floral.\u0094 Today, the prevailing attitude toward the extra flesh of maternity verges on disgust. A sampling of what women tell me they do not want to be while pregnant: \u0093a fat slob,\u0094 \u0093a huge blob,\u0094 \u0093sloppy,\u0094 \u0093horrible like Kate Hudson,\u0094 \u0093fucking gross.\u0094 Tenenbaum’s language is less harsh (\u0093mushy\u0094 is her preferred pejorative), but she has the same fear of becoming almost offensive, of not measuring up. She keeps worrying, she says, about an upcoming vacation with her husband’s family. There’s no way she wants to expose her girth in a bathing suit, but then she wonders if they’ll think she’s \u0093ashamed\u0094 of her body if she swims in shorts and a shirt. \u0093And maybe I am ashamed,\u0094 she says.\n\nBerger sympathizes. \u0093The last time I got weighed [at the OB’s], I was really pleased the nurse just wrote the number in my chart and didn’t say it out loud, because it was so . . . If you knew how much I weighed, you’d be like, \u0091Oh, my God!’ \u0094\n\nIn conversations with several dozen more pregnant women and new mothers, I was repeatedly struck by how fixated they are on the new pregnancy ideal, how much they lap up the praise if they \u0093achieve\u0094 it, how anxious they are if they don’t. It’s a jungle out there, and only the scrawniest survive.\n\nBeth Dorfman, a second-trimester periodontist, was so concerned about blowing up, and about eating healthy in general, that she consulted nutritionist Tanya Zuckerbrot early in her pregnancy (Zuckerbrot says she’s seen a significant increase in the number of women who come to her for weight-related reasons). \u0093I remember shopping with my mother and I thought, \u0091These random people walking past me on the street, I wonder if they think \u0093Hmm, that girl might be pregnant,\u0094 or \u0093That girl might just have eaten seventeen cupcakes an hour ago,\u0094 ’ \u0094 Dorfman says.\n\nZuckerbrot advised Dorfman to eat more protein and fiber (pregnant women can go Atkins, by the way, as long as they eat some carbs) and turned her onto the miracle that is Scandinavian fiber crisps. \u0093They’re like sixteen calories a cracker,\u0094 Dorfman says. \u0093They’re not the tastiest\u0097a nice bagel or bread would taste better\u0097but they satisfy some of the craving and fill me up.\u0094 Dorfman promptly began eating three of the Scandinavian crisps topped with peanut butter and jelly for breakfast. Even her peanut butter is diet, she says. \u0093It’s not Skippy Reduced Fat; it’s even lower fat than that, like 2.5 grams per serving.\u0094 All the calorie counting is a necessary evil, says Dorfman. \u0093When you’re pregnant, you’re only supposed to eat 300 more calories per day,\u0094 she says, citing a common recommendation. \u0093That’s not much. One of those Dannon Light ’n Fit yogurts, that’s 100 calories right there.\u0094\n\nWhen it comes to exercise, so many women rhapsodized to me about spotting a sublimely trim pregnant woman exercising her butt off at the local Equinox that I began to wonder whether clever health-club marketers were fitting trainers with fat pads. Meredith Paley, a vice-president at Kenneth Cole whose daughter, Ava, was born in July, is one of those who attracted gawkers. Her pregnancy-workout schedule: spinning on Tuesdays, body sculpting Wednesdays, one or two other random gym visits a week, and five-mile Central Park runs on Wednesdays, Fridays, and both weekend days. Because Paley knows that doctors recommend that pregnant women keep their heart rates under 140 beats per minute (to keep sufficient oxygen flowing to the baby), she says she always wore a monitor and walked when the number got close. A serious runner, Paley volunteers several times that intense exercise is natural for her, what makes her feel good. Still, she says, \u0093I’m the first to admit that I didn’t see pregnancy as an excuse to sit on my ass and let the pounds come.\u0094\n\nOne maternity researcher says she ﬁnds her subjects’ weight-restrictive behaviors unnerving. \u0093The pregnancy and delivery is all about them. If you can’t invest in your baby by gaining weight, I think it’s a harbinger for lack of investment in the child.\u0094\n\nDorfman, also an avid exerciser, is frustrated by the heart-rate cutoff. \u0093If the doctor says 140, I want to go to 137\u0097that’s just the type of person I am. I’m not going to jeopardize the health of my child, but I’m on the treadmill like, God, I’m not even sweating. I feel like it’s not doing anything.\u0094\n\nThis kind of superfit patient has become increasingly common, says Upper East Side obstetrician Shari Brasner, during the ten years she’s been in practice. She mentions a third-trimester patient who blew by her running in the park recently (\u0093It was unbelievable\u0094), and one who, after developing a painful nerve cluster in her foot, cut a hole in her sneaker rather than step off the treadmill. The doctor says it’s not hard to spot which patients are tormented by their expansion: \u0093They take ten minutes to remove every last bit of clothing, down to the rubber band on their ponytail, before getting on the scale.\u0094\n\nJulie Tupler disavows the idea that women should be skinny or diet during pregnancy, but there’s no denying that her classes attract those who are serious about flab. \u0093You’re not supposed to gain ten pounds in the first trimester,\u0094 says Patty Surak, who was eight months along, \u0093but I did.\u0094 On a recent Tuesday afternoon, Surak and five other very pregnant women were assembled for a Tupler session, outfitted in oversize T-shirts and black exercise pants. One staple of Tupler’s class is a sort of pregnancy-safe sit-up. The group’s homework is 500 a day.\n\n\u0093What’s the magic word for next week?\u0094 Tupler asked.\n\n\u0093One thousand,\u0094 the group replied in unison.\n\n\u0093You can start doing these again right after the placenta comes out,\u0094 Tupler said. \u0093I had one student who even did it before!\u0094\n\nA s is probably obvious by now, it’s not just how much weight women gain but where they gain it. Like Dante’s levels of hell, there’s a hierarchy of bad to worse. Level 1: All extra adipose tissue is smartly confined to the stomach. (\u0093That’s the baby’s body, not yours,\u0094 says mother and academic body watcher Susan Bordo, author of the recently rereleased Unbearable Weight: Feminism, Western Culture, and the Body.) Level 2: Your breasts get big, too, but nothing else. (\u0093I know a lot of women who get pregnant who are very flat-chested, and it’s like heaven to them,\u0094 says Tenenbaum, who’s already well endowed and hasn’t felt the thrill, though her husband apparently can’t get enough: \u0093He’s like, \u0091Your boobs! They’re so big! It’s great!’ \u0094) Level 3: Your butt and thighs puff up, or become \u0093rumply\u0094 (one UrbanBaby mother’s lament). And finally, Level 4: Your face and ankles swell, a fate that befell 34-year-old publicist Katie Pottinger. \u0093My entire body widened. My face, I wouldn’t even say it was puffy; I mean, it really blew out. There was a thickening,\u0094 she says, \u0093that happened all over.\u0094\n\nThe skinny-pregnancy set also lives to be told they’re having a boy. Under the old anti-feminist canard straight out of Grimm’s, girls \u0093steal\u0094 their mother’s looks. \u0093I was like a preening peacock when people told me \u0091You must be having a boy,’ \u0094 says Kate Walsh, an associate editor for Metropolitan Home and the new mother of a very female Evelyn. Diana Becker, a soft-spoken 28-year-old legal secretary, got the other end of the deal: \u0093You must be having a girl,\u0094 a neighbor lady informed her. \u0093Why?\u0094 Becker naïvely asked. \u0093Because people get fat all over when it’s a girl.\u0094", "images": ["http://www.newyorkmetro.com/nymetro/news/features/perfectbump040920_2_400.jpg"], "top_img": "", "keywords": [], "authors": ["Laurie Abraham"], "canonical_link": "", "title": "Pregnant and Still Thin", "meta_data": {"Headline": "The Perfect Little Bump", "Byline": "Laurie Abraham", "Type_of_Feature": "Feature", "Issue_Date": "September 27, 2004", "keywords": "pregnancy, pregnant, sexy, thin, skinny, weightloss, Margot Tenenbaum, pregnancy fitness classes, weight gain", "og": {"title": "The Perfect Little Bump", "site_name": "NYMag.com"}, "content.author": "Laurie Abraham", "content.form": "Entries", "content.hierarchy": "Heath Channel:Magazine", "content.hierarchy.title": "Magazine Articles", "content.type": "Articles", "content.source": "Magazine", "description": "Many of the city’s mothers-to-be are counting every carb and pushing their heart-rate monitors to the limit to stay skinny and sexy while pregnant. Is this harmless vanity? Or a New York obsession gone too far?", "document_type": "Article", "category": "Feature", "MSSmartTagsPreventParsing": "true"}, "movies": [], "publish_date": null, "source": "http://nymag.com", "summary": ""}