{"url": "www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition", "text": "Next month, to mark the occasion of Prince Harry’s marriage to Meghan Markle, Julien’s, the L.A.-based “auction house to the stars,” will be selling five cake slices from “iconic” British royal weddings past. The lot includes a slice of brandy-infused fruitcake from the 2011 marriage of Harry’s brother William to Kate Middleton (with an estimated price of between six and eight hundred dollars), and one from the wedding of the boys’ parents, Prince Charles and Diana (eight to twelve hundred dollars), sold with a paper doily and an envelope, addressed to its original recipients and marked with Queen Elizabeth’s royal stamp. There is a slice from Charles’s wedding to his second wife, Camilla Parker Bowles; another from the wedding of Prince Andrew and Sarah Ferguson, in 1986; and, at a relative bargain rate of three to five hundred dollars, one from the union of Princess Anne and Captain Mark Phillips, in 1973. In the years since these confections were baked, their layers of marzipan may have turned from yellow to a dingy ochre, but the cake itself, loaded with sugar and spirits and dried fruit, is otherwise impressively preserved.\n\nElizabeth and Philip’s wedding, in 1947, featured a four-tiered cake weighing five hundred pounds. Photograph by Topical Press Agency / Getty\n\nIt was an eighteenth-century cookery writer named Elizabeth Raffald who first developed the formula to which each of these royal-wedding cakes more or less adhered. Since medieval times, all special occasions in England, from Christmas to christenings, had been celebrated with fruit cakes, which were optimally suited to an era before refrigeration. (As one modern-day food-safety specialist noted, “You are unlikely to see mould on a fruit cake for a very long time.”) Raffald’s innovation was to cover “bride cake,” as wedding cake was then called, in a layer of marzipan, followed by a bright white shell of the cement-like substance that came to be known as royal icing. This double coating made cakes that were good to look at but not necessarily to eat. Guests were left, one nineteenth-century baker remarked, with “a thick layer of white sugar which nobody cared about; a medium layer of almond paste, which everybody wished for, and did not always get; and an immense quantity of cake of which many only ate a few crumbs.”\n\nQueen Victoria’s cake for her wedding, in 1840, was the first to become a national obsession, an extension of the public’s fascination with the young queen herself. It was baked in a vast single layer—“a great beast . . . some ten feet in circumference,” as one observer put it. On top were figurines of Victoria and her betrothed, Albert of Saxe-Coburg and Gotha, wearing Roman dress, and also statues of turtle doves, Cupids, and one of Victoria’s beloved dogs. The cake’s picture was displayed in every print shop in London; in the weeks before the wedding as many as twenty-one thousand people visited the bakery on Bond Street, where a policeman was standing guard. Eighteen years later, the wedding of Victoria’s daughter Vicky, to Prince Frederick William of Prussia, featured the first multi-tiered royal-wedding cake. It stood seven feet tall, with elaborate sugar busts of the bride, the groom, and the bride’s parents, plus various naked Cupids, festoons of orange blossom, and allegorical statues representing innocence and wisdom.\n\nQueen Victoria’s wedding cake, from 1840, was the first to become a national obsession. Artwork courtesy The Mirror of Literature, Amusement, and Instruction\n\nFor more than a century afterward, royal-wedding cakes did not change much beyond their decorative flourishes. When Elizabeth and Philip were married, in 1947, wartime rationing was still in place, and there was something almost masochistic in the way the public revelled in the thought of the couple’s four-tiered “masterpiece” confection, which weighed five hundred pounds, was stuffed with currants and raisins donated by the Girl Guides of Australia, and featured scenes from the couple’s lives, including of Philip’s favorite sports: athletics, cricket, and sailing. (In 2015, a piece of this cake, still wrapped in its original baking parchment, was sold at auction for five hundred pounds.) For Kate and William’s wedding, the groom asked for a special extra cake of melted dark chocolate and broken rich-tea biscuits, but the couple’s main wedding cake would not have looked out of place on a Victorian banqueting table. Its maker, the luxury-cake designer Fiona Cairns, has said that she was given a “clear brief” that the cake must not be “ostentatious or grand.” Yet it still featured eight tiers of fruitcake rising more than a metre high and weighing a hundred kilos and decorated with seventeen types of sugar-paste flowers, each chosen by Kate for its symbolic meaning, including thistles for Scotland and lily of the valley for humility. The request for chocolate, and for modesty, looked like tiny gestures of rebellion from a prince who might secretly yearn to break free of his grandmother’s rituals but is too polite to do so.", "images": ["https://media.newyorker.com/photos/590951ae019dfc3494e9db73/4:3/w_620,c_limit/Luke-Barr-book.jpg", "https://media.newyorker.com/photos/5afb018f7295c82c7924c6ca/master/w_727,c_limit/Wilson-Royal-Wedding-Cake-2.jpg", "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1200,h_630,c_limit/wilson-royal-wedding-cake.jpg", "https://media.newyorker.com/photos/59095c54019dfc3494e9f753/4:3/w_620,c_limit/Food-Imagination.jpg", "https://media.newyorker.com/photos/5af45ec37fb33744eca3b053/master/w_80,c_limit/Royal-Wedding-Icon-051018.jpg", "https://media.newyorker.com/photos/59096ef01c7a8e33fb38e824/4:3/w_620,c_limit/Wilson-Reading-About-People-Eating.jpg", "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/master/w_727,c_limit/wilson-royal-wedding-cake.jpg", "https://media.newyorker.com/photos/5909727febe912338a377420/4:3/w_620,c_limit/Twilley-Teaching-Grownups-How-to-Eat.jpg", "https://media.newyorker.com/photos/5afb018fdda2d225595b0dbb/master/w_727,c_limit/Wilson-Royal-Wedding-Cake-3.jpg", "https://media.newyorker.com/photos/5afb019052bc692d8918c70a/master/w_727,c_limit/Wilson-Royal-Wedding-Cake-1.jpg"], "top_img": "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1200,h_630,c_limit/wilson-royal-wedding-cake.jpg", "keywords": [], "authors": ["Bee Wilson", "Joshua Rothman", "Dexter Filkins", "David Rohde", "Masha Gessen", "Jiayang Fan", "Nicola Twilley"], "canonical_link": "https://www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition", "title": "Prince Harry and Meghan Markle’s Wedding Cake Breaks with Centuries of Royal Tradition", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no,width=device-width,initial-scale=1,maximum-scale=1", "id": "5afaffc85474413779cf5a98", "parsely-metadata": "{\"id\":\"5afaffc85474413779cf5a98\",\"issueDate\":\"\",\"dek\":\"Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, the couple’s cake will be designed to eat, not to keep.\",\"section\":\"Annals of Gastronomy\",\"url\":\"https://www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition\",\"image\":{\"@type\":\"ImageObject\",\"contentUrl\":\"https://www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition\",\"url\":\"https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/4:3/w_960,c_limit/wilson-royal-wedding-cake.jpg\"}}", "copyright": "Copyright (c) Condé Nast 2019", "description": "Bee Wilson writes about Prince Harry and Meghan Markle’s wedding cake, baked by Claire Ptak, of the hip East London shop Violet Bakery, which sharply breaks with centuries of fruitcake tradition.", "keywords": "prince harry,wedding cake,royal weddings,meghan markle", "apple-itunes-app": "app-id=1081530898", "fb": {"app_id": 1147169538698836}, "news_keywords": "Culture, Annals of Gastronomy, prince harry, wedding cake, royal weddings, meghan markle", "og": {"locale": "en_US", "site_name": "The New Yorker", "image": "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1200,h_630,c_limit/wilson-royal-wedding-cake.jpg", "title": "Prince Harry and Meghan Markle’s Wedding Cake Breaks with Centuries of Royal Tradition", "description": "Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, the couple’s cake will be designed to eat, not to keep.", "url": "https://www.newyorker.com/culture/annals-of-gastronomy/prince-harry-and-meghan-markles-wedding-cake-breaks-with-centuries-of-royal-tradition", "type": "article"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"site": "@NewYorker", "domain": "www.newyorker.com", "card": "summary_large_image", "title": "Prince Harry and Meghan Markle’s Wedding Cake Breaks with Centuries of Royal Tradition", "description": "Unlike the monumental confections of yore, which were so solid that brides needed a special saw to make the first cut, the couple’s cake will be designed to eat, not to keep.", "image": {"src": "https://media.newyorker.com/photos/5afc4b3ec9d79f2c7fa1e907/16:9/w_1200,h_630,c_limit/wilson-royal-wedding-cake.jpg?mbid=social_retweet"}}, "pubdate": 20180516}, "movies": [], "publish_date": null, "source": "http://www.newyorker.com", "summary": ""}