{"url": "ew.com/tv/2018/01/29/shannen-doherty-charmed-reboots/", "text": "Charmed type TV Show Network WB Genre Sci-fi,\n\nDrama\n\nShannen Doherty is weighing in on The CW’s reboot of her fan favorite hit series Charmed.\n\nThe actress had a flurry of thoughts on the topic over the weekend while chatting with fans on Twitter. Doherty’s opinion is nuanced and complex; she isn’t simply pro- or anti-reboot. Based on her tweets, she’s intrigued and curious about the new project, and doesn’t want to be negative about it — she even defends the idea of a reboot in general — yet strongly agrees with some fans who object to the network’s description of the project as “feminist reboot” of the original series (when the 1998-2006 series was considered feminist too).\n\nImage zoom Getty Images\n\nFirst, on the very idea of a reboot:\n\nIm intrigued by the idea that a new generation might be comforted, inspired like all you were. Charmed helped us all in some way — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nAnd notes that it will mean more lead roles for women…\n\nExactly. More great roles for women. That’s a huge plus. — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nLikewise, while some have slammed the idea of bringing back Charmed as unoriginal, The WB series actually followed 1996’s similarly premised film The Craft and the 1995 book Practical Magic (which released a film version the same year Charmed hit the air). So at one point, the original Charmed was likewise considered by some to be a knock-off…\n\nI get that but I can tell you that we were inspired by practical magic. So again, they should perhaps simply do a show inspired by Charmed — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nAnd Doherty would rather not be negative about it…\n\nThank you. I love charmed. I also want it to be respected. I’m simply choosing to be constructive about it because negativity has no place in my life. — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nBUT … that official description though … (which described the new series this way: “This fierce, funny, feminist reboot of the original series centers on three sisters in a college town who discover they are witches. Between vanquishing supernatural demons, tearing down the patriarchy, and maintaining familial bonds, a witch’s work is never done”).\n\nYep. You nailed it. Their wording is terrible and a bit offensive. But, everyone makes mistakes. Perhaps with the backlash they will be more thoughtful in future. — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nYes I addressed this…. very ignorant stupid comment. Perhaps made by a millennial that never watched the show and just read a synopsis on it. — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nAlso, the reboot’s new cast better have different character names…\n\nIt will rub me the wrong way too — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nOh, and in case you’re wondering what Doherty is watching lately:\n\nThat’s why I rarely watch network tv. Alienist, Gypsy, narcos, big little lies, Ozark, American horror story, the crown, peaky blinders, godless… just a few I watch. — Shannen Doherty (@DohertyShannen) January 27, 2018\n\nPreviously, co-star Holly Marie Combs had her turn to weigh in on the Charmed reboot.\n\nSpeaking of reboots, Doherty will next be seen in the Paramount Network’s reboot of Heathers.", "images": ["https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ewedit.files.wordpress.com/2018/01/gettyimages-51096419.jpg", "https://ewedit.files.wordpress.com/2018/01/gettyimages-51096419.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768", "https://secure.gravatar.com/avatar/8507038badc1c41adb48fd6b51538fbd?s=300&d=blank&r=g"], "top_img": "https://ewedit.files.wordpress.com/2018/01/gettyimages-51096419.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "keywords": [], "authors": ["James Hibberd"], "canonical_link": "https://ew.com/tv/2018/01/29/shannen-doherty-charmed-reboots/", "title": "Shannen Doherty on Charmed reboot's 'terrible, offensive' description", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Charmed, Charmed reboot, Charmed revival, Shannen Doherty, Shannon Doherty. Holly Marie Combs, Rose McGowan, The CW", "news_keywords": "Charmed, Charmed reboot, Charmed revival, Shannen Doherty, Shannon Doherty. Holly Marie Combs, Rose McGowan, The CW", "description": "Shannen Doherty has some candid thoughts about The CW's 'Charmed' reboot -- some supportive, some more critical", "og": {"title": "Shannen Doherty on 'Charmed' reboot's 'terrible, offensive' description", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/01/29/shannen-doherty-charmed-reboots/", "description": "Actress has some candid thoughts on The CW's reboot (and some are quite supportive)", "image": {"identifier": "https://ewedit.files.wordpress.com/2018/01/gettyimages-51096419.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/tv/2018/01/29/shannen-doherty-charmed-reboots/", "description": "Shannen Doherty has some candid thoughts about The CW's 'Charmed' reboot -- some supportive, some more critical", "media": "https://ewedit.files.wordpress.com/2018/01/gettyimages-51096419.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/01/29/shannen-doherty-charmed-reboots/", "title": "Shannen Doherty on 'Charmed' reboot's 'terrible, offensive' description", "description": "Shannen Doherty has some candid thoughts about The CW's 'Charmed' reboot -- some supportive, some more critical", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2018/01/gettyimages-51096419.jpg?crop=0px%2C0px%2C1800px%2C945px&resize=1200%2C630"}, "fb": {"pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1517202000.0, "source": "http://ew.com", "summary": ""}