{"url": "http://www.nytimes.com/2008/08/23/us/politics/23text-biden.html", "text": "In all my time in the United States Senate, and I want you to know there's only four senators senior to me, but Barack, there's still 44 older than me. I want you to know that part. But all kidding aside, of all my years in the Senate, I have never in my life seen Washington so broken. I have never seen so many dreams denied and so many decisions deferred by politicians who are trying like the devil to escape their responsibility and accountability. But, ladies and gentlemen, the reckoning is now. And the reality, the reality is that we must answer the call or we will risk the harshest version and verdict of history. These times call for a total change in Washington's worldview. These times require more than a good soldier. They require a wise leader. A leader -- a leader who can deliver. A leader who can deliver the change we need.\n\nI'll say straight up to you - John McCain and the press knows this, is genuinely a friend of mine. I've known John for 35 years. He served our country with extraordinary courage and I know he wants to do right by America. But the harsh truth is, ladies and gentlemen, you can't change America when you boast. And these are John's words, quote, the most important issues of our day, I've been totally in agreement and support of President Bush. Ladies and gentlemen, that's what he said. You can't change America when you supported George Bush's policies 95% of the time. You can't change America when you believe, and these are his own words, that in the Bush administration we've made great progress economically. You can't change America and make things better for our senior citizens when you signed on to Bush's scheme of privatizing social security. You can't change America and give our workers a fighting chance when after 3 million manufacturing jobs disappear, you continue to support tax breaks for companies who ship our jobs overseas. You can't change America and end this war in Iraq when you declare and, again, these are John's words, no one has supported President Bush in Iraq more than I have, end of quote. Ladies and gentlemen, you can't change America, you can't change America when you know your first four years as president will look exactly like the last eight years of George Bush's presidency.\n\nMy friends -- yes, we can. My friends, I don't have to tell you, this election year the choice is clear. One man stands ready to deliver change we desperately need. A man I'm proud to call my friend. A man who will be the next president of the United States, Barack Amer - You know, you learn a lot of things being up close with a guy. Let me tell you about Obama. You learn a lot about a man when you campaign with him. When you debate him 12 or 13 times. When you hear him speak. When you see how he thinks. And you watch how he reacts under pressure. You learn a lot about his strength of his mind, and I think even more importantly, the quality of his heart. Ladies and gentlemen, no one knows better than I do that presidential campaigns are crucibles in which you're tested and challenged every single day. And over the past 18 months, I've watched Barack meet those challenges with judgment, intelligence, and steel in his spine. I've watched as he's inspired millions of Americans, millions of Americans to this new cause.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You will receive emails containing news content , updates and promotions from The New York Times. You may opt-out at any time. You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nAnd during those 18 months, I must tell you, frankly, I've been disappointed in my friend, John McCain, who gave in to the right wing of his party and yielded to the very swiftboat politics that he so -- once so deplored. And folks, campaigns for presidents are a test of character and leadership. And in this campaign, one candidate, one candidate has passed that test.\n\nBarack has the vision, and what you can't forget, you know his vision, but let me tell you something. He also has the courage, the courage to make this a better place, and let me tell you something else, this man is a clear eyed pragmatist who will get the job done. I watch with amazement as he came to the Senate. I watch with amazement. He made his mark literally from day one reaching across the aisle to pass legislation to secure the world's deadliest weapons, standing up to some of the most entrenched interests in Washington, risking the wrath of the old order to pass the most sweeping ethics reform in a generation. But I was proudest, I was proudest, when I watched him spontaneously focus the attention of the nation on the shameful neglect of America's wounded warriors at Walter Reed Army Hospital. Ladies and gentlemen, I know I'm told I talk too colloquially, but there's something about this guy. There's something about this guy. There's something about Barack Obama that allows him to bring people together like no one I have worked with and seen. There's something about Barack Obama that makes people understand if they make compromises they can make things better.\n\nIt's been amazing to watch him. But then again, that's been the story of his whole life. I end where I began. This is a man raised by a single mother who sometimes was on food stamps as she worked to put herself through school, by grandparents from the prairies of Kansas who loved him, a grandfather, a grandfather who marched in Paton's Army and then came home and went to college on the G.I. Bill, and a grandmother, a grandmother with just a high school education, started off working in a small bank in the secretarial pool and rose to be vice president of that bank. Ladies and gentlemen, ladies and gentlemen, these remarkable people gave Barack Obama the determination and drive, and, yes, the values to turn down that big job on Wall Street, to come to Chicago's south side, where he helped workers help themselves after the steel mills had been shut down and the jobs disappeared.\n\nLadies and gentlemen, my wife Jill, who you'll meet soon, is drop dead gorgeous. My wife Jill, who you'll meet soon, she also has her doctorate degree, which is a problem. But all kidding aside, my Jill, my Jill, my wife Jill and I are honored to join Barack and Michelle on this journey, because that's what it is. it's a journey. We share the same values, the values that we had passed on to us by our parents and the values Jill and I are passing on to our sons Beau and Hunter and Ashley.\n\nLadies and gentlemen, I'm here for their future. I'm here for the future of your kids. I'm here for everyone I - I'm here for everyone I grew up in Scranton, Pennsylvania, who's been forgotten and everybody in Claymont, Delaware, in Wilmington where I lived. I'm here for the cops and the fire fighters, the teachers and the line workers, the folks who live - the folks whose lives are the measure of whether the American dream endures.\n\nLadies and gentlemen, this is no ordinary time. This is no ordinary election. And this may be our last chance to reclaim the America we love, to restore America's soul. Ladies and gentlemen, America gave Jill and me our chance. It gave Barack and Michelle their chance to stand on this stage today. It's literally incredible. These values, this country gave us that chance. And now it's time for all of us, as Lincoln said, to put our feet in the right place and to stand firm. Ladies and gentlemen, it's time to elect Barack Obama president. It's our time. It's America's time. God bless America, and may he protect our troops.", "images": ["https://static01.nyt.com/images/2008/08/24/us/24obama.751.jpg", "https://static01.nyt.com/images/icons/t_logo_291_black.png"], "top_img": "https://static01.nyt.com/images/icons/t_logo_291_black.png", "keywords": [], "authors": [], "canonical_link": "https://www.nytimes.com/2008/08/23/us/politics/23text-biden.html", "title": "Senator Biden’s Remarks in Springfield, Ill.", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "sourceApp": "nyt-v5", "applicationName": "article", "al": {"android": {"url": "nytimes://reader/id/1194807802964", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2008/08/23/us/politics/23text-biden.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2008/08/23/us/politics/23text-biden.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "twitter": {"app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nytimes://reader/id/1194807802964"}}, "site": "@nytimes", "url": "https://www.nytimes.com/2008/08/23/us/politics/23text-biden.html", "title": "Senator Biden’s Remarks in Springfield, Ill.", "image": "https://static01.nyt.com/images/icons/t_logo_150_black.png", "card": "summary"}, "robots": "noarchive", "genre": "Text", "articleid": 1194807802964, "usageTerms": "https://help.nytimes.com/hc/en-us/articles/115014893968-Terms-of-sale", "hdl": "Senator Biden’s Remarks in Springfield, Ill.", "col": "Transcript", "pdate": 20080823, "utime": 20141127082427, "ptime": 20080823172321, "DISPLAYDATE": "Aug. 23, 2008", "dat": "Aug. 23, 2008", "msapplication-starturl": "http://www.nytimes.com", "cre": "The New York Times", "slug": "23text-biden", "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/politics/index.jsonp", "published": "2008-08-23T17:23:21-04:00", "modified": "2014-11-27T08:24:27-05:00", "section": "Politics", "section-taxonomy-id": "23FD6C8B-62D5-4CEA-A331-6C2A9A1223BE", "top-level-section": "us"}, "sectionfront_jsonp": "https://static01.nyt.com/services/json/sectionfronts/politics/index.jsonp", "og": {"url": "https://www.nytimes.com/2008/08/23/us/politics/23text-biden.html", "type": "article", "title": "Senator Biden’s Remarks in Springfield, Ill.", "image": "https://static01.nyt.com/images/icons/t_logo_291_black.png"}, "fb": {"app_id": 9869919170, "pages": 993603507345855}, "tone": "news", "PT": "article", "CG": "us", "SCG": "politics", "PST": "Text", "tom": "Text", "edt": "The New York Times on the Web", "dfp-ad-unit-path": "us/politics", "dfp-amazon-enabled": "false"}, "movies": [], "publish_date": 1219464000.0, "source": "http://www.nytimes.com", "summary": ""}