{"url": "ew.com/news/2017/04/10/united-flight-man-dragged-celebrities-react/", "text": "Only a few weeks after receiving backlash for not allowing two girls to fly in leggings, United Airlines is again making headlines after a passenger was forcibly removed from an overbooked flight to make room for United employees to travel.\n\nAnother traveler told the Washington Post that four passengers were asked to leave a flight from Chicago to St. Louis on Sunday night to make room for four airline employees. One man declined to leave, saying he was a doctor who had to see patients in the morning. The airline manager would not relent, and the man yelled that he was being targeted because he was Chinese, a passenger told the Post. When he refused to give up his seat, police officers boarded, pulled him screaming from his seat, and dragged him by his arms through the aisle — a scene that horrified other passengers, according to videos taken by witnesses and posted on the internet.\n\n@United overbook #flight3411 and decided to force random passengers off the plane. Here's how they did it: pic.twitter.com/QfefM8X2cW — Jayse D. Anspach (@JayseDavid) April 10, 2017\n\nAnother video, recorded after the initial incident, shows the man bleeding and repeating, “Just kill me.”\n\nIn a statement posted to Twitter, United CEO Oscar Munoz said, “This is an upsetting event to all of us here at United. I apologize for having to re-accommodate these customers. Our team is moving with a sense of urgency to work with the authorities and conduct our own detailed review of what happened. We are also reaching out to this passenger to talk directly to him and further address and resolve this situation.”\n\nUnited CEO response to United Express Flight 3411. pic.twitter.com/rF5gNIvVd0 — United (@united) April 10, 2017\n\nThe news and troubling videos sparked widespread criticism of the airline, including by many in Hollywood.\n\n“This could be me or you next time,” Selma director Ava DuVernay wrote on Twitter. “Shame on @United who broke customer trust + instigated this. Shame on the airport cops. Cowardly assault.”\n\nOthers to slam the airline included Joss Whedon, Kumail Nanjiani, and Chrissy Teigen. See more reactions below.\n\nThis could be me or you next time. Shame on @United who broke customer trust + instigated this. Shame on the airport cops. Cowardly assault. https://t.co/MY729HippE — Ava DuVernay (@ava) April 10, 2017\n\nA thoughtful thread on the @United travesty that's worth your next two minutes. 👇🏾 https://t.co/STnwyR877H — Ava DuVernay (@ava) April 10, 2017\n\nGetting on a United flight this morning. Excited to, I don't know… stay on? — Joss Whedon (@joss) April 10, 2017\n\n\"For the comfort and safety of the other passengers, please remember we will be resorting to cannibalism BY GROUP NUMBER\" #united — Joss Whedon (@joss) April 10, 2017\n\nJet Blue's new slogan – extra leg room and we won't physically drag you down the aisle screaming in pain. — billy eichner (@billyeichner) April 10, 2017\n\ncannot wait to use \"i will re-accommodate your ass\" in my next fight — christine teigen (@chrissyteigen) April 10, 2017\n\nI am appalled and absolutely disgusted….this is unacceptable. https://t.co/ZO7X2Cbdve — Zendaya (@Zendaya) April 10, 2017\n\nThe passive language here is how corporations deflect responsibility. \"Review of what happened.\" It didn't just happen. You did this. https://t.co/nTGOXfDMZ4 — Kumail Nanjiani (@kumailn) April 10, 2017\n\nSo @united sucks. But the Chicago police who dragged the man off the flight are also monsters. Police using unnecessary force, again. — Kumail Nanjiani (@kumailn) April 10, 2017\n\nHaving flown #united last week, I feel very blessed to not be tweeting this message from a hospital bed. — Josh Gad (@joshgad) April 10, 2017\n\nDear #united, I had to \"re-accommodate\" someone once pic.twitter.com/MP3ZJDv85m — Joe Thomas (@joethomas73) April 10, 2017\n\nIronically, not enough seats in the conference room where United is having its crisis meeting. — Jon Lovett (@jonlovett) April 10, 2017\n\n*walks into dinner party, bloodied and bruised.*\n\n\"Whoa, what happened to you?\"\n\n\"United overbooked again.\" — Shannon Woodward (@shannonwoodward) April 10, 2017\n\nToday, United Airlines became President. https://t.co/HW2i03mFc0 — Shannon Woodward (@shannonwoodward) April 10, 2017\n\nIf Southwest Airlines doesn't jump on this United fiasco with a 'wanna getaway' spot, then what are we doing? — Michelle Beadle (@MichelleDBeadle) April 10, 2017\n\nCongrats United, you now have all the volunteers you could ever want giving up their seats on your flights. — Aparna Nancherla (@aparnapkin) April 10, 2017\n\nAfter losing my job as head of ad content for Pepsi, I have to say my 1st day running customer services for United Airlines has been lively. — David Schneider (@davidschneider) April 10, 2017\n\nAm I only one wondering if United thing wouldn't happen if every airport employee w a badge hadn't been somehow emboldened since January? — Andy Richter (@AndyRichter) April 10, 2017\n\nUnited Airlines new slogan: “Fly the friendly skies once you get off the scary ground.” — Albert Brooks (@AlbertBrooks) April 10, 2017\n\nAh, yes, the victim-blaming is right on schedule. Do not accept this. #Resist the slide into authoritarianism with everything you have. https://t.co/wFciEcyuT8 — Wil Wheaton (@wilw) April 10, 2017\n\nMe: \"I'm pretty sure that @united can't get any worse.\"@united: \"Hold my tiny airplane bottle of booze.\" — Wil Wheaton (@wilw) April 10, 2017\n\nI bet 90 percent of today's calls between @United and the FAA are about the costs of enforcing a ban on handheld devices — Dan Harmon (@danharmon) April 10, 2017\n\nUnited we stand against United. — Lizz Winstead (@lizzwinstead) April 10, 2017\n\nI feel like Pepsi and United are pulling from the same employment agencies — Whitney Cummings (@WhitneyCummings) April 10, 2017\n\nThis is deeply disturbing! An Asian man dragged off a plane despite having a boarding pass. #America https://t.co/qNgrCxhgw6 — Siddharth (@Actor_Siddharth) April 10, 2017\n\nUnited. Fly the Friendly Skies. Friendly…like this boot on your throat. — Jeffrey Wright (@jfreewright) April 10, 2017", "images": ["https://ewedit.files.wordpress.com/2017/04/gettyimages-613951568.jpg?crop=150px%2C0px%2C2402px%2C1801px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768", "https://secure.gravatar.com/avatar/5ef8613926fe5ac5d5623868eca6ee9f?s=300&d=blank&r=g"], "top_img": "https://ewedit.files.wordpress.com/2017/04/gettyimages-613951568.jpg?crop=150px%2C0px%2C2402px%2C1801px&resize=1200%2C630", "keywords": [], "authors": ["Derek Lawrence"], "canonical_link": "https://ew.com/news/2017/04/10/united-flight-man-dragged-celebrities-react/", "title": "Celebrities slam United Airlines over passenger who was dragged off flight", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "United Airlines, Ava DuVernay, Joss Whedon, Chrissy Teigen", "news_keywords": "United Airlines, Ava DuVernay, Joss Whedon, Chrissy Teigen", "description": "Ava DuVernay, Joss Whedon, and Chrissy Teigen were among those to criticize the airline over the disturbing videos.", "og": {"title": "Celebrities Slam United Airlines Over Passenger Who Was Dragged Off Flight", "type": "article", "site_name": "EW.com", "url": "https://ew.com/news/2017/04/10/united-flight-man-dragged-celebrities-react/", "description": "Ava DuVernay, Joss Whedon, and Chrissy Teigen were among those to criticize the airline over the disturbing video.", "image": {"identifier": "https://ewedit.files.wordpress.com/2017/04/gettyimages-613951568.jpg?crop=150px%2C0px%2C2402px%2C1801px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/news/2017/04/10/united-flight-man-dragged-celebrities-react/", "description": "Ava DuVernay, Joss Whedon, and Chrissy Teigen were among those to criticize the airline over the disturbing videos.", "media": "https://ewedit.files.wordpress.com/2017/04/gettyimages-613951568.jpg?crop=150px%2C0px%2C2402px%2C1801px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/news/2017/04/10/united-flight-man-dragged-celebrities-react/", "title": "Celebrities Slam United Airlines Over Passenger Who Was Dragged Off Flight", "description": "Ava DuVernay, Joss Whedon, and Chrissy Teigen were among those to criticize the airline over the disturbing videos.", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2017/04/gettyimages-613951568.jpg?crop=150px%2C0px%2C2402px%2C1801px&resize=1200%2C630"}, "fb": {"pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1491796800.0, "source": "http://ew.com", "summary": ""}