{"url": "www.biography.com/people/beyonce-knowles-39230", "text": "Beyoncé Knowles is a multi-platinum, Grammy Award-winning recording artist who's acclaimed for her thrilling vocals, videos and live shows.\n\nWho Is Beyoncé Knowles? Born in Houston, Texas, Beyoncé Knowles first captured the public's eye as lead vocalist of the R&B group Destiny's Child. She later established a solo career with her debut album Dangerously in Love, becoming one of music's top-selling artists with sold-out tours and a slew of awards. Knowles has also starred in several films, including Dream Girls. She married hip-hop recording artist Jay-Z in 2008. In late 2013, she surprised audiences by releasing her fifth studio album, self-titled Beyoncé, and has twice performed at the Super Bowl. She released her sixth studio album, Lemonade, after the airing of an HBO special in April 2016, and two years later she dropped a joint album with Jay-Z, Everything Is Love, while the two were on tour.\n\nEarly Life\n\nSinger and actress Beyoncé Giselle Knowles was born on September 4, 1981, in Houston, Texas. She started singing at an early age, competing in local talent shows and winning many of these events by impressing audiences with her singing and dancing abilities.Destiny's Child\n\nTeaming up with her cousin, Kelly Rowland, and two classmates, Beyoncé formed an all-female singing group. Her father, Matthew Knowles, served as the band's manager. The group went through some name and line-up changes before landing a record deal in 1997 with Columbia Records. Destiny's Child soon became one of the most popular R&B acts, with the release of their first, self-titled album. Gaining momentum, the group scored its first No. 1 single on the pop charts with \"Bills, Bills, Bills,\" off their second album. The recording also featured another smash hit, \"Say My Name.\"\n\nWhile enjoying her group's success, Beyoncé began exploring other projects. She made her acting debut in 2001 with a starring role in MTV's Carmen: A Hip Hopera. She then co-starred with Mike Myers in the Austin Powers spy parody Goldmember the following year.\n\nSolo Career\n\nOn the musical front, Beyoncé took center stage as a solo artist, releasing her first album, Dangerously in Love, in 2003. The recording became a huge success for her both commercially and critically. It sold millions of copies and won five Grammy Awards. On the album, Beyoncé worked with a number of different artists, including Missy Elliott, Sean Paul and Jay-Z. She was rumored to be dating Jay-Z around this time, but the couple did not publicly acknowledge their relationship.\n\nDestiny's Child released their last studio album, Destiny Fulfilled, in 2004, and officially broke up the following year.\n\nOn her own, Beyoncé continued to enjoy great success. Her second studio album, 2006's B'Day featured such hits as \"Irreplaceable\" and \"Deja Vu.\" On the big screen, she starred opposite Jennifer Hudson, Jaime Foxx and Eddie Murphy in Dreamgirls. The film was adapted from the hit Broadway musical of the same name.\n\nBeyoncé and Jay-Z\n\nIn 2008, Beyoncé married rapper and music mogul Jay-Z in a small, private ceremony in New York City. Among the guests sighted at the wedding were Beyoncé's mother, Tina Knowles; her father and manager, Matthew; her sister, Solange; Destiny's Child members Kelly Rowland and Michelle Williams; and friend Gwyneth Paltrow.\n\nThe newlywed continued to work as hard as ever, promoting her latest effort, I am ... Sasha Fierce (2008). Beyoncé scored two big hits off the album—\"Single Ladies (Put a Ring on It)\" and \"If I Were a Boy.\" She also returned to the big screen that year, starring as R&B legend Etta James in Cadillac Records. The following January, Beyoncé sang James' trademark song, \"At Last,\" for President Barack Obama and First Lady Michelle Obama at his inaugural ball.\n\nIn addition to acting and performing, Beyoncé ran a clothing line called House of Dereon with her mother. She also launched her own fragrance, Heat, in 2010. Throughout her career, Beyoncé has served as a spokesperson and model for several other brands, including L'Oreal and Tommy Hilfiger.\n\nBeyoncé found herself under fire after performing a private concert for Libyan leader Muammar al-Qaddafi on New Year's Eve in 2010. She later donated her fee from the event to help victims of the Haitian earthquake. According to some reports, Beyoncé said that her father had been responsible for arranging the Libyan concert. She decided to drop her father as her manager in March 2011. Later that year, Beyoncé reached the top of the album charts with her latest solo release, 4.\n\nIn January 2013, Beyoncé generated some negative headlines for her performance at President Obama's second inauguration in Washington, D.C. She was criticized for reportedly pre-recording a version of \"The Star-Spangled Banner\" and lip-syncing to her own track during the outdoor ceremony. Despite wide media coverage, in the days following the incident, Beyoncé did not publicly address the controversy.\n\nNot long after, prior to her appearance at Super Bowl XLVII, Beyoncé performed the song live at a press conference. She explained to reporters that she had used a \"backing track\" at the inauguration, adding that she would \"absolutely be singing live\" at the NFL's biggest event of the year, according to The Huffington Post.\n\nIndeed, Beyoncé more than redeemed herself in the public eye at the Super Bowl on February 3, 2013. During the event's halftime show, she took the stage and wowed the crowd, joined by her former Destiny's Child bandmates Rowland and Williams for parts of her performance. Beyoncé also announced that her next major tour would start in the spring of 2013.\n\nBeyoncé attends TIDAL X 1015 in New York City. Photo: Theo WargoGetty Images for TIDAL\n\nAwards, Accolades and Surprise Album\n\nAt the 2010 Grammy Awards, Beyoncé walked away with six honors—the most wins in a single night by a female artist. Her record was matched two years later by pop/soul artist Adele. In 2010, she also tied the record for most No. 1 hits on Billboard’s Pop Songs chart, which is based on radio airplay. In 2011, she made the Forbes Top 10 list of entertainment's highest-earning women. By 2013, Beyoncé had won 16 Grammys.\n\nBeyoncé broke records once again on December 13, 2013, with her fifth studio album, self-titled Beyoncé. The album surprised fans and critics alike, as no promotion for the album had been announced prior to its release. The record, which Beyoncé called a \"visual album,\" was released exclusively on iTunes, with physical discs available for purchase after December 18. The record-breaking album sold more than 800,000 copies throughout the weekend it was released alone.\n\nThe collection—which was the fastest-selling album ever distributed by iTunes—also marked Beyoncé's fifth studio album to debut at No. 1, making her the first woman to reach No. 1 on the Billboard 200 with her first five albums. She released the Platinum Edition of the album in 2014, and the following year won three additional Grammys, including a Best R&B Performance award for \"Drunk in Love.\"\n\nSecond Super Bowl and 'Lemonade'\n\nIn February 2016, Beyoncé returned to the Super Bowl stage, once again earning raves for her performance. This time around she appeared with Bruno Mars and Chris Martin of the band Coldplay, highlighting her new single \"Formation\" and subsequently announcing a world tour. The tune, its video and accompanying halftime show also garnered a wave of attention for politicized lyrics and imagery touching on everything from black power to Hurricane Katrina.\n\nJust two months later, HBO aired an hour-long Beyoncé conceptual film, Lemonade, which presented tracks from the album of the same name released immediately afterward. The cable special showcased the singer reeling from the romantic and sexual betrayal of her partner while acknowledging the strength found in communities of African-American women. Tennis star Serena Williams and young actress Quvenzhané Wallis also made appearances in the New Orleans-based project, which was helmed by a variety of directors and featured poetry from Warsan Shire.\n\nLemonade the album was only initially available via Tidal, the online streaming service backed by Beyoncé's spouse, Jay-Z, and then eventually became available on iTunes and Amazon with its accompanying film. Musical contributors to the project, which quickly garnered acclaim, included Jack White, The Weeknd, James Blake and Kendrick Lamar. Lemonade debuted at No. 1, making Beyoncé the only artist in history to have all of her first six studio albums reach the top of Billboard's album charts.\n\nIn February 2017, a pregnant Beyoncé delivered a surprise performance at the Grammys, singing songs from Lemonade amid a swirling spectacle of lights, holograms and backup dancers. Although she lost the coveted Album of the Year Grammy to Adele, she did take home two awards, for Best Urban Contemporary Album and Best Music Video.\n\nKnown as \"Queen Bey,\" the famed singer readied to take on the role of a different queen with the November 2017 announcement that she was headlining a live-action remake of Disney's The Lion King.\n\nShortly afterward, it was revealed that Queen Bey also reigned as the highest-earning female musician of the year. According to Forbes, Beyoncé snagged $105 million in pretax income June 2016 through June 2017, a number that easily outpaced the earnings of fellow divas Adele ($69 million) and Taylor Swift ($44 million). Forbes attributed the windfall to the success of Lemonade and the singer's Formation World Tour, which grossed approximately $250 million.\n\nCoachella, OTR II and 'Everything Is Love'\n\nIn March 2018, reports surfaced that Beyoncé was working on new music and preparing to hit the road with Jay-Z. Following a false alarm in which a tour announcement appeared and quickly disappeared from her Facebook page, the power couple officially announced that their On the Run II (or OTR II) Tour would kick off in Cardiff, Wales, on June 6.\n\nOne year after she canceled a planned appearance at Coachella because of her pregnancy, Beyoncé took the stage for an eagerly anticipated performance at the April 2018 music festival. The first black woman to headline the event, Beyoncé wowed attendees and critics alike with her top-shelf singing and choreography, delivering favorites like \"Crazy In Love\" and a rendition of the civil rights anthem \"Lift Every Voice and Sing.\" She was also joined during the two-hour set by hubby Jay-Z, sister Solange and her old Destiny's Child cohorts, Rowland and Williams.\n\nOne week later, Beyoncé delivered another highly acclaimed show at the festival. While the 27-song set and guest list remained nearly identical, the headliner shook things up with her costume changes, coming across as looser and more \"off-the-cuff,\" per Rolling Stone.\n\nIn June, Beyoncé and Jay-Z embarked on the European leg of their 48-date tour. While they lived up to expectations with their theatrics and swagger, the couple also surprised fans with the release of their joint album, Everything Is Love, following a London show on June 16. Initially available for streaming only on the Jay-Z owned Tidal, the nine-track album was accompanied by a video for the track \"Apes**t,\" which featured the couple and their dancers gallivanting around some of the world's most famous artworks at the Louvre in Paris.\n\nLater in the tour, during a performance in Atlanta, Beyoncé and Jay-Z faced a potentially dangerous moment when an audience member climbed on stage and attempted to chase the stars backstage, before the backup dancers banded together to stop the intruder.\n\nAround that time, Beyoncé earned her fourth cover spread and story for Vogue. The production made headlines for the singer's control over the photo shoot, for which she wore minimal makeup and showed off her natural hair, as well as her unfiltered interview in which she embraced her \"FUPA\" — the leftover weight gain in the abdominal area from her pregnancy.\n\n'Homecoming' and 'The Lion King'\n\nOn April 17, 2019, Beyoncé released a Netflix documentary about her Coachella performance, 'Homecoming,' and a surprise companion album which included 40 live tracks.\n\nJuly brought the premiere of The Lion King, which featured Beyoncé as Nala, the childhood friend turned love interest of the titular character, played by Donald Glover. The singer also curated and produced a companion album for the production, titled The Lion King: The Gift, and released the single \"Spirit\" around the time of the film's release.\n\nBeyoncé's Children\n\nFollowing years of pregnancy rumors, Beyoncé and Jay-Z went public with the news of their impending new arrival in 2011, the mom-to-be showing off her growing baby bump at the MTV Video Music Awards that August.\n\nBeyoncé and Jay-Z welcomed a baby daughter, Blue Ivy Carter, on January 7, 2012. The couple spared no expense to maintain their privacy during this special time, renting out a floor of New York's Lenox Hill Hospital.\n\nIn February 2017, Beyoncé announced on Instagram that she and Jay-Z were expecting twins. Later, the iconic shot was revealed to be the year's most-liked Instagram post, with 11.1 million fans offering their approval.\n\nThey welcomed twins, a boy and a girl, in June 2017. Although the couple didn't immediately confirm the twins' birth or their names, People magazine reported that they had filed trademark documents at the United States Patent and Trademark Office for the names Sir and Rumi. In the early morning hours of July 14, Beyoncé made it official, posting a photo in which she's holding her one-month old twins.", "images": ["https://www.biography.com/.image/ar_1:1%2Cc_fill%2Ccs_srgb%2Cg_face%2Cq_auto:good%2Cw_300/MTU0MTU0MTc3NzkzMTA3MzU1/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal-sqaure.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY4MzYzOTYxODA0NTYx/the-supremes---mini-bio.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MjUwMDkxMDM5NDY2OTc3/jay-z---relationship-with-beyonce.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQxMTE3Nzg3MDU1NTEy/rihanna---mini-biography.jpg", "https://www.biography.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTM0MTQ5NzA3NDQxNzE5/navbarwhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxOTEwODU4MjUz/bruno-mars-17162400-1-402.jpg", "https://www.biography.com/.image/c_fit%2Ccs_srgb%2Cq_auto:good%2Cw_458/MTQ1NTMzOTkyNDA0MjY0NTAz/sitelogowhite.png", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTM5ODM2NTQ0ODIwNjMy/alicia-keys---mini-biography.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE4MDAzNDEwNTI2OTYzMjE0/aretha-franklin-9301157-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQxMTE1OTA4MzM1MDAw/kanye-west---mini-biography.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTU0OTkwNDUxOTQ5MDUzNDQ3/kanye-west-attends-the-christian-dior-show-as-part-of-the-paris-fashion-week-womenswear-fall-winter-2015-2016-on-march-6-2015-in-paris-france-photo-by-dominique-charriau-wireimage-square.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE5NDg0MDU1MjcwNDkxNjYz/hilary-duff-17191546-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTM5ODMzODYwMjY5NDY0/usher---mini-biography.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwNDE2NjMzOTcyMTIw/ella-fitzgerald---first-lady-of-jazz.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQ3NTI2ODcxNDU2Njg3NTk4/nicki_minaj_photo_by_kevin_mazur_wireimage_getty_498353136.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTM5ODM1NzM5MzE3NjU2/jennifer-hudson---mini-biography.jpg", "https://www.biography.com/.image/t_share/MTU0MTU0MTc3NzkzMTA3MzU1/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal-sqaure.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTM5OTQwNjk3OTc0MjQx/taylor-swift---mini-bio.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTIwNjA4NjMzNDczNzYyODI4/95-106-capital-fm-summertime-ball-2012---media-run.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwNDE3NzA3Mzg2MjY0/ella-fitzgerald---uplifting-voice.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1MTQwNTc1ODE2MDAwOTIw/jay-z---mini-biography.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY1NDI1OTM1ODA0MTc3/britney-spears---full-episode.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE1ODA0OTcxNTA4MDA4NDYx/jennifer-hudson-507747-1-402.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY3NjU0MjE4NDU4Njc5/mariah-carey---mini-biography.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTE4MDAzNDEwNTY0MTIyMTI2/whitney-houston-9344818-1-402.jpg", "https://www.biography.com/.image/t_share/MTU0MTU0MTc3NzkzMTA3MTA0/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQ0NTk4NzY3ODM4OTYzMDMx/alicia_keys_michael_muller_nbc_nbcu_getty_images_592222308_profile.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_1280/MTY4Mjc5OTY4NzQ3ODg5ODI5/black-background.jpg", "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cg_face%2Ch_170%2Cq_auto:good%2Cw_300/MTQ1NDY3OTQ1NzM5MzYzODk1/lady-gaga---mini-biography.jpg"], "top_img": "https://www.biography.com/.image/t_share/MTU0MTU0MTc3NzkzMTA3MzU1/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal-sqaure.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/musician/beyonce-knowles", "title": "Life, Movies & Family", "meta_data": {"referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "google-site-verification": "Rw9Z4UJK89QUjgFzrFI2QbZmTRyWu_Cuy15hu4Y1MXw", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - www.saymedia.com", "pinterest": "nohover", "description": "Beyoncé Knowles is recognized as a soul/pop vocalist, trendsetting music video performer, multiple Grammy Award winner and film star. Learn more at Biography.com.", "section": "Musicians", "pagetype": "person", "robots": "noodp", "item-id": "ci01a87e1d5a12860f", "published": "2018-04-16T12:57:11Z", "modified": "2019-07-16T15:43:11Z", "dcterms.rightsHolder": "Biography and the Biography logo are registered trademarks of A&E Television Networks, LLC.", "dcterms.dateCopyrighted": 2019, "twitter": {"card": "summary_large_image", "site": "@bio", "url": "https://www.biography.com/musician/beyonce-knowles", "image": "https://www.biography.com/.image/t_share/MTU0MTU0MTc3NzkzMTA3MzU1/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal-sqaure.jpg", "description": "Beyoncé Knowles is a multi-platinum, Grammy Award-winning recording artist who's acclaimed for her thrilling vocals, videos and live shows.", "domain": "www.biography.com"}, "og": {"type": "website", "url": "https://www.biography.com/musician/beyonce-knowles", "title": "Beyoncé Knowles", "description": "Beyoncé Knowles is a multi-platinum, Grammy Award-winning recording artist who's acclaimed for her thrilling vocals, videos and live shows.", "image": "https://www.biography.com/.image/t_share/MTU0MTU0MTc3NzkzMTA3MzU1/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal-sqaure.jpg", "site_name": "Biography"}, "fb": {"pages": 123492867697144, "app_id": 104784826244596}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Biography", "parsely-title": "Beyoncé Knowles - Biography", "parsely-link": "https://www.biography.com/musician/beyonce-knowles", "parsely-image-url": "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:good%2Cw_620/MTU0MTU0MTc3NzkzMTA3MzU1/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal-sqaure.jpg", "parsely-post-id": "ci01a87e1d5a12860f", "parsely-pub-date": "2018-04-16T12:57:11Z", "parsely-section": "Musicians", "parsely-metadata": "{\"associated_content\":[\"Jay-Z\",\"Kelly Rowland\",\"Solange Knowles\",\"Prince\"]}", "sailthru.title": "Beyoncé Knowles", "sailthru.image.full": "https://www.biography.com/.image/t_share/MTU0MTU0MTc3NzkzMTA3MzU1/beyonce-attends-tidal-x-1015-on-october-15-2016-in-new-york-city-photo-by-theo-wargogetty-images-for-tidal-sqaure.jpg", "sailthru.date": "2018-04-16T12:57:11Z", "sailthru.description": "Beyoncé Knowles is recognized as a soul/pop vocalist, trendsetting music video performer, multiple Grammy Award winner and film star. Learn more at Biography.com.", "phx": {"content-item-id": "ci01a87e1d5a12860f", "content-object-type": "ContentPerson"}}, "movies": [], "publish_date": 1523883431.0, "source": "http://www.biography.com", "summary": ""}