{"url": "www.thetalko.com/trouble-in-paradise-15-reasons-prince-harry-and-meghan-markle-wont-make-it-down-the-aisle/", "text": "On November 27th last year, Prince Harry and Meghan Markle announced their engagement to the world.\n\nMany were quite shocked as the Suits actress showed off her sparkling ring with diamonds that were once owned by his late mother, Princess Diana, as they had only been dating for 18 months.\n\nPrince Harry told the BBC in their official engagement interview, \"She didn’t even let me finish (proposing). She said, ‘Can I say yes? Can I say yes?’ And then was hugs and I had the ring on my finger and I was like, can I give you the ring? She goes, ‘Oh yes, the ring.’ So no it was a really nice moment, it was just the two of us and I think managed to catch her by surprise as well.\" If the couple are to marry, then she will become the first American in 81 years to marry into the Royal family since Wallis Simpson married King Edward VIII, forcing his abdication from the throne.\n\nAlthough the couple appeared to be happy, as time has gone by there have been a few scandals and complications. These are all the reasons why this romance is becoming less of a fairytale and more like it's heading for the rocks.\n\n15 Why Did Harry Really Push Meghan's Hand Away In This Video?\n\nexpress.co.uk\n\nWhen you're one of the most photographed couples in the world, the paparazzi will be sure to capture moments you don't quite want to be made public.\n\nLike in this video when Harry and Meghan were in Brixton for charity work, she reaches out for her hand but he shuns her away with no explanation.\n\nWas there a fight in the car before they arrived? Or has the couple just been spending too much time together carrying out their Royal duties?\n\nLocals weren't overjoyed by the visit as one accused their charity work of being a 'stunt'. Local storeowner Mike Eweje told the Daily Express, \"It’s a stunt for the Royal family. People don’t care about the Royal wedding because they don’t care about people around here.\"\n\n14 Has Meghan Been Dishonest About The Royals Since The Very Beginning?\n\nmix967.ca\n\nAccording to Meghan, she didn't know anything about the Royal family before she met her Prince but a high school friend has revealed that's not true. Ninaki Priddy, who has known the former actress since she was 11, told the Daily Mail, \"I know the Royal Family was something she found fascinating.\"\n\n\"She had one of Princess Diana’s books (Diana: Her True Story) on her bookshelf, and even when she was with (her ex-husband) she told me she wanted to go and stay in London for at least a month.\"\n\nThe ex-BFF also added that fame had completely changed Meghan, she said, \"Maybe she had started to change before then, but I was refusing to see it. The tone of her voice, her mannerisms, the way she laughed didn’t seem real to me anymore.\"\n\n13 Marriage Of Royalty And Hollywood Is Too Risky For House Windsor\n\nbusinessinsider.com\n\nFor many commentators, the marriage of Hollywood and Royalty simply doesn't work and could even be the end of House Windsor.\n\nOne anonymous staffer who works inside the palace told the Daily Star, \"I know Her Majesty and the Prince of Wales are not happy with her. It is very serious.\"\n\nThe monarchy is already fragile as the public has less patience with the Royal ways, so could this marriage be the final nail in the coffin?\n\nMax Hastings from the Daily Mail revealed, \"Now that Ms. Markle has gushed all over Vanity Fair about her relationship with Harry for no better purpose than to satisfy a yearning for fame, she cannot at some future date reinvent herself as a princess. The monarchy is sustained by a web of delightful illusions and fantasies that are based on the concealment from the eyes of us commoners, the humdrum ordinariness of the Royal Family’s individual members.\"\n\n12 Harry Is The Ultimate Commitment-Phobe\n\nvanityfair.com\n\nIt's fair to say that Prince Harry isn't the type of guy who likes commitment. He is well known for his on-and-off relationship with Chelsea Davey that lasted for a bumpy seven years and she was even his date at his brother's wedding. He also dated TV presenter Natalie Pinkham, he enjoyed drink dates with Kate's good friend Astrid Harbord and he was hooking up with presenter Caroline Flack as well.\n\nFlack recalls, \"Once the story got out, that was it. We had to stop seeing each other. I was no longer Caroline Flack, TV presenter, I was Caroline Flack, Prince Harry's bit of rough.\"\n\nIt's been tough for any woman to try and get him to commit for good and there is always the chance he will get cold feet before the big day. One source told The Daily Beast, \"There is always room for doubt because he is a serial commitment-phobe. He is said to be a ‘love addict’ and his parents’ example is far from encouraging.\"\n\n11 Meghan Forced To Erase Her Whole Social Media History\n\nusanetwork.com\n\nMeghan, just like the rest of us, loved her social media and would regularly update her accounts with pictures of her on a holiday or relaxing at home. However, there is no place for Instagram or Twitter in the Royal family, so those accounts had to go for good.\n\nShe also had to shut down her own lifestyle blog, The Tig, after she started dating Harry.\n\nThe official statement from the palace said she was \"grateful to everyone who has followed her social media accounts over the years\" but had closed them \"as she has not used these accounts for some time.\" Meghan will likely be devastated that she no longer has social media, as she loves the attention. Her former BFF revealed, \"She just loved to be the center of attention. We used to imagine her receiving an Oscar. She used to practice announcing herself.\"\n\n10 They Have Only Known Each Other For 18 months\n\nabcnews.go.com\n\nWhen Harry popped the question he had only known Meghan for 18 months, but he was clearly in a rush to get her down the aisle.\n\nThings didn't go so well in the beginning as Harry issued a statement to the press asking for the \"abuse and harassment\" of his girlfriend to end.\n\nThen on November 27th last year, Clarence House and Kensington Palace both announced that Harry and Meghan were engaged, but was it all happening too fast?\n\nThe couple hasn't spent that much time together as they have both been busy, Harry in the UK and Meghan in the USA. According to many studies, those who waited for three years before getting married had decreased the likelihood of divorce by 50%. Rushing into things might spell doom for the couple before they even know it.\n\n9 Meghan's Half-Sister's Book Could Destroy Everything\n\nusmagazine.com\n\nOne thing the Royal family won't be looking forward to is the release of Meghan's half-sister's tell-all book. Samantha Grant who lives in Florida claims she raised Meghan herself as the two were growing up.\n\nShe also revealed that her half-sister is a \"social climber\" and has always had a \"soft spot for gingers\".\n\nThe current working title for the book is 'The Diary of Princess Pushy’s Sister' so it's pretty clear what kind of book this going to be.\n\nShe also revealed that their father is bankrupt, but Meghan hasn't reached out to help. When Meghan wore a $75,000 designer dress for her engagement photo, her sister said, \"If you can spend $75,000 on a dress, you can spend $75,000 on your dad.\" He filed for bankruptcy last year with just $200 to his name.\n\n8 Meghan Won't Be Able To Cope With The Terrifying Publicity\n\nvia: Pinterest.com\n\n20 years ago, Harry's late mother Princess Diana was chased by the paparazzi and crashed in a Paris tunnel, which resulted in her death. The cameras were still flashing even as they struggled to pull her body from the wreck. Now, you would think the media learned from the incident and they would be less intrusive, but it appears they have just become worse.\n\nLast year, she was the most searched woman on Google and her name dominates the headlines almost every day.\n\nTop bodyguard Garry Curtis who once looked after the Beckham family told the Mirror online, \"I can only imagine that at the start she will find it extremely claustrophobic. Any family that has financial wealth around them is going to be a potential target of intimidation, possible kidnap, these days computer theft and hacking and people looking for family photos for blackmail.\" Sounds terrifying to us.\n\n7 Meghan's Ex-Husband Is Making A Comedy About Their Divorce\n\nradaronline.com\n\nAnother person who was once close to Meghan and also wants to sell her out is the ex-husband, Trevor Engelson, who was married to the Suits star from 2011 to 2013.\n\nNow it's been revealed that he plans to make a tell-all comedy about their divorce and the pilot has been ordered by Fox network.\n\nThe show is about a divorced dad who has to work with his ex-wife to share custody of their kids, according to Deadline. The situation is complicated as the woman moves on from the split by marrying a British prince and although they never had children together, it's going to be quite obviously about Meghan and Harry.\n\nSo far, Modern Family's executive producer Danny Zuker has joined the project as producer and writer. It's yet another embarrassing blow for the Royals who will already see Meghan's divorce as a setback.\n\n6 The Queen Will Refuse To Attend The Big Day\n\nvanityfair.com\n\nIt's very likely that the Queen will snub the Royal wedding even though she would be a crucial and celebrated guest. According to speculation, the Queen won't witness the nuptials first-hand because Meghan has been married before. In 2005, her majesty didn't attend the wedding of Prince Charles and Camilla for the exact same reason - choosing to skip her son's big day.\n\nA senior Royal official told the Daily Express, \"The Queen takes her position as Supreme Governor of the Church of England incredibly seriously. She also has great personal faith.\"\n\nHer former best friend told the Daily Mail that Meghan's husband did not see the divorce coming, she revealed, \"I think everybody who knew them both was in shock. All I can say now is that I think Meghan was calculated, very calculated, in the way she handled people and relationships.\"\n\n5 She Has Already Failed A Mock British Citizenship Test\n\nmirror.co.uk\n\nMaybe British history isn't Meghan's strong point, but if she wants to make a permanent move to the UK then she'll have to brush up for the citizenship test.\n\nShe sat down with comedy channel Dave who quizzed her on all things British but she failed to name local ales or where places were.\n\nIt's believed that she will leave her Toronto apartment behind and relocate to London with Harry and her dogs at Kensington Palace. They will then become the next-door neighbors of Prince William and Kate.\n\nShe told the host, \"Because I'm from the States, you don't grow up with the same understanding of the Royal family. While I now understand very clearly there's a global interest there, I didn't know much about (Prince Harry).\"\n\n4 Meghan Has Too Many Skeletons In Her Closet\n\nvia: YouTube.com\n\nMeghan's family history comes with quite a dark past; her half-brother, Tom, has spent a few nights in a jail cell following boozy fights and he also pointed a gun at her sister-in-law's head. One source told The Sun, \"He’s a loose cannon. It puts Meghan’s family in a bad light again. The last time he said he would get help. Everyone hopes they both do so now.\"\n\nMeghan's father also has his own demons as he is struggling with bankruptcy.\n\nMeghan's half-sister said Harry would be \"appalled by what she's done\" and that Meghan was a \"narcissist\" and \"selfish\".\n\nShe told the Daily Mail, \"The Royal Family would be appalled by what she's done to her own family. The truth would kill her relationship with Prince Harry, he wouldn't want to date her anymore because it puts her in a bad public light.\" We're sure her pending tell-all book will go into much more detail...\n\n3 The Big Day Is Too Much Of A Clash With The Next Royal Baby\n\nvia: YouTube.com\n\nThe big day might have to be put on hold, as it's too much of a clash with the next Royal baby. William and Kate are expecting their third child, who will be fifth in line to the throne. The newborn is expected early April, however, if things become overdue it will clash with the Royal wedding.\n\nWilliam is expected to be the best man on the big day, so this could put the brakes on the occasion.\n\nThe website Mumsnet was flooded with complaints by angry parents about the clash in dates. One wrote, \"It'll be a dilemma for William as he'll want to celebrate the day, as will Catherine. If she's heavily pregnant or postpartum, he can't really get overly drunk.\" If things are going to get complicated, the couple might be better off calling the whole thing off.\n\n2 Meghan Is Still Breaking Protocol By Talking To The Press\n\nvia: YouTube.com\n\nAfter Harry and Meghan first announced their engagement, they both made a public outing in London to greet the crowds of well-wishers. Harry, walking ahead of Meghan, was shaking hands with the public and taking gifts, but when ITV’s Alison Hammond tried to talk to him, he quickly swerved her microphone. Something Harry isn't keen to do is talk to the press. However, the same couldn't be said for Meghan who walked right up to the reporter for a chat.\n\nMeghan's Vanity Fair interview, where she discussed in detail about her relationship with the Prince, would have ruffled a few feathers at the palace.\n\nShe landed the cover and the title screamed, \"She just mad about Harry!\" It's this kind of 'vulgar Hollywood' publicity the Royals have tried to keep away from for many decades.\n\n1 Even Psychics Say It's Doomed\n\nAOL.com\n\nUnfortunately for this couple, it's written in the stars that it just wasn't meant to be. Psychic Kerrie Erwin appeared on Australian morning show Sunrise and claimed the couple would 'struggle' with marriage. She revealed, \"I do get (feelings of) a pregnancy for her next year.\"\n\n\"But actually, I don't think it's going to last. I'd probably give it five years. I feel there is a lot of personal things going on between them because they're two very strong individuals.\"\n\nShe added, \"Which is a sad thing. I wish them all the best. But it doesn't look good.\" The pair hasn't spent that much time together since they first started dating 18 months ago, so even they must not truly know how things will go. We'll just have to wait and see, but if the history of the Royal family is anything to by, this could be another rocky relationship.\n\nSources: dailymail.co.uk, thesun.co.uk, mirror.co.uk", "images": ["http://www.thetalko.com/public/build/images/re-logo-full-white.04d384d8.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/01/BeFunky-Collage97-copy-1.jpg", "http://www.thetalko.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://www.facebook.com/tr?id=1803658626514362&ev=PageView&noscript=1", "http://www.thetalko.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "http://www.thetalko.com/public/build/images/tv-logo-full-white.642d3d01.svg"], "top_img": "https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/01/BeFunky-Collage97-copy-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.thetalko.com/trouble-in-paradise-15-reasons-prince-harry-and-meghan-markle-wont-make-it-down-the-aisle/", "title": "Trouble In Paradise: 15 Reasons Prince Harry And Meghan Markle Won’t Make It Down The Aisle", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Although the couple appeared to be happy, as time has gone by there have been a few scandals and complications.", "og": {"title": "Trouble In Paradise: 15 Reasons Prince Harry And Meghan Markle Won’t Make It Down The Aisle", "type": "article", "image": {"identifier": "https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/01/BeFunky-Collage97-copy-1.jpg", "width": 1200, "height": 628}, "url": "https://www.thetalko.com/trouble-in-paradise-15-reasons-prince-harry-and-meghan-markle-wont-make-it-down-the-aisle/", "locale": "en_US", "description": "Although the couple appeared to be happy, as time has gone by there have been a few scandals and complications.", "site_name": "TheTalko"}, "article": {"published_time": "2018-01-26T18:01:54Z", "section": "Entertainment"}, "fb": {"app_id": 1470061169975403}}, "movies": [], "publish_date": 1516989714.0, "source": "http://www.thetalko.com", "summary": ""}