{"url": "www.wmagazine.com/story/kim-and-kanye-are-taking-the-rest-of-2016-off-as-we-all-wish-we-could", "text": "Come December, it's become near tradition over the past few years for everyone to complain about how the previous 12 months have been the worst ever. This year, however really, really feels like it. This year has been a barrage of bizarre and bummer headlines that at times it's felt like some dystopian nightmare.\n\nIt's been so bad that the Kardashian-West clan have just decided to end 2016 early. Yes, Kim and Kanye have decided to cancel all public and professional commitments for the end of the year and plan to maintain their social media blackouts as well. To be exact, a flack told Page Six that Kim and Kanye “plan on taking the rest of 2016 off and spending time as a family.\"\n\nWhich, frankly, we wish we all could do, don't we?\n\nIs it possible for President Obama's last major act to be an executive decree for us to just all get a chance to chill out and recuperate for the remaining 26 days left in this bummer of a year? Sure, there's no political safeguarding against any potential additional music legends from dying or preventing any further tragedies and disasters from happening or ensuring that some new odd Zika-like disease pops up, but there's got to be something? How about the \"Netflix and Chill Act?\" Just an order that all Americans get to spend the next month relaxing and catching up on any television series they may have missed this year.\n\nOf course, when it comes to Kim and Kanye it's understandable that they've decided to literally cancel the rest of their 2016. Kim was still in the midst of recuperating from being robbed at gunpoint in Paris when her husband Kanye was hospitalized following a very public breakdown.\n\nThey've had to endure these private tragedies while also dealing with immense public interest and rumors running rampant in the tabloid press.\n\nE!, the home of the Kardashian's reality TV empire, reports that a family source says \"Kim is doing okay despite reports.\"\n\n\"She has many things on her plate so being overwhelmed is expected,\" the source continued. \"She wants to get Kanye back on his feet. She is not leaving him. She loves him.\"\n\nKanye was released from an L.A.-area hospital last week after spending more than a week receiving treatment for exhaustion. Kim West was reportedly by his side throughout the entire ordeal and now wants to make sure Kanye continues to receive therapy and treatment now that he's out of the hospital.\n\nDespite your personal opinion on the pair, it certainly does seem like the family deserves the rest. In addition to their dual ordeal, they also have two young children to care for after all (in fact, today is Saint West's first birthday). Maybe it's best we all let them lay low and chill for the next month or so.\n\nUnfortunately, we all don't have the luxury as much as we wish we could. Then again, it's not looking like 2017 is shaping up to be any better. Hopefully, a rested and healthier Kim and Kanye can get back into form and provide us with the not-quite-as-tragic-as-this distractions we'll probably desperately need in the new year.\n\nUpdate: Kanye, for one, has now reappeared in public, albeit in a very low-key way. He was spotted with newly blond hair at designer Rick Owens' furniture show in Los Angeles .", "images": ["https://vulcan.condenastdigital.com/wmag-services/photos/591a0f0e2006e2187de4708f/1:1/w_128,c_limit/Scarlett%20Johanson.jpg", "https://media.wmagazine.com/photos/57ee926c3bee91855cce1376/2:1/w_790,c_limit/GettyImages-611454304_master.jpg", "https://vulcan.condenastdigital.com/teenvogue-services/photos/591b21e645a06456b6861769/1:1/w_128,c_limit/Angelina%20Jolie.jpg", "https://media.wmagazine.com/photos/57ee926c3bee91855cce1376/4:3/w_1536/GettyImages-611454304_master.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/591a0f0ebf330e0e94ab3980/1:1/w_128,c_limit/Selena%20Gomez.jpg", "http://www.wmagazine.com/images/w_logo.svg"], "top_img": "https://media.wmagazine.com/photos/57ee926c3bee91855cce1376/2:1/w_790,c_limit/GettyImages-611454304_master.jpg", "keywords": [], "authors": ["Kyle Munzenrieder", "Getty Images"], "canonical_link": "https://www.wmagazine.com/story/kim-and-kanye-are-taking-the-rest-of-2016-off-as-we-all-wish-we-could", "title": "Kim and Kanye Are Taking The Rest of 2016 Off, As We All Wish We Could", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "theme-color": "#ffffff", "author": "Kyle Munzenrieder", "copyright": "Copyright (c) Condé Nast 2019", "description": "Kim and Kanye are done with 2016 as much as you are. The power couple has cancelled all public and professional plans and are just laying low until 2017.", "publishDate": "2016-12-05T19:56:03Z", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "Kim and Kanye Are Taking The Rest of 2016 Off, As We All Wish We Could", "url": "https://www.wmagazine.com/story/kim-and-kanye-are-taking-the-rest-of-2016-off-as-we-all-wish-we-could", "description": "Kim and Kanye are done with 2016 as much as you are. The power couple has cancelled all public and professional plans and are just laying low until 2017.", "type": "article", "image": "https://media.wmagazine.com/photos/57ee926c3bee91855cce1376/2:1/w_790,c_limit/GettyImages-611454304_master.jpg"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "Kim and Kanye Are Taking The Rest of 2016 Off, As We All Wish We Could", "description": "Kim and Kanye are done with 2016 as much as you are. The power couple has cancelled all public and professional plans and are just laying low until 2017.", "image": "https://media.wmagazine.com/photos/57ee926c3bee91855cce1376/2:1/w_790,c_limit/GettyImages-611454304_master.jpg?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1480967763.0, "source": "http://www.wmagazine.com", "summary": ""}