{"url": "medium.com/@arjunogale/kanye-west-indefinitely-canceled-8293412b5252", "text": "In the past, Kanye’s capriciousness has been repeatedly forgiven and, at times, belatedly rewarded with accolades. It is hard to imagine a My Beautiful Dark Twisted Fantasy — one of the greatest rap albums of all time — without an “Imma let you finish” at the 2009 VMAs.\n\nHis new album, ye, doesn’t merit any similar mercy.\n\nOn first listen, it doesn’t sound like any part of ye was recorded pre-MAGA hat picture, which blows a Kanye-head sized hole through the argument that the previous month’s behavior was a publicity stunt to promote the album. If anything, the album seems like an meek afterthought to the Twitter tirade and dive into right-wing politics. Most of it deals with the repercussions of the storm which came before it, and for the first time in his career, the artist’s personality is overwhelming the art.\n\nThe opening track ‘I Thought About Killing You’, if played in a vacuum, sounds like the work of a troubled mind. If a poem like this came from a loved one, it would surely merit discussion about a trip to the therapist. Kanye goes on to deliver cringe-worthy rhymes on issues ranging from Russell Simmons rape allegations to his petrification on realizing that his daughter might one day look like his wife. He teases a few tidbits of The Old Kanye, chopping up beats from Slick Rick and The Edwin Hawkins Singers samples on ‘No Mistakes’, to keep his fans just interested enough. It’s telling that the one standout track, ‘Ghost Town’ is the track on which Kanye lurks in the background, devoting more time on production than on spoken word, and letting John Legend and Kid Cudi take over.\n\nIf one were to ignore everything that came before ye, it would still feel like Kanye didn’t even try this time. The usual meticulousness and perfectionism has apparently been supplanted by a Kanye shrug. The music is haphazard and hollow, mirroring the guy making it. Maybe he’s become blasé and doesn’t want to spend time on music anymore. He did say he wanted to run for President in 2020 (or 2024?) anyway.", "images": ["https://miro.medium.com/fit/c/160/160/1*EJWWqLFxO3qHFirmTpOrfA.jpeg", "https://miro.medium.com/max/60/1*MaFrQXaHuL6cNCBL5V9eUQ.png?q=20", "https://miro.medium.com/max/640/1*MaFrQXaHuL6cNCBL5V9eUQ.png", "https://miro.medium.com/max/1280/1*MaFrQXaHuL6cNCBL5V9eUQ.png", "https://miro.medium.com/fit/c/96/96/1*EJWWqLFxO3qHFirmTpOrfA.jpeg"], "top_img": "https://miro.medium.com/max/640/1*MaFrQXaHuL6cNCBL5V9eUQ.png", "keywords": [], "authors": ["Arjun Ogale"], "canonical_link": "https://medium.com/@arjunogale/kanye-west-indefinitely-canceled-8293412b5252", "title": "Kanye West, Indefinitely Canceled", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#000000", "twitter": {"app": {"name": {"iphone": "Medium"}, "id": {"iphone": 828256236}, "url": {"iphone": "medium://p/8293412b5252"}}, "title": "Kanye West, Indefinitely Canceled", "site": "@Medium", "description": "The first time I listened to a Kanye West album was in 2013, during my freshman year of college. While the cover of his book — interrupting…", "image": {"src": "https://miro.medium.com/max/640/1*MaFrQXaHuL6cNCBL5V9eUQ.png"}, "card": "summary_large_image", "label1": "Reading time", "data1": "5 min read"}, "al": {"ios": {"app_name": "Medium", "app_store_id": 828256236, "url": "medium://p/8293412b5252"}, "android": {"package": "com.medium.reader", "url": "medium://p/8293412b5252", "app_name": "Medium"}, "web": {"url": "https://medium.com/@arjunogale/kanye-west-indefinitely-canceled-8293412b5252"}}, "fb": {"app_id": 542599432471018}, "og": {"site_name": "Medium", "type": "article", "title": "Kanye West, Indefinitely Canceled", "description": "The first time I listened to a Kanye West album was in 2013, during my freshman year of college. While the cover of his book — interrupting…", "url": "https://medium.com/@arjunogale/kanye-west-indefinitely-canceled-8293412b5252", "image": "https://miro.medium.com/max/640/1*MaFrQXaHuL6cNCBL5V9eUQ.png"}, "article": {"published_time": "2018-06-05T16:00:42.776Z", "author": "https://medium.com/@arjunogale"}, "title": "Kanye West, Indefinitely Canceled - Arjun Ogale - Medium", "description": "The first time I listened to a Kanye West album was in 2013, during my freshman year of college. While the cover of his book — interrupting Taylor Swift at the VMAs, labeling George W. Bush a…", "author": "Arjun Ogale", "robots": "index,follow", "referrer": "unsafe-url", "parsely-post-id": "8293412b5252"}, "movies": [], "publish_date": 1528214442.776, "source": "http://medium.com", "summary": ""}