{"url": "www.theodysseyonline.com/15-saddest-taylor-swift-breakup-songs", "text": "Taylor Swift is the queen of breakup songs. And songwriting in general, but especially breakup songs. Narrowing them down to the top 15 was difficult, but I think I've got them chosen from the least to the most heartbreaking.\n\n1. Forever And Always\n\nI feel this deserved to be mentioned since it's one of her most well known songs. Who could ever forget the song she wrong about Joe Jonas breaking up with her on the phone?\n\nMy favorite line: \"So here's to everything, coming down to nothing. Here's to silence that cuts me to the core.\"\n\n2. Haunted\n\nThis song is haunting, as the title suggests. The music in the background, her lyrics all add up to a breathtaking song.\n\nMy favorite line: \"He will try to take away my pain, and he just might make me smile but the whole time I'm wishing he was you instead.\"\n\n3. I Almost Do\n\nThis song is one of her saddest, but not because it's so heartbreaking as it is reminiscent of a past relationship. I think what's so upsetting about this song is that it's about a relationship that could possibly work again, but she's too afraid to get hurt.\n\nMy favorite line: \"I confess, baby, that in my dreams you're touching my face and asking me if I wanna try again with you, and I almost do.\"\n\n4. Wildest Dreams\n\nThis song isn't about a breakup per se as it is about a relationship that is going to reach its inevitable end. It's haunting and beautiful nonetheless.\n\nMy favorite line: \"Someday when you leave me, I bet these memories follow you around.\"\n\n5. You're Not Sorry\n\nWhile I've always been a huge Taylor Swift fan, I first heard this song when she guest starred on CSI and I've loved it ever since.\n\nMy favorite line: \"Coulda loved you all my life if you hadn't left me waiting in the cold, and you've got your share of secrets and I'm tired of being last to know.\"\n\nSubscribe to our\n\nNewsletter Thank you for signing up! Check your inbox for the latest from Odyssey. This is not a valid email, please try again.\n\n6. Breathe\n\nThis is one of her more underrated songs, I think. This song was composed with Colbie Calliat and it's a masterpiece.\n\nMy favorite line: \"People are people and sometimes we change our mind, but it's killing me to see you go after all this time.\"\n\n7. Sad Beautiful Tragic\n\nAnother underrated song from her Red album. It's very sad, very somber, and very emotional.\n\nMy favorite line: \"Time is taking its sweet time erasing you.\"\n\n8. White Horse\n\nAnother Taylor Swift classic and one that's sure to hit you right in the feels. This one is sure to help anyone through a breakup, as it begins sad and heartbroken and ends with her realizing that she deserves to be treated better.\n\nMy favorite line: \"I'm not your princess, this ain't a fairy-tale, I'm gonna find someone someday who might actually treat me well.\"\n\n9. Come In With the Rain\n\nUnderrated and one of my favorite. This track appears on her Fearless Platinum Edition and if she ever performed this live I would certainly die. In this song, she's tired of fighting for a broken relationship and instead is waiting on the love interest to make his move.\n\n\n\nMy favorite line: \"I've got you down, I know you by heart, but you don't even know where I start.\"\n\n10. The Last Time\n\n\n\nTaylor performs this song on her Red tour with Gary Lightbody from the band Snow Patrol. This is a song anyone who has been in a back and forth relationship can understand. Taylor battles with letting in the guy who continues to hurt her and he battles with never staying yet desperately loving her.\n\nMy favorite line: \"You wear your best apology, but I was there to watch you leave.\"\n\n11. Cold As You\n\nThis will always be one of my favorites by Taylor. There aren't many words I can use to describe this song except the fact that, while I am not much of a crier, this one gets to me. Always.\n\nMy favorite song: \"You put up walls and paint them all a shade of gray, and I stood there loving you and wished them all away. And you come away with a great little story of a mess of a dreamer with the nerve to adore you.\"\n\n12. If This Was A Movie\n\nThis comes from the deluxe edition of her Speak Now album. I find that many of her bonus track songs are some of her best and underrated, and this is no exception. This is a song where Taylor compares her love life and what would happen if life was indeed a movie, to the harsh reality of the life we are dealt and how relationships don't always work.\n\nMy favorite line: \"I know people change and these things happen but I remember how it was back then, wrapped up in your arms and our friends were laughin', cause nothing like this ever happened to them.\"\n\n13. Dear John\n\nAh, the song Taylor so blatantly wrote about her ex John Mayer. This is a song where Taylor calls John out for the terrible way he treated her she recognizes that she maybe should have listened to everyone who told her he was a bad idea. But hindsight is 20/20 and when you're in love it's hard to see past how in love with them you are, even if they are bad for you.\n\nMy favorite song: \"Well maybe it's me and my blind optimism to blame, or maybe it's you and your sick need to give love then take it away,\" or \"You are an expert at 'sorry' and keeping lines blurry, never impressed by me acing your tests.\"\n\n14. Last Kiss\n\nIf you've heard this song, it needs no explanation. And if you haven't heard this song, go listen to it. Now.\n\nMy favorite line: \"I hope the sun shines and it's a beautiful day and something reminds you you wish you had stayed. You can plan for a change in the weather and time, but I never planned on you changing your mind.\"\n\n15. All Too Well\n\nMy favorite Taylor Swift song ever happens to be her saddest, in my opinion. This song paints a vivid picture of the wonderful beginning of a relationship all the way to the bitter end, when you're left alone with the memories and the heartbreak.\n\nMy favorite line: \"Maybe we got lost in translation, maybe I asked for too much, but maybe this thing was a masterpiece 'til you tore it all up,\" or \"You call me up again just to break me like a promise, so casually cruel in the name of being honest.\"", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=20869612&cv=2.0&cj=1", "https://odysseyonline-img.rbl.ms/simage/https%3A%2F%2Faz616578.vo.msecnd.net%2Ffiles%2F2017%2F01%2F20%2F636205426471842487787097927_ts.jpg/2000%2C2000/QU%2BZEmxSl82eJyYN/img.jpg"], "top_img": "https://odysseyonline-img.rbl.ms/simage/https%3A%2F%2Faz616578.vo.msecnd.net%2Ffiles%2F2017%2F01%2F20%2F636205426471842487787097927_ts.jpg/2000%2C2000/QU%2BZEmxSl82eJyYN/img.jpg", "keywords": [], "authors": ["Madeline Smith", "Sara Khong", "Xzana Parson", "Byron Kittle", "Megan Carmen", "Mickayla Sowder", "Sara Petty", "Lauryn Heppe", "Donasia Harry", "Jessica Reider"], "canonical_link": "https://www.theodysseyonline.com/15-saddest-taylor-swift-breakup-songs", "title": "The 15 Saddest Taylor Swift Breakup Songs", "meta_data": {"apple-mobile-web-app-title": "Odyssey", "application-name": "Odyssey", "msapplication-TileColor": "#eb8e4e", "msapplication-TileImage": "https://static.rbl.ms/static/img/whitelabel/odysseyonline/favicons/mstile-144x144.png?1", "theme-color": "#647187", "twitter": {"card": "summary_large_image", "site": {"identifier": "@twitter", "id": 341251022}, "image": "https://az616578.vo.msecnd.net/files/2017/01/20/636205426471842487787097927_ts.jpg"}, "fb": {"app_id": 402984699895135, "pages": 208750362478342}, "og": {"type": "article", "url": "https://www.theodysseyonline.com/15-saddest-taylor-swift-breakup-songs", "site_name": "The Odyssey Online", "image": {"identifier": "https://odysseyonline-img.rbl.ms/simage/https%3A%2F%2Faz616578.vo.msecnd.net%2Ffiles%2F2017%2F01%2F20%2F636205426471842487787097927_ts.jpg/2000%2C2000/QU%2BZEmxSl82eJyYN/img.jpg", "width": 2000, "height": 2000}, "description": "She's the queen of heartbreak.", "title": "The 15 Saddest Taylor Swift Breakup Songs"}, "article": {"publisher": 208750362478342, "published_time": "2017-01-24T00:07:19+00:00", "modified_time": "2019-10-16T23:04:25+00:00", "author": "https://www.facebook.com/208750362478342"}, "referrer": "always", "description": "She's the queen of heartbreak.", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "ir-site-verification-token": "-237958390", "google-site-verification": "ZYYz_eVjBcSpiEJtMePqpsn3V_ndAOj4r-aFAlL3jS8"}, "movies": [], "publish_date": 1485216439.0, "source": "http://www.theodysseyonline.com", "summary": ""}