{"url": "https://www.modbee.com/news/local/crime/scott-peterson-case/article173093346.html", "text": "Time was when everyone in the United States, it seemed, wondered what happened to Laci Peterson, Modesto most famous mother-to-be.\n\nThe story exploded when her husband’s mistress came forward in early 2003, and again when Laci’s body and that of her unborn son were recovered on the shore of San Francisco Bay. Intrigue reached fever pitch when Scott Peterson was arrested for double-murder and sent to death row after a long, captivating trial in 2004 that spawned made-for-TV movies, books and countless headlines and hours of cable commentary.\n\nThe ruckus then died down for several years, allowing Modesto time to heal out of the national limelight.\n\nUntil now.\n\nSubscribe and Save Act now to get a full year of unlimited digital access – just $49.99! VIEW OFFER\n\n“Truth and Lies: The Murder of Laci Peterson,” airing Thursday on ABC, is just the latest in a string of television specials about the compelling case — the sixth this year, with two more scheduled in the fall. A&E Network’s “The Murder of Laci Peterson“ will air the finale to its seven-hour series on Tuesday.\n\n“Everyone’s jumping on the crime bandwagon,” said Beth Karas, who covered the Peterson trial for Court TV and now provides legal analysis in podcasts she produces..\n\nWhy the renewed interest?\n\nSome commentators note that Scott Peterson’s appeals, several years in the making, are nearing resolution. The California Supreme Court could schedule hearings in coming months, and could decide in a year or so whether he deserves a new trial.\n\nOther observers say the resurgence might be timed to roughly coincide with the coming 15-year anniversary of Laci Peterson’s disappearance, on Christmas Eve 2002.\n\nStill others credit — or blame — fierce competition among TV channels, ever hungry for viewers. And the Peterson saga, with elements of infidelity, deadly violence, innocent victims and enduring mystery, still has it all no matter how much time goes by.\n\n“When one (outlet) finds there is an interest, it leads to others piggybacking on the same idea,” mused Dr. Robi Ludwig, a psychotherapist and TV analyst..\n\nOther recent productions include a “Primetime Justice” segment on HLN in August, a “Snapped” episode on Oxygen in May, “Dateline NBC” in April and “The Dr. Oz Show” in February. Look for more Peterson shows in the fall, from Investigation Discovery and from HLN, which is preparing an episode in its “How It Really Happened” docuseries.\n\nSome shows, like “Dateline,” seem geared to confirm Scott Peterson’s guilt, and rely heavily on participation from the prosecution team and Laci’s family. Her mother, Sharon Rocha, cooperated with ABC for the show premiering Thursday.\n\n“I remember running around in the park and yelling her name, and there’s nothing worse than lifting up a trash can looking for your child, to see if her body is in a trash can,” Rocha said, according to an ABC release. “When it’s happening to somebody else, you think, ‘That’s a horrible thing to happen to those people.’ And you think that you can imagine how they feel. You don’t. You have no idea what it’s like.”\n\nOther shows, such as A&E’s and Oxygen’s, are asking the same question raised at the beginning of this article: What happened to Laci? They examine alternate theories for her demise, with cooperation from Scott Peterson’s family and his celebrity attorney, Los Angeles’ Mark Geragos.\n\nSome people connected to the case appear in several shows regardless of point of view, such as juror Mike Belmessieri.\n\n“By now, if people don’t get it, why should I waste my time?” he said, explaining why he’s finally turning down interview requests. “I try to make a point, and it’s this: He’s guilty. He is. There is no question in my mind.”\n\nStacey Boyers-Birdsong, a friend of Laci’s, said, “All of a sudden we’re getting flooded with phone calls and requests (for interviews). After a while, what more is there to say? They know the story, and they ask the same questions. But if it’s going to help Laci and Conner find justice, I have no problem talking. We’ll fight to keep (Scott) where he is.”\n\nLast weekend was emotion-packed for Boyers-Birdsong and other loved ones of Laci. Several participated in the newly revived Laci & Conner Memorial Ride for motorcyclists and other drivers on Saturday, then headed to the foothills on Sunday for an event raising awareness of people missing from Tuolumne County. Rocha, who founded a search and rescue fund to honor her daughter and grandson, attended last year; this year brought the likes of Marcia Clark, the famed prosecutor of O.J. Simpson, and Modesto’s Susan Levy, mother of Chandra Levy, who was romantically linked to former Congressman Gary Condit and was murdered in Washington, D.C.\n\nTLC revisited the Levy case with a three-hour special just last week.\n\n“True crime is definitely experiencing something of a renaissance right now,” said Jean Murley, author of “The Rise of True Crime: 20th Century Murder and American Popular Culture.” The genre lately has expanded to include low-profile but still interesting cases as people show more interest in the criminal justice system, she said.\n\nMurley and Karas noted the success of Netflix’s “Making a Murderer,” a 10-episode series which raised considerable doubt about whether Wisconsin’s Steven Avery and his nephew were wrongly convicted for the murder of a woman.. Both also pointed to “Serial,” an acclaimed investigative journalism podcast.\n\n“It’s hard for people to conceptualize somebody who is so good-looking, to think he’s capable of a heinous crime. People grapple with that, and it contributes to increased curiosity,” said Ludwig, who wrote “’Till Death Do Us Part: Love, Marriage, and the Mind of the Killer Spouse.”\n\n“If you accept that Scott Peterson is a heinous killer, a normal guy who decided to kill his wife and unborn child, then maybe you have to consider that the people in our lives may not be so normal either,” she said.\n\nIt may be counterintuitive, but people are drawn to things that frighten them, said Catherine Pelonero, whose books focus on notorious crimes in New York.\n\n“Most of us can relate to becoming very angry, but we wouldn’t take that step of actually killing someone,” she said. “So there is a natural fascination with those who do, with what it takes to push someone that far. It’s really very primal in all of us.”\n\nGarth Stapley: 209-578-2390", "images": ["https://googleads.g.doubleclick.net/pagead/viewthroughconversion/968074018/?value=0&guid=ON&script=0", "https://www.modbee.com/latest-news/9oah1u/picture171894972/alternates/LANDSCAPE_480/lacimemorial", "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/55ae56cf-1ae7-4e2b-b5b8-9551a4192b2f/c23f1335-ad27-4f33-91f2-400a57459db0/1280x720/match/image.jpg", "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/55469675-f9fc-4ef5-9836-af28c991f039/8835c294-f734-4995-822c-bcbda797be34/1280x720/match/image.jpg", "https://www.modbee.com/wps/build/images/modbee/logo.svg", "https://www.modbee.com/wps/build/images/modbee/apple-touch-icon-57-precomposed.png", "https://cf-images.us-east-1.prod.boltdns.net/v1/jit/5502557044001/c1a23bd1-d5a4-40a5-8676-3d0356284b93/main/1280x720/50s944ms/match/image.jpg", "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/dc35bbfd-7c01-4db1-8948-b51d127b8766/6545aa03-782f-4b57-ad12-5476ffc38c2b/1280x720/match/image.jpg", "https://www.modbee.com/wps/build/images/mcclatchydc/logo-impact.svg", "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/d74c5bd3-f80e-4251-bb8d-a6b5c7954274/b7f75b09-398e-4a0b-8dba-5c36093c29ef/1280x720/match/image.jpg", "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/6bf9ec41-5a26-42fe-879a-a44c84e1407d/8c8bb755-9967-4214-83fb-34847a7fa957/1280x720/match/image.jpg"], "top_img": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/d74c5bd3-f80e-4251-bb8d-a6b5c7954274/b7f75b09-398e-4a0b-8dba-5c36093c29ef/1280x720/match/image.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.modbee.com/news/local/crime/scott-peterson-case/article173093346.html", "title": "Scott and Laci Peterson: The saga that TV won't let die | Modesto Bee", "meta_data": {"msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/wps/build/images/modbee/windowsmetro-144.png", "twitter": {"card": "summary_large_image", "site": "modbee", "title": "Scott and Laci Peterson: The saga that TV won't let die", "description": "Renewed interest in the story of Scott and Laci Peterson results in several television channels revisiting Modesto's most notorious double-murder, a 15-year-old case that captivated people across the United States and beyond.", "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/d74c5bd3-f80e-4251-bb8d-a6b5c7954274/b7f75b09-398e-4a0b-8dba-5c36093c29ef/1280x720/match/image.jpg"}, "og": {"site_name": "modbee", "type": "article", "title": "Scott and Laci Peterson: The saga that TV won't let die", "url": "https://www.modbee.com/news/local/crime/scott-peterson-case/article173093346.html", "description": "Renewed interest in the story of Scott and Laci Peterson results in several television channels revisiting Modesto's most notorious double-murder, a 15-year-old case that captivated people across the United States and beyond.", "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5502557044001/d74c5bd3-f80e-4251-bb8d-a6b5c7954274/b7f75b09-398e-4a0b-8dba-5c36093c29ef/1280x720/match/image.jpg"}, "fb": {"app_id": 174393476082180, "pages": 8552722321}, "title": "Scott and Laci Peterson: The saga that TV won't let die | Modesto Bee", "allow-comments": "true", "description": "Renewed interest in the story of Scott and Laci Peterson results in several television channels revisiting Modesto's most notorious double-murder, a 15-year-old case that captivated people across the United States and beyond.", "keywords": "peterson, laci, scott, murder, modesto, tv, television, amber frey, sharon rocha", "news_keywords": "peterson, laci, scott, murder, modesto, tv, television, amber frey, sharon rocha", "googlebot": "noodp, noarchive", "viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "Y9AUrQRc1wvpJQpl6N75KZhTcCcJMYIWF_-VA5Xhv74", "apple-itunes-app": "app-id=511925305, affiliate-data=at=1010lHsN&ct=SmartAppBannerMOD, app-argument=https://www.modbee.com/news/local/crime/scott-peterson-case/article173093346.html?appNav=smartBanner", "article": {"opinion": "false"}, "parsely-metadata": "{\"article_id\": \"173093346\"}"}, "movies": [], "publish_date": null, "source": "https://www.modbee.com", "summary": ""}