{"url": "people.com/tv/ryan-phillippe-sues-ex-after-she-claimed-he-beat-her/", "text": "Image zoom Ryan Phillippe and Elsie Hewitt Rachel Murray/Getty; Elsie Hewitt/Instagram\n\nRyan Phillippe is suing his former girlfriend Elsie Hewitt after she alleged that the actor had brutally beaten her this summer.\n\nThe actor, 43, filed the documents on Nov. 17 as a response to Hewitt’s own lawsuit that claimed he had been abusive toward her.\n\nIn court documents obtained by PEOPLE, Phillippe’s lawsuit denies the allegations, claiming Hewitt “broke into Phillippe’s home in the middle of the night without permission” and “fabricated a story in an unjustified attempt to extort money” from him to help her modeling career.\n\nPEOPLE has reached out to both Phillippe’s and Hewitt’s attorneys.\n\nPhillippe alleges Hewitt, 21, made a false police report accusing him of injuring her in the early morning of July 4 when the alleged incident is said to have taken place. The actor also claims Hewitt was “extremely intoxicated.”\n\nHe further says in his suit that he “was raised by women in a household where women’s rights, feminism, and advocacy were very much at the forefront, and he is sickened to have been falsely accused of domestic violence.”\n\nto be clear: i have not had a “girlfriend” for over a year now & have barely dated anyone since. any other labels or mis- characterizations, from media or gossips, related to anyone, briefly, connected to my personal life, are false. happy thanksgiving. — dr. philz (@RyanPhillippe) November 23, 2017\n\nPhillippe tweeted on Wednesday after the news of his lawsuit broke, writing, “to be clear: i have not had a “girlfriend” for over a year now & have barely dated anyone since. any other labels or mis- characterizations, from media or gossips, related to anyone, briefly, connected to my personal life, are false.”\n\nHe continued, “happy thanksgiving.”\n\nAuthorities closed the criminal investigation regarding domestic violence against the actor in September. Hewitt filed a civil lawsuit in September against him for allegedly kicking, punching and throwing her down the stairs after an argument.\n\nIn court documents obtained by PEOPLE, Hewitt claimed that on July 3, Phillippe — who shares two children with ex-wife Reese Witherspoon and one with actress Alexis Knapp — left a party after “being ignored [by Hewitt].”\n\nHewitt alleges that she then went to Phillippe’s house with a friend to pack up her things in the early hours of July 4, and a physical altercation ensued.\n\nRELATED VIDEO: Ryan Phillippe’s Model Ex Files Lawsuit Accusing Him of Brutally Beating Her in Drunken Rage\n\nA spokesperson for the Los Angeles Police Department confirmed to PEOPLE that officers filed a report of the alleged attack and granted Hewitt an emergency protective order. The order expired July 12.\n\nIn court documents obtained by PEOPLE, Hewitt claims that she saw Phillippe — whom she had been dating since April but split from in July — “repeatedly abusing a panoply of legal and illegal drugs, including without limitation: cocaine, ecstasy, psychedelic mushrooms, and steroids … ”\n\nThe model alleges Phillippe “increasingly combined these drugs with excessive alcohol consumption and often exhibited symptoms attendant of poly drug and alcohol abuse, including mood swings and bouts of anger.”\n\nKeith Fink, Hewitt’s lawyer, previously slammed any suggestion that his client had filed the suit for fame and money, telling PEOPLE the model wants to take a stand against domestic violence.\n\nHewitt, who supplied a number of photographs of bruising and injuries she alleges she obtained from the altercation, was admitted to Cedars-Sinai Medical Center after the incident, where police issued the emergency protective order and filed a report.\n\nThe model claims she suffered chest wall pain, abrasions and severe bruising. She is asking for $1 million.", "images": ["https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/07/11375342_417123731803445_2077871559_n-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/09/ryan-phillippe-elsie-hewitt-sq.jpg?crop=0px%2C0px%2C900px%2C472.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/09/ryan-phillippe-elsie-hewitt-sq.jpg"], "top_img": "https://peopledotcom.files.wordpress.com/2017/09/ryan-phillippe-elsie-hewitt-sq.jpg?crop=0px%2C0px%2C900px%2C472.5px&resize=1200%2C630", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/tv/ryan-phillippe-sues-ex-after-she-claimed-he-beat-her/", "title": "Ryan Phillippe Sues Ex Elsie Hewitt After She Claimed He Brutally Beat Her in Drunken Rage", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "ryan phillippe, elsie hewitt, tv watch, movie celebrities, celebrities, models, courts & trials, ryan phillippe sues ex girlfriend over allegations he brutally beat her", "news_keywords": "ryan phillippe, elsie hewitt, tv watch, movie celebrities, celebrities, models, courts & trials, ryan phillippe sues ex girlfriend over allegations he brutally beat her", "description": "Ryan Phillippe responded to his ex-girlfriend's civil lawsuit against him", "og": {"title": "Ryan Phillippe Sues Ex Elsie Hewitt After She Claimed He Brutally Beat Her in Drunken Rage", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/ryan-phillippe-sues-ex-after-she-claimed-he-beat-her/", "description": "Ryan Phillippe responded to his ex-girlfriend's civil lawsuit against him", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/09/ryan-phillippe-elsie-hewitt-sq.jpg?crop=0px%2C0px%2C900px%2C472.5px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/tv/ryan-phillippe-sues-ex-after-she-claimed-he-beat-her/", "description": "Ryan Phillippe responded to his ex-girlfriend's civil lawsuit against him", "media": "https://peopledotcom.files.wordpress.com/2017/09/ryan-phillippe-elsie-hewitt-sq.jpg?crop=0px%2C0px%2C900px%2C472.5px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/ryan-phillippe-sues-ex-after-she-claimed-he-beat-her/", "title": "Ryan Phillippe Sues Ex Elsie Hewitt After She Claimed He Brutally Beat Her in Drunken Rage", "description": "Ryan Phillippe responded to his ex-girlfriend's civil lawsuit against him", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/09/ryan-phillippe-elsie-hewitt-sq.jpg?crop=0px%2C0px%2C900px%2C472.5px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}