{"url": "people.com/celebrity/jerry-lewis-dead-celebrity-reactions/", "text": "The world is reeling after news of Jerry Lewis’ death.\n\nStars like Josh Gad, Jim Carrey, Dane Cook and more have penned moving tributes to the late comedian just moments after news of Lewis’ death broke.\n\nCook remembered his fellow comedian in a series of tweets, calling Lewis his “mentor and friend.”\n\n“A visionary. A pioneer in all forms of entertainment. A charitable human. A father,” he wrote. Cook added: “He meant the world to me& I will forever cherish the time I got to spend with him & his family. At a dark time in my life he brought me joy.”\n\nAlways funny. Always helpful. Always honest. I will miss you Jerry Lewis. The world has lost a true innovator & icon. pic.twitter.com/mJzLbh0VFd — Dane Cook (@DaneCook) August 20, 2017\n\nActor Nicolas Cage, who starred with Lewis in the 2016 film, The Trust, feels the comedian’s death “marks the end of the golden age of entertainment,” he told PEOPLE in a statement. “He was my inspiration since I was five. His movies saved my childhood and his extraordinary charisma informed all my performances. I would always ask myself, ‘What would Jerry do?'”\n\nCage added that Lewis “is always on my mind. He was my friend and my neighbor. He was ‘The Total Filmmaker — writer, director, star, and I am deeply saddened that we can’t talk a little more.”\n\nLewis’ Nutty Professor costar Stella Stevens told PEOPLE she was deeply saddened to learn the news of his death.\n\n“Jerry was a comic genius, and every day on set I learned so much about filmmaking from him,” she said in a statement. “The Nutty Professor remains very close to my heart. Flights of angels, dear man. Love, your Miss Purdy.”\n\nJerry Lewis loomed large in my family. Many movies with my mom & he made home movies with Janet and Tony. He made me and many laugh. #rip pic.twitter.com/4LbEbc9FCT — Jamie Lee Curtis (@jamieleecurtis) August 20, 2017\n\nWe will miss Jerry so much. I can’t believe I got to meet him and spend time with him. pic.twitter.com/wpHtjuWwmp — Penn Jillette (@pennjillette) August 20, 2017\n\nRose Marie, a show business legend herself, shared a sweet photo of herself and Lewis — with the actor making a silly face.\n\n“Jerry Lewis was an angel to me. Loved him & will never forget what he did for me during one of the worst times in my life. RIP, Love Roe,” the 94-year-old tweeted.\n\nMeanwhile, Jim Carrey credited Lewis, writing, “I am because he was.”\n\n“That fool was no dummy,” he tweeted. “Jerry Lewis was an undeniable genius an unfathomable blessing, comedy’s absolute!”\n\nThat fool was no dummy. Jerry Lewis was an undeniable genius an unfathomable blessing, comedy's absolute! I am because he was! ;^D pic.twitter.com/3Zdq9xhXlE — Jim Carrey (@JimCarrey) August 20, 2017\n\nJerry Lewis has passed on. I sincerely hope his afterlife is a warm, peaceful… …haven. — Patton Oswalt (@pattonoswalt) August 20, 2017\n\nJerry Lewis was an angel to me. Loved him & will never forget what he did for me during one of the worst times in my life. RIP, Love Roe pic.twitter.com/0OoQV4yaae — Rose Marie-Official (@RoseMarie4Real) August 20, 2017\n\n#RIP #JerryLewis\n\nOne of the best meals I ever had was with you at your restaurant in Vegas\n\nThank you for your generosity and life of laughs — Michael Kelly (@michaeljkellyjr) August 20, 2017\n\nRIP Jerry Lewis. — Michael McKean (@MJMcKean) August 20, 2017\n\nLewis’ agent confirmed the tragic news to PEOPLE, saying that the world “has lost one of the most significant human beings of the 20th century.” The rep added that Lewis died of natural causes while surrounded by his family.\n\nLas Vegas Review Journal columnist John Katsilometes confirmed the news on Twitter on Sunday, writing that Lewis’ rep told him in a statement that he died at 9:15 a.m. on Sunday morning in his home in Las Vegas.\n\nRobert De Niro statement on the passing of Jerry Lewis #KingOfComedy pic.twitter.com/NNWsmkUDqK — Marlow Stern (@MarlowNYC) August 20, 2017\n\nMarlow Stern, a reporter with The Daily Beast, tweeted a statement from Robert De Niro on Lewis’ passing.\n\n“Jerry was a pioneer in comedy and film. And he was a friend. I was fortunate to have seen him a few times over the past couple of years,” the statement read. “Even at 91, he didn’t miss a beat … Or a punchline. You’ll be missed.”\n\nSo saddened to learn of the passing of Jerry Lewis, a true comic icon. In Boston 1947 I roared at his and Dean's first ever performance — carl reiner (@carlreiner) August 20, 2017\n\nComedy legend Carl Reiner joined in on the string of tributes.\n\n“So saddened to learn of the passing of Jerry Lewis, a true comic icon,” he tweeted. “In Boston 1947 I roared at his and Dean’s first ever performance.”\n\nGad remembered Lewis with an old photo. “One of the greatest of all time. A legend. A showman. A comedic icon. A movie star. An activist. A one of a kind. RIP #jerrylewis,” Gad tweeted.\n\nWe have lost a great comedian and even greater heart. Thank you for the laughs and the feels, Jerry Lewis. https://t.co/vdYCfd7atJ — George Takei (@GeorgeTakei) August 20, 2017\n\nThat fool was no dummy. Jerry Lewis was an undeniable genius an unfathomable blessing, comedy's absolute! I am because he was! ;^D pic.twitter.com/3Zdq9xhXlE — Jim Carrey (@JimCarrey) August 20, 2017\n\nOne of the greatest of all time. A legend. A showman. A comedic icon. A movie star. An activist. A one of a kind. RIP #jerrylewis pic.twitter.com/h3ODZgZjAa — Josh Gad (@joshgad) August 20, 2017\n\neven tho u said women arent funny rest in peeeeeeeaaacccccceeeeee https://t.co/f4K8lav7zG — Chelsea Peretti (@chelseaperetti) August 20, 2017\n\nAs a kid, I'm pretty sure I was the biggest Jerry Lewis fan in the world. Truly. R.I.P. Jerry Lewis. — Kumail Nanjiani (@kumailn) August 20, 2017\n\nCondolences to the family of Jerry Lewis. The world is a lot less funnier today. ☹️ — William Shatner (@WilliamShatner) August 20, 2017\n\nPenn Jillette also reacted to the news on Twitter, being one of the first to reveal that the comedian had died.\n\n“Jerry Lewis just died,” Jillette wrote. “When I met him, I feel apart, just sobbed. I guess it’s time for that again.”\n\nJerry lived to make the world laugh, and laugh we did for decades. His talent was surpassed only by his humanitarianism. Rest well pal — Larry King (@kingsthings) August 20, 2017\n\nPatton Oswalt was sure to pen his own tribute to the comedian, writing on Twitter, “Jerry Lewis has passed on. I sincerely hope his afterlife is a warm, peaceful … haven.”\n\nLarry King shared a photo of himself and Lewis in goofy poses before tweeting a moving message: “Jerry lived to make the world laugh, and laugh we did for decades. His talent was surpassed only by his humanitarianism. Rest well pal.”\n\nI mourn the passing of my friend Jerry Lewis. He was the Friars Club's Abbott and I its Dean. He could always make me laugh. pic.twitter.com/aZ1ZmMM2Y5 — Larry King (@kingsthings) August 20, 2017\n\nThe French were right about him all along. RIP Jerry Lewis pic.twitter.com/jNLRPQeS4G — Gilbert Gottfried (@RealGilbert) August 20, 2017\n\nDick Gregory and Jerry Lewis were two of the funniest, most legendary and prolific entertainers of our generation and I bow to their genius. — Margaret Cho (@margaretcho) August 20, 2017\n\nRIP jerry lewis… he was always so nice to me – the greatest of all time. — Harry Connick Jr (@HarryConnickJR) August 20, 2017\n\nWatched nutty professor over and over and over again as a kid. Got to meet and hang with clegend who made it. #jerrylewis. Rip — Russell Simmons (@UncleRUSH) August 20, 2017\n\nDick Gregory and Jerry Lewis in a 12 hour span? That shit happens in threes. I'm rollin' up in bubble wrap and layin' on the floor & whatnot — George Wallace (@MrGeorgeWallace) August 20, 2017\n\nThe death comes about two months after Lewis was hospitalized in Las Vegas with a urinary tract infection — the latest in a history of health issues.\n\nIn June 2006, Lewis suffered a mild heart attack in San Diego. Still, his manager told PEOPLE at the time, “He’s doing very well. He’ll be standing on that stage at the [Jerry Lewis Muscular Dystrophy Association] telethon on Labor Day.”\n\nIn its time, the annual fundraiser, which Lewis started in 1966 (he stopped hosting as of 2010), is said to have raised more than $2 billion for medical research.\n\nMy deepest condolences and prayers to the entire Lewis family . The world lost a great man today. Jerry Lewis. pic.twitter.com/KBwgquLbKh — Tony Orlando (@TonyOrlando) August 20, 2017\n\nOnly #JerryLewis would have the comedic bravado to do a dueling drum solo with the great #BuddyRich RIP Mr. Lewis…you changed the world! pic.twitter.com/OqbXmuQghm — Mark Schulman (@markyplanet) August 20, 2017\n\nPrior to his heart attack, Lewis had long faced health problems, and in June 2012 was rushed to the hospital with low blood sugar only minutes before he was expected to present an award to Tom Cruise at a New York Friars Club event.\n\nStill, Lewis has managed to maintain his popularity, and legend-status during his decades-long career. His manic style amused generations of moviegoers on both sides of the Atlantic, and his popularity often confounded critics.", "images": ["https://secure.gravatar.com/avatar/56ee470e654daedf74f2c6e5b8b70f2a?s=300&d=blank&r=g", "https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/07/11375342_417123731803445_2077871559_n-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/08/jerry-lewis-l.jpg?crop=0px%2C0px%2C2494px%2C1309.35px&resize=1200%2C630"], "top_img": "https://peopledotcom.files.wordpress.com/2017/08/jerry-lewis-l.jpg?crop=0px%2C0px%2C2494px%2C1309.35px&resize=1200%2C630", "keywords": [], "authors": ["Char Adams"], "canonical_link": "https://people.com/celebrity/jerry-lewis-dead-celebrity-reactions/", "title": "Jim Carrey, Robert De Niro Lead Celebrity Tributes to Jerry Lewis: 'He Didn't Miss a Beat, Or a Punchline'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Jerry Lewis, Jerry Lewis dead, Jerry Lewis pass away, Jerry Lewis movies, Jerry Lewis death, jerry lewis death reactions, patton oswaltt, dane cook, celebrities jerry lewis", "news_keywords": "Jerry Lewis, Jerry Lewis dead, Jerry Lewis pass away, Jerry Lewis movies, Jerry Lewis death, jerry lewis death reactions, patton oswaltt, dane cook, celebrities jerry lewis", "description": "Comedy king Jerry Lewis died Sunday morning in his Las Vegas home", "og": {"title": "Jim Carrey, Robert De Niro Lead Celebrity Tributes to Jerry Lewis: 'He Didn't Miss a Beat, Or a Punchline'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/celebrity/jerry-lewis-dead-celebrity-reactions/", "description": "Comedy king Jerry Lewis died Sunday morning in his Las Vegas home", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/08/jerry-lewis-l.jpg?crop=0px%2C0px%2C2494px%2C1309.35px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/celebrity/jerry-lewis-dead-celebrity-reactions/", "description": "Comedy king Jerry Lewis died Sunday morning in his Las Vegas home", "media": "https://peopledotcom.files.wordpress.com/2017/08/jerry-lewis-l.jpg?crop=0px%2C0px%2C2494px%2C1309.35px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/celebrity/jerry-lewis-dead-celebrity-reactions/", "title": "Jim Carrey, Robert De Niro Lead Celebrity Tributes to Jerry Lewis: 'He Didn't Miss a Beat, Or a Punchline'", "description": "Comedy king Jerry Lewis died Sunday morning in his Las Vegas home", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/08/jerry-lewis-l.jpg?crop=0px%2C0px%2C2494px%2C1309.35px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}