{"url": "www.therichest.com/pop-culture/15-celebs-chris-pratt-should-date-instead-of-the-mystery-blonde/", "text": "Ever since his breakup with Anna Faris last summer, many have been wondering who the next woman in Chris Pratt’s life is going to be. The guy is hot as hell, not to mention he could make you laugh in under a minute. He’s one of the most eligible bachelors out there and we are dying to know who he’s going to date next. It’s been a year since his separation with Faris and it doesn’t seem like those two are rekindling things anytime soon.\n\nHe was recently seen out for a coffee with a “mystery blonde,” and the rumor mills are going about who she can be. Pratt has had many blondes in his life so it could be anyone. Whether he’s meeting a friend for coffee or if it’s something more, the gossips are out circling like wolves. Could Pratt be taking himself off the market? He doesn’t have a whole lot of time to date these days, now that he became an Avenger, he’s going to be busier than ever. Avengers: Infinity War is coming out in April and that is sure to keep him busy while he’s on the movie tour. Two months after that, we will see the much-anticipated Jurassic World: Fallen Kingdom. With two summer hits coming his way, he'll probably reach a whole new level of fame. Does he have time for his new mystery blonde? Let’s check out 15 celebs Chris Pratt should date instead of the “mystery blonde.”\n\n15 Pratt Should Take On The Black Widow\n\nScarlett Johansson is one of the most eligible females in the industry right now and one of the foxiest women in Hollywood. How hot would it be if these two started dating? Now that Pratt has instated himself in the Avengers, he’s on a whole new level and could certainly score a date with this beauty.\n\nThere was certainly a time that he would not have been considered in the same league as Johansson. However, she just got divorced again, so she may be looking for some fresh meat.\n\nShe is the Black Widow after all. She doesn’t have the best track record for relationships whereas Pratt really has only had two major relationships since he's been in Hollywood and one was his marriage to Faris. But the two would definitely steam up things in Hollywood together for sure.\n\n14 Haley Bennett Is More Than Magnificent\n\nHaley Bennett is certainly one blonde who is cute as a button. She would make a great addition to Pratt’s life.\n\nHe does have a history of liking petite blondes, so she would fit right in.\n\nThe two were costars together for the movie The Magnificent Seven. Pratt was definitely impressed with his costar when they were shooting the movie because she could handle a rifle better than anyone else on set. She did have one mishap though: \"My bullets flew up and fell into my cleavage,\" she said. \"They burn you. You could just smell the flesh burning,\" Bennett said. \"When I was riding the horses, I would get chaffing. We had mosquito bites and my hands were raw from the reigns and my legs were raw from the stirrups because I was wearing a dress.\" Maybe working together wasn’t that hot.\n\n13 Love On The Set Of Jurassic World\n\nBryce Howard was another gorgeous celebrity that had rumor mills booming when he split from Anna Faris. The two worked together on Jurassic World and became super close. Howard cried when filming ended and the two were recently reunited for the making of Jurassic World: Fallen Kingdom. Howard is (un)fortunately happily married and has been since 2006, so we’re not likely to see her with Pratt anytime soon. She does tend to stalk the men that she’s interested in, or at least that’s how she got her husband.\n\n“I had an enormous crush on him — he was gorgeous, and it was love at first sight, but not for him.\n\nI basically stalked him, there was no interest, and then I called him at a really inappropriate hour in the middle of the night and asked him out for coffee.”\n\n12 Jennifer Lawrence Is His Best Female Friend\n\nAnytime that there is news about Chris Pratt with a blonde, we have to automatically check to see if it’s Jennifer Lawrence. We’ve all been dying to know if the rumors of a fling between them were really true. Of course, when Pratt and Faris first split, all eyes were on Lawrence because let’s be honest, when Pratt and Lawrence were in the movie Passengers together, their Instagram posts were insane.\n\nThe pictures alone, never mind their intense chemistry, would have had most wives filing for a divorce. You can’t fake chemistry like that.\n\nOf course, we all assumed the two would come out and make things official just like Angelina Jolie and Brad Pitt eventually did. Alas, we are still waiting, but we feel that she is still in the running to be the next blonde in his life.\n\n11 Aubrey Plaza Could Give Pratt A Run For His Money\n\nBefore Chris Pratt got insanely hot, he was on the TV show Parks and Recreation with Aubrey Plaza. She played his girlfriend on the show and the two had the natural chemistry of two people who just get each other. Pratt obviously cares about his costar and considers her a friend because he went to see his former costar at the premiere of her movie release, Ingrid Goes West, last year. The two would certainly make a cute couple and they have a lot of history together, so we wouldn't be surprised if they dated.\n\nShe was there before he got ripped, so he would know that she would still stick by him if he decided to give up the abs.\n\nThe two have a great sense of humor, so that’s an easy match right there.\n\n10 Chris Pratt And The Foxy Olivia Munn\n\nRecently, Chris Pratt and Olivia Munn were linked together and the two would definitely make a smoking hot couple. Many believe there was some weird love triangle going on between Anna Faris, Pratt, and Munn. There were rumors going around that Munn and Pratt were “secretly dating” and we’re all for that. Many believed that Faris would have been angry about the union because Faris had once told Munn how much she loved Pratt. Munn crushed all our hopes when she made this Instagram story about how she and Pratt were not dating.\n\n\"Hello! 1. Not every woman is scorned and upset after a breakup. 2. Not every woman is \"furious\" at another woman for dating her ex.\n\n3. So even if I was dating @prattprattpratt, some tabloids got me and @annafaris all wrong. 4. Women respect and love each other a lot more than some people like to think. 5. Chris and I would have a horrible celebrity name.\" We still think they would be good together.\n\n9 Anna Kendrick Would Make A Cute Girlfriend\n\nLet’s be honest, Chris Pratt loves petite girls that can make him laugh and Anna Kendrick totally fits that category. They would be adorable together.\n\nKendrick is a little spitfire who would never let Pratt get the last word in and according to Ryan Reynolds, she’s a heck of a kisser, so that’s one extra point for her.\n\nKendrick also happens to know Aubrey Plaza really well, so maybe Plaza should set it all up if she’s not going to sweep Pratt off his feet. We all know that Pratt should be with a funny girl, that’s just his taste. He was with Faris for a long time and we bet it lasted that long because they could laugh away their problems for a long time.\n\n8 Emily Vancamp Is A Blast From His Past\n\nEmily Vancamp and Chris Pratt dated a long time ago before he was famous. Pratt has only had two major relationships while in Hollywood and one of them was with Faris while the other was Vancamp. The two actually played brother and sister on the TV show Everwood which is actually kind of weird since the two were dating at the time.\n\n\"Yeah, we've pretty much gotten used to the response of, 'Ew, that's weird. That's creepy,'\" Pratt said of their relationship in an interview with TV Guide in 2006.\n\n\"The people who know us are happy, and probably expected it to happen eventually. But yeah, every once in a while, we get that one person that's like, 'That's really creepy. You just kissed your sister.'\" The two dated for three years before they broke up.\n\n7 Sarah Hyland Would Be A Great Match\n\nWhy didn’t we think of this one before? It’s perfect! Sarah Hyland is a total babe and she would definitely be Chris Pratt’s type of girl. If you have ever checked out her Instagram page, then you know that she can be silly, geeky, funny, and foxy all rolled into one. Some of her pics are very original. She also knows comedy since she's been on the TV show Modern Family. She would be the perfect girl to help Pratt move on from Anna Faris and also forget this new “mystery blonde.” However, since November of last year, Hyland has been linked with Wells Adams, so Pratt may have just missed his chance.\n\n6 Karen Gillan And Pratt Are Promoting Movies Together\n\nKaren Gillan and Chris Pratt have been in not one, but three movies together. It’s kismet, we swear. Gillan and Pratt first met on the set of Guardians of the Galaxy. Gillian returned for the sequel, Guardians of the Galaxy Vol. 2, and was reunited with Pratt once again in the new Avengers: Infinity War as well. She will also be starring in the next Avengers movie for 2019. That’s a lot of screen time for the both of them. She’s definitely cute and that seems to be the theme of all the girls he is connected with. Plus, they wouldn’t have to worry about being separated for long periods of time for filming. They seem to do a lot of movies together. We think they would make a great match.\n\n5 Elizabeth Olsen Is Totally A Badass\n\nElizabeth Olsen plays a lot of badass characters, especially in the Avengers movies. The little sister to Mary-Kate and Ashley Olsen has paved her own way in Hollywood and Pratt would certainly make a good match for her. Pratt knows what it’s like to play badass characters since he’s been doing it in Guardians of the Galaxy and Jurassic World. These two would have met on the set of the new movie Avengers: Infinity War and we think they would be hot together. She’s clearly a beautiful woman and already has a successful career in Hollywood, so there should be no jealousy between them when it comes to their careers. Sorry, Anna Faris! There are a few costars that Pratt has been connected with that would make great partners for him. Only problem is, it looks like she's kind of friends with Faris since they worked together.\n\n4 The Emma Stone Connection\n\nMaybe Jennifer Lawrence and Chris Pratt are just friends. Sure, why not — those pictures could have been just two buddies just enjoying time alone together. In that case, Lawrence should be helping her best friend Emma Stone out and hooking her up with an amazing guy. We all know that deep down Pratt is a great guy. And did we mention that he has abs? The fact that Lawrence and Stone get along so well because they're weird, it would make her a shoo-in for Pratt.\n\nStone is hilarious on and off camera, so she would make a perfect girlfriend for Pratt because he likes a girl with a sense of humor.\n\nThe two are both currently single, so Lawrence should make the effort and set them up. Unless there’s something holding her back…\n\n3 Elizabeth Debicki Is A Foxy Costar\n\nElizabeth Debicki is another actress that has been part of the Guardians of the Galaxy franchise. She worked with Chris Pratt on the first two movies.\n\nElizabeth Debicki is without a doubt a complete fox and she could give Pratt a run for his money. He better snatch her up because she gets too famous for him.\n\nShe is not as well known in the industry as he is, but neither was Anna Faris. Debicki is certainly doing a good job of paving her way in the biz. She was also in The Great Gatsby with Leonardo DiCaprio and she has four movies coming out in 2018, so that’s pretty impressive. She would definitely be a partner that Pratt could stand beside proudly.\n\n2 Emma Watson Is A Force To Be Reckoned With\n\nEmma Watson would be an amazing partner for Chris Pratt for one reason — she’s a powerful woman in the industry. She’s been in it for a while now thanks to the Harry Potter movies, so she knows how to deal with fame. She also knows how to speak her mind so she can handle paparazzi with the best of them. She’s someone that could handle a powerhouse boyfriend like Pratt and support him right back. She’s a gorgeous actress who is making her way in Hollywood now that she’s no longer a kid anymore. They would be adorable together because we know that Pratt deserves the best when it comes to a girlfriend. Whoever the “mystery blonde” is, we think that Pratt should definitely check out our list before he makes any final decisions.\n\n1 A Rekindling Affair With Anna Faris\n\nSure, why not? It would be great news all around if Chris Pratt were to reunite with his ex-wife. There are so many reasons why the two should try to make it work. They are awesome together, they are each other’s number-one fan, and they have a cute little boy together. A girl can dream, right?\n\nThere was a rumor that Chris Pratt and Anna Faris would get back together.\n\nAfter all, for the longest time, they were #relationshipgoals. Keep that in mind Blake Lively. You never can tell sometimes what celebrity couples are going to call it quits because we definitely didn’t see this one coming. It’s obvious these two are unlikely to get back together, but that doesn’t mean that there aren’t some pretty great options out there for him.", "images": ["https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "http://www.therichest.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://static2.therichestimages.com/wordpress/wp-content/uploads/2018/03/Screen-Shot-2018-03-06-at-1.03.17-PM.png", "http://www.therichest.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "http://www.therichest.com/public/build/images/th-logo-full-white.7684e614.svg", "https://www.facebook.com/tr?id=150820128703309&ev=PageView&noscript=1"], "top_img": "https://static2.therichestimages.com/wordpress/wp-content/uploads/2018/03/Screen-Shot-2018-03-06-at-1.03.17-PM.png", "keywords": [], "authors": [], "canonical_link": "https://www.therichest.com/pop-culture/15-celebs-chris-pratt-should-date-instead-of-the-mystery-blonde/", "title": "15 Celebs Chris Pratt Should Date Instead Of The Mystery Blonde", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "With two summer hits coming his way, he'll probably reach a whole new level of fame and he needs someone who can understand and keep up.", "og": {"title": "15 Celebs Chris Pratt Should Date Instead Of The Mystery Blonde", "type": "article", "image": {"identifier": "https://static2.therichestimages.com/wordpress/wp-content/uploads/2018/03/Screen-Shot-2018-03-06-at-1.03.17-PM.png", "width": 1152, "height": 579}, "url": "https://www.therichest.com/pop-culture/15-celebs-chris-pratt-should-date-instead-of-the-mystery-blonde/", "locale": "en_US", "description": "With two summer hits coming his way, he'll probably reach a whole new level of fame and he needs someone who can understand and keep up.", "site_name": "TheRichest"}, "article": {"published_time": "2018-03-06T19:03:11Z", "section": "Pop Culture"}, "fb": {"app_id": 124380934395811}}, "movies": [], "publish_date": 1520362991.0, "source": "http://www.therichest.com", "summary": ""}