{"url": "www.nbc4i.com/news/u-s-world/the-latest-heavy-security-before-sundays-golden-globes/1096444797", "text": "BEVERLY HILLS, Calif. (AP) – The Latest on the presentation of the 75th annual Golden Globe Awards from the Beverly Hilton Hotel in Beverly Hills, California (all times local):\n\n8:05 p.m.\n\nThe fierce revenge tale “Three Billboards Outside Ebbing, Missouri” has won the Golden Globe Award for best film drama.\n\nFrances McDormand stars as a raging mother seeking answers for her daughter’s murder. Directed by Martin McDonagh, the film has garnered widespread praise for McDormand’s fierce performance.\n\nThe film won the honor moments after McDormand won the Globe award for best actress in a film drama. Sam Rockwell also won the Globe award for best supporting actor.\n\n___\n\n8 p.m.\n\nFrances McDormand is the winner of the best actress in a drama film for her role in “Three Billboards Outside Ebbing, Missiouri.”\n\nMcDormand plays the mother seeking justice for her daughter, who was raped and killed, and takes on the small town police force who she doesn’t believe is doing enough to solve the case.\n\nThe actress accepted the award saying she would buy tequila for all the other nominees in the category.\n\nShe also ribbed the Hollywood Foreign Press Association, which hands out the Globes, saying she still didn’t know who they are but credited them for electing a female president.\n\n___\n\n7:50 p.m.\n\nGary Oldman is the winner of the Golden Globe Award for best actor in a drama film.\n\nOldman won for his portrayal of Winston Churchill in “Darkest Hour,” which focuses on the British statesman’s efforts to convince his countrymen to fight the Nazis in World War II.\n\nThe actor quoted Churchill, saying he was surrounded by the very best people in the industry, while working on the film.\n\n___\n\n7:40 p.m.\n\nGreta Gerwig’s directorial debut “Lady Bird” has won the Golden Globe Award for best film comedy or musical.\n\n“Lady Bird” stars Saoirse Ronan as the title character, a teenager in Sacramento, California, who is navigating her last days of high school and her tense relationship with her mother. The film has earned Gerwig, Ronan and her co-star Laurie Metcalf widespread\n\nThe film’s producer ceded his speech to Gerwig, who profusely thanked everyone who worked on the film and Ronan, who moments earlier won the best actress in a film comedy Globe award.\n\n___\n\n7:35 p.m.\n\nSaoirse Ronan is the winner of the best actress in a film comedy or musical Golden Globe Award.\n\nRonan won for “Lady Bird,” in which she plays a teenager in Sacramento, California, who’s juggling her last year in high school, college ambitions and a tense relationship with her mother.\n\nWith Sunday’s ceremony running long, Ronan had to deliver a rushed speech. She profusely thanked her mother, who she said was on a video call.\n\n___\n\n7:30 p.m.\n\n“Big Little Lies” is the winner of the Golden Globe Award for the best television limited series or movie.\n\nThe series follows a group of mothers in Northern California who each have their own secrets threatening them and their families. The show won the Emmy Award last year for best limited series and will return for a second season on HBO.\n\nThe show dominated the Globes in the limited series category on Sunday, with wins for Nicole Kidman and Alexander Skarsgard.\n\nReese Witherspoon, who starred in and produced the series, said of women who have been abused, “”We see you, we hear you, and we will tell your stories.”\n\n___\n\n7:25 p.m.\n\nThe bathrooms at the Golden Globes are more like hair salons.\n\nThe A-list stars attending this year’s show always look picture perfect for a reason: When they head to they restroom they met up with hair stylists who touch her their hair and makeup, giving them a refreshed looked before they return to their seats.\n\nThey are also a place where stars get to praise one another.\n\nDuring one bathroom break before the show started, Sarah Paulson declared to anyone who could hear her in in line for ladies’ restroom: “Ladies and gentlemen, Claire Foy is here and nothing else matters. We don’t have to pretend we don’t all feel the same way.”\n\nMoments earlier, Paulson and actress Amanda Peet gushed directly to “The Crown” Star about her performance. Foy blushed is response, then dashed into an open compartment.\n\n– Lynn Elber and Sandy Cohen (APSandy) from inside the Golden Globes ceremony.\n\n___\n\n7:20 p.m.\n\nGuillermo del Toro is the winner of the best director Golden Globe Award for his Cold War fairy tale “The Shape of Water.”\n\nThe film stars Sally Hawkins as a mute cleaning lady who falls in love with an amphibious creature kept confined in a government lab. The film has become of the front-runners for best picture at March’s Academy Awards. Del Toro’s acceptance speech, which was interrupted by the orchestra at one point, was an ode to his love affair with monsters.\n\nHe thanked the film’s cast, before continuing: “My monsters thank you.”\n\nThe category was dominated by male directors, which drew criticism since 2017 featured several acclaimed films from female directors, including “Wonder Woman,” ”Lady Bird” and “Mudbound.”\n\nIt was a point that presenter Natalie Portman accentuated before the names of the nominees were read Sunday night.\n\n___\n\n7:10 p.m.\n\nOprah Winfrey has accepted a lifetime achievement award at the Golden Globes by saying she hopes as the first black women to accept the honor, she hopes it has an impact on young girls watching Sunday’s ceremony.\n\nThe actress and businesswoman accepted the Cecil B. DeMille Award at Sunday’s Globes ceremony and received a lengthy standing ovation, which she tried to calm down.\n\nShe spoke about the feelings she had as a young girl watching Sidney Poitier win the best actor Academy Award in 1964. She likened the pride she felt watching Poitier, the first black man to win the best best actor Oscar, to the impact she hoped she could have on young women.\n\nWinfrey also addressed the sexual misconduct scandal roiling Hollywood and beyond, telling those watching “speaking your truth is the most powerful tool you all have.”\n\nReese Witherspoon introduced Winfrey and described their friendship, forged over long sessions in a makeup trailer while filming “A Wrinkle in Time.” Witherspoon said sitting in the room with Oprah was like taking the best business classes, and her hugs could end wars.\n\n___\n\n7 p.m.\n\nAziz Ansari has won the best television comedy actor Golden Globe Award for his role on “Master of None.”\n\nAnsari is a co-creator of the Netflix series which focuses on his character, Dev, as he navigates relationships and his growing television career.\n\nThe show’s second season expanded to tell the backstories of some of Dev’s friends, including an episode that focused on the life of ordinary New Yorkers and another that explored the coming out story of a lesbian character played by Lena Waithe.\n\nAnsari accepted the award by saying he didn’t think he would win it since so many websites had predicted he would lose Sunday night.\n\n___\n\n6:55 p.m.\n\nThe Marvelous Mrs. Maisel is the winner of the Golden Globe Award for best television comedy.\n\nThe freshman Amazon series stars Rachel Brosnahan as a 1950s housewife who pursues a stand-up comedy career. It’s been a big evening for the show – Brosnahan won the best actress in a comedy series award earlier in the ceremony.\n\n___\n\n6:45 p.m.\n\nEwan McGregor has won the Golden Globe Award for best actor in a television limited series or movie for his dual roles in the third season of the FX series “Fargo.”\n\nMcGregor plays brothers, one a successful businessman and the other a parole officer, who find themselves at odds over the paths their lives have taken.\n\n___\n\n6:40 p.m.\n\nGermany and France’s “In the Fade” is the winner of the best foreign language Golden Globe Award.\n\nThe film stars Diane Kruger as a woman forced to cope with the death of her Turkish husband and their young son in a terrorist attack. It is from director Fatih Akin, a German-born filmmaker of Turkish descent.\n\n___\n\n6:30 p.m.\n\nAllison Janney is the winner of the best supporting film actress Golden Globe Award for her role in “I, Tonya.”\n\nJanney won for her portrayal of figure skater Tonya Harding’s mother, who unleashes abuse on her daughter to try to make her a better athlete.\n\nShe thanked co-star Margot Robbie and profusely thanked Harding, who was in the ballroom for Sunday’s ceremony.\n\n___\n\n6:20 p.m.\n\n“Coco” has won the Golden Globe Award for best animated film.\n\nThe Disney and Pixar collaboration is considered a leading contender for an Academy Award for best animated feature. It tells the story of a Mexican boy who dreams of being a musician despite his family’s wishes and falls into the realm of the dead.\n\n“Coco” has drawn widespread praise for the culturally authentic way it presents Mexico’s “Day of the Dead” culture.\n\n___\n\n6:05 p.m.\n\nJames Franco has won the Golden Globe Award for best actor in a comedy or musical for his portrayal of the mysterious man who created what many consider the worst movie ever made.\n\nFranco directed and starred in “The Disaster Artist,” which tells the story of the mysterious filmmaker Tommy Wiseau and his passion project, “The Room.” Savaged by critics, “The Room” has since gained a cult following, and Franco has received considerable Oscar buzz.\n\nFranco opened his speech by inviting “The Room” creator Wiseau up on stage and giving him a hug and reading a passage he said Wiseau wrote 19 years ago.\n\n___\n\n6 p.m.\n\n“This is Me” is the winner of the best song Golden Globe Award. The track was created for the film “The Greatest Showman.”\n\n“The Greatest Showman” song is the work of Oscar-winning duo Benj Pasek, Justin Paul, who won an Academy Award for their song “City of Stars” in “La La Land.” The “Showman” tune appears in the musical starring Hugh Jackman about the life of P.T. Barnum.\n\nIt beat out songs created by stars such as Mary J. Blige and Mariah Carey, who was onstage at the Globes moments before the best song award was announced.\n\nCarey, who was nominated for her song “The Star,” helped announce the winner of the best original score honor, which went to Alexandre Desplat for “The Shape of Water.”\n\n___\n\n5:55 p.m.\n\nThe group that bestows the Golden Globe Awards is giving $1 million apiece to two journalism groups.\n\nThe Hollywood Foreign Press Association President Meher Tatna announced the awards to the International Consortium Of Investigative Journalists, which led the investigation that yielded the Panama Papers, and the Committee To Protect Journalists.\n\nThe grants are the first to ever be announced during the Globes telecast.\n\nThe awards are part of the HFPA’s charitable giving, which now totals millions a year, thanks to the broadcast rights the group receives from NBC.\n\n___\n\n5:50 p.m.\n\nThe dystopian series “The Handmaid’s Tale” is the winner of the best television drama Golden Globe Award.\n\nThe Hulu series stars Elisabeth Moss as one of the few fertile women left in a world ruled by a totalitarian regime that treats women as property. The show is based on Margaret Atwood’s best-selling novel of the same name.\n\nIt is the series’ second win of the evening. Elisabeth Moss won the best actress in a television drama earlier in the ceremony.\n\n___\n\n5:40 p.m.\n\nSterling K. Brown is the winner of the best television drama actor Golden Globe Award for his role on “This is Us.”\n\nBrown plays a family man recovering from a nervous breakdown and the complicated dynamics of the family that adopted him when he was a baby.\n\nBrown opened his speech by remarking on Oprah Winfrey’s presence in the room – she is receiving a lifetime achievement award – before quickly saying he needed to thank his wife before he forgot. He also told his children that he would take them to school in the morning.\n\nBrown profusely thanked “This Is Us” creator Dan Fogelman for engaging in colorblind casting and giving him great material to work with.\n\n___\n\n5:35 p.m.\n\n“The Handmaid’s Tale’s” Elisabeth Moss has won the Golden Globe Award for best actress in a television drama.\n\nMoss plays one of the few fertile women left in a world ruled by a totalitarian regime where women are considered property. Moss attempts to keep her identity and humanity in the Hulu series, which is based on Margaret Atwood’s best-selling novel.\n\nShe dedicated her award to Atwood, reading some of the author’s words and saying that women are now “writing the stories ourselves.”\n\n___\n\n5:30 p.m.\n\nRachel Brosnahan has been awarded the best television comedy actress Golden Globe Award for her role on “The Marvelous Mrs. Maisel.”\n\nBrosnahan plays a 1950s mom who decides to pursue a stand-up comedy career. The show is also nominated for best comedy series at Sunday’s Globes.\n\nThe actress won the award on her first nomination.\n\n___\n\n5:20 p.m.\n\nSam Rockwell has won the best film supporting actor Golden Globe Award for his role in “Three Billboards Outside Ebbing, Missouri.”\n\nRockwell won for his role as a small town cop with anger issues in the revenge tale starring fellow-Globes nominee Frances McDormand. He thanked McDormand and “Three Billboards” director Martin McDonagh, who he thanked for giving him such beautiful words to say.\n\nRockwell called McDormand a “force of nature” who made him a better actor.\n\n___\n\n5:15 p.m.\n\nNicole Kidman has won the Golden Globe Award for best actress in a limited television series or movie for her role in the HBO series “Big Little Lies.”\n\nKidman plays a lawyer who gave up her successful career to be a full-time mom in a rich coastal Northern California town. Her life is not as idyllic as it seems – her husband frequently beats her.\n\nShe referenced her character in her acceptance speech, urging others to keep the conversation about abuse and the treatment of women alive.\n\nThe actress also thanked her “Big Little Lies” co-stars, saying she was sharing the honor with fellow nominees Laura Dern, Shailene Woodley and Reese Witherspoon.\n\n___\n\n5:05 p.m.\n\nSeth Meyers has opened the 75th annual Golden Globe Awards with jokes about the sexual misconduct scandal, saying it’s the first time in three months that it won’t be terrifying for male actors to have their names read out loud.\n\nMeyers started his monologue by saying, “Good evening ladies and remaining gentlemen!”\n\nHe also jabbed disgraced film mogul Harvey Weinstein who has been accused by dozens of women of sexual harassment and abuse. Meyers noted that Weinstein isn’t present for Sunday’s ceremony, but said that he’ll be back in 20 years – when he’ll be the “first person ever booed during the In Memorium” segment.\n\nThe joke was met with some groans in the ballroom.\n\nMeyers mixed his comments about the sexual misconduct scandal with jokes about the nominees and a few barbs directed at President Donald Trump.\n\n___\n\n4:40 p.m.\n\nThere’s more to occupy the Golden Globes crowd than awards.\n\nThey can get their face copied atop a cappuccino or latte. How many stars are taking advantage before the show? So far, a barista says none: they’re focusing on the alcoholic drinks.\n\nStars often rush into the International Ballroom at the Beverly Hilton Hotel at the last minute, so the Globes this year are attempting to get people in their seats earlier in the evening. Red carpet interviews are supposed to already be done, and an announcer has told the group it’s 30 minutes to show time.\n\n– Lynn Elber in the Golden Globes ballroom.\n\n___\n\n4:20 p.m.\n\nDinner is served so early at the Golden Globes it can be confusing.\n\nMore than hour before the show, “This Is Us” star Milo Ventimiglia asked castmate Chris Sullivan if it was time to sit down at one of the tables already set with salads. When Sullivan said he’d been in place for a half-hour, Ventimiglia started chowing down. It’s a good thing – the three-course meal is served and cleared fast, so all the eating is done before the ceremony starts. But the wine and Champagne keep flowing throughout the three-hour ceremony.\n\nAmong the other early arrivals were the cast of “Stranger Things,” ”Get Out” stars Daniel Kaluuya and Allison Williams, Meryl Streep and John Goodman, who enjoyed a cigarette on the terrace while he watched a live feed of the arrivals.\n\n– Lynn Elber and Sandy Cohen (APSandy) in the Golden Globes ballroom.\n\n___\n\n4:10 p.m.\n\nDebra Messing has made her point about gender equality by calling out E! Entertainment Television on the issue while doing an interview with the network on the Golden Globes red carpet Sunday.\n\nMessing was explaining why she wore black to support Hollywood’s whistleblowers and the Time’s Up initiative, then referenced the recent departure from E! of host Catt Sadler, who has said she learned she was making about half the pay of her male counterpart, Jason Kennedy.\n\nMessing tells E! host Giuliana Rancic, “I was so shocked to hear that E! doesn’t believe in paying their female co-hosts the same as their male co-hosts. I miss Catt Sadler.”\n\nMessing says it’s crucial to “start having this conversation that women are just as valuable as men are.”\n\n– Jocelyn Noveck\n\n___\n\n4 p.m.\n\nGolden Globe nominee Michelle Williams says that she just wants to listen to what #MeToo founder Tarana Burke has to say, and that’s why she brought her to Sunday’s Golden Globes.\n\nWilliams tells The Associated Press, “I’m so much more interested in what you have to say than what I have to say.”\n\nBurke says the solidarity and the support behind Time’s Up and #MeToo is something we’ve never seen before.\n\nWilliams is one of eight actresses who are attending the Golden Globes with advocates for gender and racial justice.\n\nBurke says the actresses are generous in sharing their platform so they could highlight their causes and turn the spotlight back on the survivors and solutions rather than the perpetrators.\n\nWilliams is nominated for her role in Ridley Scott’s “All the Money in the World.” When asked about working with Christopher Plummer who replaced Kevin Spacey in the film after Spacey was accused of sexual misconduct, Williams says she’s “not talking about that.”\n\n– Lindsey Bahr (@ldbahr) on the Golden Globes red carpet.\n\n___\n\n3:25 p.m.\n\nAlison Brie says that the Time’s Up initiative has made her realize how powerful women can be when they all stand together.\n\nThe actress is nominated for a Golden Globe for her work in the Netflix wrestling show “GLOW.” Brie, who also appears in the Golden Globe nominated films “The Post” and “The Disaster Artist,” wore a dramatic strapless black dress with a sweetheart neckline to show solidarity with Time’s Up Sunday.\n\nBrie says she thinks change will come when more women are in power at the top. She says a lot more listening needs to happen across all industries.\n\n– Lindsey Bahr (@ldbahr) on the Golden Globes red carpet.\n\n___\n\n3:15 p.m.\n\n“Get Out” star Daniel Kaluuya says that the fact that the film is still in the conversation is “mind-boggling.”\n\nHe noted Sunday on the Golden Globes red carpet that the film came out almost a year ago in February.\n\nKaluuya wore a black tux with a Time’s Up pin on his lapel. He is nominated for best actor in a musical or comedy, and “Get Out” is up for best picture in the same category.\n\nHe says he feels privileged to stand by the women fighting against the unnecessary evils that are happening in the industry.\n\n– Lindsey Bahr (@ldbahr) on the Golden Globes red carpet.\n\n___\n\n2:55 p.m.\n\nAlfred Molina says he feels terrible for his “Frida” co-star Salma Hayek’s experiences with Harvey Weinstein. Hayek detailed sexual harassment from Weinstein during the production of “Frida” in a New York Times essay in December.\n\nSpeaking Sunday on the Golden Globes red carpet, Molina says that Hayek is not one to exaggerate and is a serious, forthright woman and he was struck by her bravery. He says it’s saddening and heartbreaking that she had to carry that weight for so long.\n\nSporting all black, down to his tie and his shirt, the “Feud” star said that it was a very small gesture of solidarity but hoped that out of small gestures comes big ones.\n\nChris Sullivan of “This Is Us” did not wear an all-black outfit, but painted his fingernails black for Sunday’s ceremony.\n\n– Lindsey Bahr (@ldbahr) on the Golden Globes red carpet.\n\n___\n\n2:40 p.m.\n\nThe highly anticipated wear-black protest at the Golden Globes got off to an early start Sunday as soon as the red carpet opened, including Michelle Williams in an embellished off-the-shoulder look and “Me Too” founder Tarana Burke at her side.\n\nTurning the Globes dark on the fashion front had been anticipated for days after a call for massive reform following the downfall of movie mogul Harvey Weinstein and numerous others in Hollywood, media, fashion, tech, publishing and other industries. The new initiative Time’s Up, backed by more than 300 women in Hollywood, doled out pins intended for those who might already have locked in more colorful looks.\n\nAllison Williams provided a pop of orange and silver on the bodice of her black column gown.\n\nNot everybody supports the protest. Rose McGowan, who has accused Weinstein of rape, has loudly and persistently called the effort an empty gesture.\n\n___\n\n2:30 p.m.\n\nMichelle Williams has arrived at the Golden Globes with the first of several gender and racial activists who are accompanying actresses to Sunday’s awards gala.\n\nWilliams has brought #MeToo founder Tarana Burke to the awards show to help highlight gender inequality. Seven other actresses, including Emma Stone and Meryl Streep, are bringing activists to the ceremony, which is the first major awards show since the sexual misconduct scandal roiled Hollywood.\n\nBoth Williams and Burke wore black dresses. Many actresses are planning to wear black to Sunday’s ceremony to show solidarity for the victims of sexual misconduct.\n\n– Andrew Dalton (@andyjamesdalton) in the fan bleachers outside the Golden Globes.\n\n___\n\n2 p.m.\n\nAl Roker and Carson Daly have drawn quite the crowd of spectators as they made their way past the champagne and photographers on the red carpet and into the Golden Globes ballroom, trailed by a crew of cameras and lights.\n\nRoker tweeted earlier that he’s never seen security like this for the Globes. He said there was checkpoint after checkpoint and that they were not kidding around.\n\nElsewhere on the red carpet, Mario Lopez filmed an early segment and other TV reporters fanned themselves down amid the rising temperatures.\n\n– Lindsey Bahr (@ldbahr) on the Golden Globes red carpet.\n\n___\n\n12:55 p.m.\n\nTemperatures pushed into the 70s in the hours before the limousines began arriving at the Golden Globes.\n\nSecurity of all kinds lined the scene Sunday. Motorcycle officers cruised down the red carpet. A sniper in military attire put a large rifle on a tripod on a low rooftop of the Beverly Hilton Hotel.\n\nWorkers sneaked quick photos on the red carpet while they could.\n\nFans who crammed into a small set of bleachers stood and strained to see any celebrity bigger than the gathered reporters.\n\nThe red carpet is scheduled to begin at 2 p.m. Pacific, but will get busier closer to the start of the Globes ceremony at 5 p.m.\n\n– Andrew Dalton (@andyjamesdalton) in the fan bleachers outside the Golden Globes.\n\n___\n\n10:25 a.m.\n\nMeryl Streep, Michelle Williams, Emma Watson and Amy Poehler are just a few of the actresses who are planning to bring gender and racial justice activists as their guests to the Golden Globe Awards Sunday evening.\n\nStreep will attend with Ai-jen Poo, the director of the National Domestic Workers Alliance, Williams with Tarana Burke, the founder of the “me too” movement, and Watson will bring Marai Larasi, the executive director of Imkaan, a Black-feminist organization.\n\nIn a statement Sunday, the advocates say they were inspired by the Time’s Up initiative. They say the goal in attending the awards will be to shift focus away from the perpetrators and back on survivors and creating lasting change.\n\nMany attending the Golden Globes will also be wearing black to protest sexual harassment.\n\n___\n\n8 a.m.\n\nThe Golden Globes, once the stomping grounds of Harvey Weinstein, will belong to someone else this year.\n\nThe 75th Golden Globe Awards is considered wide open, with contenders including Guillermo del Toro’s “The Shape of Water,” Steven Spielberg’s “The Post” and Martin McDonaugh’s “Three Billboards Outside Ebbing, Missouri.”\n\nBut whoever takes home the hardware Sunday, the spotlight is unlikely to stray far from the sexual misconduct scandals that have roiled Hollywood ever since an avalanche of allegations toppled Weinstein. Out of solidarity with the victims of sexual harassment and assault, many women have said they will be dressing in black for the Globes.\n\nRed carpet arrivals are expected to begin around 5 p.m. EST, with the broadcast starting on NBC at 8 p.m. Oprah Winfrey will received the Cecil B. DeMille lifetime achievement award.", "images": ["https://i2.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/parchment-car-on-guy-wire-120919.jpg?resize=2560%2C1440&ssl=1", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/19311758171823.jpg?w=2000&ssl=1", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/00000000000webwx2.jpg?resize=2560%2C1440&ssl=1", "https://www.nbc4i.com/wp-content/uploads/sites/18/2018/01/seth_38931773_ver1.0.jpg?w=1280&h=720&crop=1", "https://i1.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/find-a-friend.jpg?w=2000&ssl=1", "https://www.nbc4i.com/wp-content/themes/nexstar/client/src/images/footer/nexstar-logo-white-nmg.png", "https://media.nbc4i.com/nxs-wcmhtv-media-us-east-1/html/img/50x67-story-template-icon-edit.png", "https://media.nbc4i.com/nxs-wcmhtv-media-us-east-1/html/img/50x67-story-template-icon-news-tips.png", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/196698EDC3264807B80CA7ECA6398F38.jpg?resize=2560%2C1440&ssl=1", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/05/Dr.20Richard20Strauss_1558174112705-2.jpg_88047543_ver1.0-2.jpg?resize=2560%2C1440&ssl=1", "https://i1.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/Heisman-1.jpg?resize=2560%2C1440&ssl=1", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2018/01/seth_38931773_ver1.0.jpg?resize=2560%2C1440&ssl=1", "https://www.nbc4i.com/wp-content/themes/nexstar/client/src/images/footer/social/instagram.png", "https://www.nbc4i.com/wp-content/themes/nexstar/client/src/images/footer/app-stores/appstore_footer.png", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/4701AE6A33FF4548B40D3BD2013B1A16.jpg?resize=2560%2C1440&ssl=1", "https://www.nbc4i.com/wp-content/uploads/sites/18/2019/06/cropped-4-nbc4icom.png", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/vlcsnap-2019-12-09-21h49m51s088.jpg?resize=2560%2C1440&ssl=1", "https://i1.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/x-church.jpg?w=2000&ssl=1", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/12-7-19-pm-wx-cover.jpg?resize=2560%2C1440&ssl=1", "http://s3.amazonaws.com/nxs-wcmhtv-media-us-east-1/photo/STORM-TEAM-4-ALEXA.jpg", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/Chase-Young-1.jpg?resize=2560%2C1440&ssl=1", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/00000000000webwx2.jpg?w=2000&ssl=1", "https://www.nbc4i.com/wp-content/themes/nexstar/client/src/images/footer/app-stores/googleplay_footer.png", "https://i1.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/BlueJackets.jpg?w=2000&ssl=1", "https://media.nbc4i.com/nxs-wcmhtv-media-us-east-1/html/img/50x67-story-template-icon-apps.jpg", "https://i0.wp.com/www.nbc4i.com/wp-content/uploads/sites/18/2019/12/12-7-19-pm-wx-cover.jpg?w=2000&ssl=1"], "top_img": "https://www.nbc4i.com/wp-content/uploads/sites/18/2018/01/seth_38931773_ver1.0.jpg?w=1280&h=720&crop=1", "keywords": [], "authors": ["Michelle Rotuno-Johnson", "Woodtv.Com Staff", "Erica Torres", "Cnn Newsource"], "canonical_link": "https://www.nbc4i.com/news/u-s-world/the-latest-three-billboards-wins-best-drama-film-globe/", "title": "The Latest: ‘Three Billboards’ wins best drama film Globe", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The Latest on the presentation of the 75th annual Golden Globe Awards from the Beverly Hilton Hotel in Beverly Hills, California.", "keywords": "The Latest: 'Three Billboards' wins best drama film Globe", "google-site-verification": "Y7Un57nax7y1Nq_Ap5-4MFnKkuvSsOsEzQ67vpVKTFQ", "generator": "WordPress 5.2.4", "fb": {"pages": 38342932750}, "og": {"type": "article", "title": "The Latest: ‘Three Billboards’ wins best drama film Globe", "url": "https://www.nbc4i.com/news/u-s-world/the-latest-three-billboards-wins-best-drama-film-globe/", "description": "The Latest on the presentation of the 75th annual Golden Globe Awards from the Beverly Hilton Hotel in Beverly Hills, California.", "site_name": "NBC4 WCMH-TV", "image": {"identifier": "https://www.nbc4i.com/wp-content/uploads/sites/18/2018/01/seth_38931773_ver1.0.jpg?w=1280&h=720&crop=1", "secure_url": "https://www.nbc4i.com/wp-content/uploads/sites/18/2018/01/seth_38931773_ver1.0.jpg?w=1280&h=720&crop=1"}, "locale": "en_US"}, "article": {"published_time": "2018-01-07T21:41:38+00:00", "modified_time": "2018-01-07T21:41:38+00:00"}, "twitter": {"text": {"title": "The Latest: ‘Three Billboards’ wins best drama film Globe"}, "image": {"identifier": "https://www.nbc4i.com/wp-content/uploads/sites/18/2018/01/seth_38931773_ver1.0.jpg?w=640", "alt": "seth_377811"}, "card": "summary_large_image", "title": "The Latest: ‘Three Billboards’ wins best drama film Globe", "description": "The Latest on the presentation of the 75th annual Golden Globe Awards from the Beverly Hilton Hotel in Beverly Hills, California."}, "msapplication-TileImage": "https://www.nbc4i.com/wp-content/uploads/sites/18/2019/06/cropped-Meatball-logo-Blue-bg-2.jpg?w=270"}, "movies": [], "publish_date": 1515361298.0, "source": "http://www.nbc4i.com", "summary": ""}