{"url": "ew.com/news/2017/01/20/trump-inauguration-celebrity-reactions/", "text": "Donald Trump will be sworn in as the 45th president of the United States on Friday, but not everyone will be tuning in.\n\nCelebrities took to social media Friday morning to share their thoughts on the inauguration, and in some cases, suggested alternative viewing.\n\nTrump, who has not been particularly popular among the celebrity circuit, inspired a #Brownout from George Lopez. The comedian began the movement on Twitter in protest of Trump not appointing a Latino to his cabinet, which every president has done since 1988. Lopez encouraged his followers to change their avatar to a brown square in support.\n\nTomorrow I'm going on a #Brownout in protest of @realDonaldTrump not having a Latino appointed to his cabinet , first time since 1988 pic.twitter.com/woEyaBjkoh — George Lopez (@georgelopez) January 20, 2017\n\nIn urge Latinos and people who support us to joint me and #Brownout on your Avatar #chingon pic.twitter.com/J7NHfjKlFl — George Lopez (@georgelopez) January 20, 2017\n\nChrissy Teigen, who has previously criticized Trump on Twitter, commented on the prayer portion of the inauguration. “What a beautiful prayer. makes me wanna grab my p—,” she tweeted, alluding to Trump’s infamous comment in his and Billy Bush’s leaked tape.\n\nwhat a beautiful prayer. makes me wanna grab my puss — christine teigen (@chrissyteigen) January 20, 2017\n\nTeigen soon commented on the attention her prayer tweet was receiving. “Oh. it’s offensive when I say it though. hm,” she wrote.\n\noh. it's offensive when I say it though. hm. — christine teigen (@chrissyteigen) January 20, 2017\n\nMeanwhile, Shonda Rhimes praised Hillary Clinton and retweeted a list with 45 things to do other than watch the inauguration.\n\nMaturity, grace and oh boy, is she going high when they went low. https://t.co/kyqsVPlb22 — shonda rhimes (@shondarhimes) January 20, 2017\n\nKaty Perry, who was very vocal in her support of Clinton during the campaign, told her her 95 million Twitter followers that she’d be sleeping in instead of watching Trump’s inauguration. She also made note that she’d be attending Saturday’s Women’s March on Washington, alongside other celebrities like Chelsea Handler, Cher, and America Ferrera.\n\nsleeping in — KATY PERRY (@katyperry) January 20, 2017\n\nPatton Oswalt also offered up several suggestions via Facebook on Thursday as to what to do or watch instead of the inauguration, which included watching National Geographic, powering down your phone, and going to see an indie film.\n\nSee below for more stars addressing the inauguration on social media.\n\nIt is the first responsibility of EVERY citizen to question authority-Benjamin Franklin 🇺🇸✊🏼❤️.… https://t.co/2nqaKjULez — Christie Brinkley (@SeaBrinkley) January 20, 2017\n\nIn these times, unite in kindness, deeper understanding, compassion, love, and knowledge. Make sure the truth keeps its meaning. — Ellie Goulding (@elliegoulding) January 20, 2017\n\nOnce or twice in every generation a line is crossed so egregiously that where you stood on the issue will forever define you. -Kara Vallow — Chelsea Handler (@chelseahandler) January 20, 2017\n\nStop telling me to \"get over it\". Get UNDER it. He works for US. The democratic process is constant. Stay informed, stay engaged, speak up. — olivia wilde (@oliviawilde) January 20, 2017\n\nYou guys…why did my email count turn to this number this minute right as he is being sworn in?!?! pic.twitter.com/4oBVoCBdKv — Audra McDonald (@AudraEqualityMc) January 20, 2017\n\nThe last 2 inaugurations were very crowded. This one is so… roomy — John Legend (@johnlegend) January 20, 2017\n\nI made a appointment at the DMV this morning. That's where I'll be. The DMV. 🇺🇸 #AlreadyGreat — Elizabeth Banks (@ElizabethBanks) January 20, 2017\n\nOn the @lennyletter bus! A woman just asked if we were relatives. No, we are riot grrrls (both start with R, I get the confusion) pic.twitter.com/XnJbFse0qp — 💎 Lena Dunham 💎 (@lenadunham) January 20, 2017\n\nRT if you feel super chill in yr pussy hat — 💎 Lena Dunham 💎 (@lenadunham) January 20, 2017\n\nTrump’s inauguration will be protested in all 50 states and 32 countries, making this the highest attended 3 Door Down concert to date. — Chelsea Handler (@chelseahandler) January 18, 2017\n\nIn exchange for El Chapo, we would like to hand over Donald Trump. #Freetrade. #Inauguration — Chelsea Handler (@chelseahandler) January 20, 2017\n\nAn Alternate Inaugural Address: My reading of Langston Hughes' \"Let America Be America Again\" (1935) on Trump's Day https://t.co/A2kc4JVsF2 — Michael Moore (@MMFlint) January 20, 2017\n\nI'm trying to be a respectful diligent American rt now but as I start to watch this inauguration- Regression is the word that comes to mind. — Zoe Saldana (@zoesaldana) January 20, 2017\n\nFor the first time I will not be watching or listening to anything \"inauguration.\" — Judy Blume (@judyblume) January 20, 2017\n\nI'm boycotting my TV not even watching for the inauguration for the 1st time in my life! https://t.co/pc64Tsb6lJ — John Leguizamo (@JohnLeguizamo) January 19, 2017\n\nAll of the jokes/parody/comedy aside,\n\nlet's stop for a moment to take a full account of where we are. This country is lost. It's in trouble. — ABFoundation (@ABFalecbaldwin) January 20, 2017\n\n.@realDonaldTrump Americans are all colors, faiths, cultures & genders. We have voices. We refuse fear. We believe in the Dream. #WeAreHere — Alicia Keys (@aliciakeys) January 20, 2017\n\nThis feels like OUR Suffragette moment. Except this time it's not for the vote, it's for our collective lives. Queens, march with me x T 🙏🏾 — Thandie Newton (@thandienewton) January 20, 2017\n\n\"He took the hide off of everybody sitting on that platform.\" @bobschieffer on Trump #Inauguration address @CBSThisMorning — Norah O'Donnell🇺🇸 (@NorahODonnell) January 20, 2017\n\nNew captain sworn in. Winds of justice will determine the sail of the ship. #Inauguration — Rev Jesse Jackson Sr (@RevJJackson) January 20, 2017\n\nI have never seen my country on an inauguration day so divided, so anxious, so fearful, so uncertain of its course. https://t.co/fkojvuc1er — Dan Rather (@DanRather) January 20, 2017\n\nI agree with everything he's saying and nothing he's doing. One nation under Goldman Sachs. — Sarah Silverman (@SarahKSilverman) January 20, 2017\n\nI'd like to thank Ivanka's screaming infant for being the only voice of reason coming from Washington today. #Inauguration — Randy Rainbow (@RandyRainbow) January 20, 2017\n\nNoticed you had to use an old Obama inauguration photo for your banner, so we fixed it for you. pic.twitter.com/qTkPCuGUY9 — Full Frontal (@FullFrontalSamB) January 20, 2017\n\nMidnight in America. But the sun always rises. — Anne Rice (@AnneRiceAuthor) January 20, 2017\n\ncan't think of a more fitting way to ring in this day #bye pic.twitter.com/Z9iM4YEZQP — Sherri Saum (@SherriSaum1) January 20, 2017\n\nIf it's 'America First'…then don't knock 20 million Americans off of Health Insurance. — Jerry Springer (@jerryspringer) January 20, 2017\n\nEvery Black American should work to remove the religious concept of \"Apocalypse\" from the mind. It subtly reinforces short term thinking. — DROGASLight Out Now! (@LupeFiasco) January 20, 2017\n\nCongratulations to President Donald Trump! Wonderful speech! I'm so grateful and proud to finally have a president for the People! — Steven Seagal (@sseagalofficial) January 20, 2017\n\nIn these times, unite in kindness, deeper understanding, compassion, love, and knowledge. Make sure the truth keeps its meaning. — Ellie Goulding (@elliegoulding) January 20, 2017", "images": ["https://ewedit.files.wordpress.com/2017/01/inauguration.jpg?crop=0px%2C0px%2C1800px%2C1350px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768"], "top_img": "https://ewedit.files.wordpress.com/2017/01/inauguration.jpg?crop=0px%2C0px%2C1800px%2C1350px&resize=1200%2C630", "keywords": [], "authors": ["Rachel Desantis"], "canonical_link": "https://ew.com/news/2017/01/20/trump-inauguration-celebrity-reactions/", "title": "Celebrities react to Trump inauguration on Twitter", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Inauguration 2017, Donald Trump, Katy Perry, Shonda Rhimes, George Lopez, Hillary Clinton", "news_keywords": "Inauguration 2017, Donald Trump, Katy Perry, Shonda Rhimes, George Lopez, Hillary Clinton", "description": "Katy Perry, Shonda Rhimes, and George Lopez are among the stars tweeting about Donald Trump's inauguration.", "og": {"title": "Celebrities React to Trump Inauguration on Twitter", "type": "article", "site_name": "EW.com", "url": "https://ew.com/news/2017/01/20/trump-inauguration-celebrity-reactions/", "description": "Donald Trump will be sworn in as the 45th president of the United States on Friday, but not everyone will…", "image": {"identifier": "https://ewedit.files.wordpress.com/2017/01/inauguration.jpg?crop=0px%2C0px%2C1800px%2C1350px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/news/2017/01/20/trump-inauguration-celebrity-reactions/", "description": "Katy Perry, Shonda Rhimes, and George Lopez are among the stars tweeting about Donald Trump's inauguration.", "media": "https://ewedit.files.wordpress.com/2017/01/inauguration.jpg?crop=0px%2C0px%2C1800px%2C1350px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/news/2017/01/20/trump-inauguration-celebrity-reactions/", "title": "Celebrities React to Trump Inauguration on Twitter", "description": "Katy Perry, Shonda Rhimes, and George Lopez are among the stars tweeting about Donald Trump's inauguration.", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2017/01/inauguration.jpg?crop=0px%2C0px%2C1800px%2C1350px&resize=1200%2C630"}, "fb": {"pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1484888400.0, "source": "http://ew.com", "summary": ""}