{"url": "https://web.archive.org/web/20180501124531/http://www.patriotnetwork.one:80/2018/04/27/breaking-czech-republic-arms-citizens-you-can-now-shoot-terrorists-on-sight", "text": "WITH THE EUROPEAN MIGRANT CRISIS GROWING WORSE EVERY SINGLE DAY, MANY DOUBT THAT EUROPE WILL BE ABLE TO SURVIVE ITS SELF-INFLICTED IMMIGRATION WOUNDS.\n\nSome Islamic leaders have even stated that Europe will be ruled under a caliphate within the next 2 generations. While many politicians are as spineless and weak as can be, such as Merkel, Macron, and London’s Mayor, some are standing up to the atrocity that is Islamic Extremism.\n\nIn an incredible turn of events, 139 out of 168 deputies voted in favor of an amendment which would allow citizens to carry guns and shoot terrorists on sight. “We do not want to disarm our own people at a time when the security situation is deteriorating,” Interior Minister Milan Chovanec said on Wednesday.\n\nSputnik News, a news agency centered in Moscow, reports:\n\n“The new law states that Czech citizens have the right to acquire, keep and bear arms in order to ensure the security of the state.”\n\n“It means that the approximately 360,000 licensed gun-owners in the Czech Republic are allowed to carry their weapons in public and use them in case of a public order emergency, such as terrorism.”\n\nMillions of patriotic men and women are PROUD to stand with the Czech Republic, fearing that if we don’t take action, Islam will soon overtake our nation. Some of the more pathetic and pandering individuals, however, have criticized the new law.\n\n\n\nThe Guardian compares the law to Hitler:\n\n“There is little to smile about, however, when Zeman sets out what he sees as the threat being posed by radical Islamists – and even “moderate” Muslims, who he says could be radicalised to commit terror attacks as ordinary Germans were once inspired to fanatically back Hitler.”\n\nYes, that’s right—because apparently Leftists think that protecting your nation from a cult of death, that rapes women, stones gays, and beheads thieves, is somehow “intolerant.” Well do you know what most Americans think?\n\nYou’re damn right it’s intolerant! Why the HELL should we be tolerant of a barbaric religion that wants to take us back to the 500’s AD? We shouldn’t! We value freedom and family, and we WILL NOT have our country overrun by Islam.\n\nThankfully, despite the overwhelming Leftist propaganda claiming that the law is “unfair,” and “discriminates,” against Muslims, conservatives all across the world have had their morale boosted.\n\nDespite what liberals may say about gun safety issues, The Czech Republic is actually one of the safest nations out there—6th safest in the world, to be exact.\n\n“Although Western European countries such as France, Belgium, Germany and the UK have suffered several terrorist attacks in recent years, the Czech Republic has not seen any attacks. The Global Peace Index 2016 ranked the country the sixth safest in the world.”\n\nAfter the past decade of liberal policies, pandering to immigrants, and welcoming terrorists into our country with open arms, many are proud to see that Europe is beginning to stand up for itself. Hope may not be lost, after all.\n\nWith the massive movement of grass-roots nationalism growing, from Nigel Farage and Brexit, to Donald Trump, to various countries exiting the EU and valuing their OWN citizens and heritage over others, it seems that Western Civilization has a fighting chance of surviving.", "images": ["https://web.archive.org/web/20180501124531im_/http://www.patriotnetwork.one/wp-content/uploads/2018/04/9-678x381.jpg", "https://web.archive.org/web/20180501124531im_/http://www.patriotnetwork.one/wp-content/uploads/2018/04/12-80x60.png", "https://web.archive.org/web/20180501124531im_/http://www.patriotnetwork.one/wp-content/uploads/2018/04/10-80x60.jpg", "https://web.archive.org/web/20180501124531im_/http://www.patriotnetwork.one/wp-content/uploads/2018/04/13-300x278.png"], "top_img": "https://web.archive.org/web/20180501124531im_/http://www.patriotnetwork.one/wp-content/uploads/2018/04/13-300x278.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180501124531/http://www.patriotnetwork.one/2018/04/27/breaking-czech-republic-arms-citizens-you-can-now-shoot-terrorists-on-sight/", "title": "BREAKING: CZECH REPUBLIC ARMS CITIZENS – “YOU CAN NOW SHOOT TERRORISTS ON SIGHT” – US PATRIOTS", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 4.9.5"}, "movies": [], "publish_date": 1524801600.0, "source": "https://web.archive.org", "summary": ""}