{"url": "www.vanityfair.com/news/2010/12/william-and-kate-201012", "text": "A number of things had caused her to question William’s commitment, although she had not raised them with him yet. One was William’s friendship with an American heiress named Anna Sloan, whom he had met through mutual friends at Edinburgh University, where Anna was studying. Anna had lost her father, businessman George Sloan, in a tragic shooting accident on the family’s 360-acre estate in Nashville, and she and William had bonded over the loss of their parents. When William accepted an invitation from Anna to accompany her and a group of friends to Tennessee for a holiday before he went to Greece, it hurt Kate deeply. She suspected William might have feelings for the 22-year-old heiress. However, according to her friends, Anna was not romantically interested in William, and the friendship was never anything more than just that.\n\nAnd then there was William’s budding relationship with another stunning heiress, Isabella Anstruther-Gough-Calthorpe. While Kate was girl-next-door pretty, Isabella had cover-girl looks, a title, and a stately pile to boot. That summer William visited the Anstruther-Gough-Calthorpe family home in Chelsea to see her. Isabella, daughter of banking heiress Lady Mary Gaye Curzon, was single at the time. Sadly for William, she had no aspirations to date him and despite his amorous advances declared that she was not interested.\n\nMeanwhile, Kate had accepted an invitation to spend a fortnight in France at Fergus Boyd’s family holiday home in the Dordogne with some friends from St. Andrews. Among the group were Kate’s friends Olivia Bleasdale and Ginny Fraser. She had not told them about the trial separation, but from her downcast mood her friends guessed, and one evening she confided to them that she and William were taking a break. “She got quite drunk on white wine and really let her guard down,” recalled one of the group. “She was debating whether or not she should text or call him. She said how sad she was and how much she was missing William, but she never mentioned it after that.”\n\nBy November they were back at St. Andrews, although they had yet to reconcile their differences. I had reported the news of their separation that summer, and tellingly there was no denial from Clarence House. Privately, William again complained to friends that he was feeling claustrophobic and already thinking ahead to the summer after graduation, when he was planning to return to Kenya to see Jecca Craig, another fly in the ointment as far as Kate was concerned. “The last thing William wants is a high-profile split in the crucial months leading up to his finals,” I was told at the time by a source close to William. On the advice of her mother, Kate gave William some breathing space. It was made all the harder because they were living together, but instead of spending weekends in St. Andrews or traveling to Balmoral, Kate would return home to be with her parents.\n\nIt was obviously the break that William needed, and by Christmas they were back together again, although Kate had a condition. Word had reached her of William’s visits to Isabella, and Kate insisted that William was not to contact her again. With their finals looming in May, they agreed to take things slowly. Kate had stayed away from Edward van Cutsem’s wedding to the Duke of Westminster’s daughter Lady Tamara Grosvenor that November, but she happily accepted an invitation to Prince Charles’s 56th-birthday party at Highgrove later that month. The following March, Prince Charles invited her to Klosters for his pre-wedding holiday. Charles and Camilla Parker Bowles were to be married on April 9, 2005, and the Prince wanted one last skiing holiday with his sons first. It had really been intended as a boys-only trip, but Kate was not left out. She was photographed taking a gondola up the slopes with Charles and enjoying lunch with the princes and their friends. William was a witness at the civil ceremony, together with Camilla’s son, Tom, and had the added responsibility of looking after the wedding rings. But since she and William were not yet engaged, Kate was not invited to the intimate family wedding itself.\n\nPomp and Circumstance\n\nCamilla was now part of the family, and when William graduated on June 23, 2005, she was there along with Charles, the Duke of Edinburgh, and the Queen. William and Kate had dreaded and looked forward to the day in equal measure. They had enjoyed one last party before their finals and, in keeping with tradition, attended the annual May Ball. Uncharacteristically, Kate drank so much that Fergus Boyd had to carry her out before the night ended. Now, as William and Kate walked into Younger Hall, they exchanged a smile and took their seats. The Queen smiled broadly as William knelt before the chancellor’s wooden pulpit to collect his parchment. Minutes later Kate was called to the stage as Catherine Middleton. When it came to the end of the ceremony, the words of vice-chancellor Dr. Brian Lang must have seemed particularly poignant. “You will have made lifelong friends,” he told the graduates. “You may have met your husband or wife. Our title as the top matchmaking university in Britain signifies so much that is good about St. Andrews so we rely on you to go forth and multiply.”", "images": ["http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.b6748104d0d362745b508aebea5a86c913809200.svg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_2560%2Cc_limit/image.jpg"], "top_img": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Condé Nast", "Katie Nichol"], "canonical_link": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012", "title": "Wills and the Real Girl", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2019", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "id": "54cc225a0a5930502f5fb97b", "keywords": "Royals,magazine,archive,kate middleton,prince william,society,royal watch,royals", "robots": "index, follow", "content-type": "article", "parsely-post-id": "54cc225a0a5930502f5fb97b", "parsely-metadata": "{\"description\":\"Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Wills and the Real Girl", "type": "article", "url": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012"}, "article": {"content_tier": "metered", "opinion": "false"}, "twitter": {"card": "summary_large_image", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "domain": "https://www.vanityfair.com", "image": {"src": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet"}, "site": "@VanityFair", "title": "Wills and the Real Girl"}, "fb": {"app_id": 305927716147259, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": null, "source": "http://www.vanityfair.com", "summary": ""}