{"url": "people.com/tv/lena-dunham-affectionate-new-guy/", "text": "Lena Dunham may be moving on from her ex-boyfriend Jack Antonoff with a new man.\n\nThe 31-year-old Girls creator was photographed with an unidentified companion in West Hollywood on Saturday night, wrapping her arm around him after they had sushi for dinner and headed to a nearby marijuana dispensary. In one shot, the mystery guy affectionately kisses Dunham on her head.\n\nImage zoom Lena Dunham and a mystery man MEGA\n\nHer rep did not immediately return PEOPLE’s request for comment.\n\nPEOPLE confirmed in January that Dunham and Antonoff, 33, had split after dating for five years.\n\nDunham revealed in the March issue of Vogue that she underwent a total hysterectomy last year. She discussed the procedure and the outpouring of “overwhelming” and “heartening” support that she’s received from fans in an emotional Instagram post, aligning the experience to her breakup.\n\nWant to keep up on the latest from PEOPLE? Sign\n\nup for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\n“I have a broken heart and I hear those don’t mend overnight,” she wrote. “But we are linked forever by this experience and our refusal to let it hold any of us back from even the grandest dreams.”\n\nImage zoom Lena Dunham and Jack Antonoff Jeff Kravitz/FilmMagic\n\nIn her Vogue piece, Dunham chronicled the hysterectomy process from start to finish, explaining that she made the decision in the hopes of ending her crippling endometriosis-related pain. After “desperately” trying to manage a “new level of pain” from August to November, Dunham said she finally checked herself into the hospital and refused to leave “until they stop this pain or take my uterus.”\n\nDunham said the situation wasn’t easy on the former couple.\n\n“My beautiful partner, who has seen me through so much pain with compassion and care, has to be away for work, and I can feel us growing slowly apart, since life is so determined to display its full complexity right now,” she wrote in Vogue. “I am surly and distant. I offer nothing.”\n\n“He reminds me again and again that I am still a woman and still alive,” she continued. “But I also know that soon — for so many reasons that have nothing to do with my uterus — we’ll slip away from each other and I will face everything I am losing in impossibly tiny step.”\n\nRELATED VIDEO: Lena Dunham and Jack Antonoff Split After More Than Five Years Together\n\nDunham and Antonoff met in 2012 after being set up on a blind date by Antonoff’s sister Rachel and comedian Mike Birbiglia.\n\nDays after PEOPLE confirmed Dunham and Antonoff’s split, she briefly addressed the breakup during a livestream on Instagram, saying she was still wearing a ring that Antonoff had given her.\n\n“I’ll always wear it because love is a really cool, powerful, eternal thing,” she said. “It doesn’t have to be defined the way that we, in Western culture, define it as beginnings and ends.”\n\nAntonoff has since been linked to Carlotta Kohl; the Bleachers frontman and model sat courtside at a Knicks game a couple weeks ago.", "images": ["https://peopledotcom.files.wordpress.com/2018/03/lena-dunham2.jpg", "https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/03/lena-dunham2.jpg?crop=0px%2C57px%2C1407px%2C738px&resize=1200%2C630", "https://secure.gravatar.com/avatar/59d6486f5205aabdbf65fd1a39fa97ee?s=300&d=blank&r=g", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/07/11375342_417123731803445_2077871559_n-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/01/lena-dunham-jack-antonoff.jpg", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2018/03/lena-dunham2.jpg?crop=0px%2C57px%2C1407px%2C738px&resize=1200%2C630", "keywords": [], "authors": ["Dave Quinn", "Michele Corriston"], "canonical_link": "https://people.com/tv/lena-dunham-affectionate-new-guy/", "title": "Lena Dunham Gets Affectionate with a New Guy 3 Months After Jack Antonoff Breakup", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Lena Dunham, Jack Antonoff, Lena Dunham new boyfriend, Lena Dunham Jack Antonoff, Lena Dunham Jack Antonoff split, Lena Dunham Jack Antonoff breakup, Lena Dunham Jack Antonoff new relationships, Lena Dunham Jack Antonoff friends", "news_keywords": "Lena Dunham, Jack Antonoff, Lena Dunham new boyfriend, Lena Dunham Jack Antonoff, Lena Dunham Jack Antonoff split, Lena Dunham Jack Antonoff breakup, Lena Dunham Jack Antonoff new relationships, Lena Dunham Jack Antonoff friends", "description": "Lena Dunham may be moving on from her ex-boyfriend Jack Antonoff with a new man", "og": {"title": "Lena Dunham Gets Affectionate with a New Guy 3 Months After Jack Antonoff Breakup", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/lena-dunham-affectionate-new-guy/", "description": "Lena Dunham is moving on from her ex-boyfriend Jack Antonoff with a new man", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2018/03/lena-dunham2.jpg?crop=0px%2C57px%2C1407px%2C738px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/tv/lena-dunham-affectionate-new-guy/", "description": "Lena Dunham may be moving on from her ex-boyfriend Jack Antonoff with a new man", "media": "https://peopledotcom.files.wordpress.com/2018/03/lena-dunham2.jpg?crop=0px%2C57px%2C1407px%2C738px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/lena-dunham-affectionate-new-guy/", "title": "Lena Dunham Gets Affectionate with a New Guy 3 Months After Jack Antonoff Breakup", "description": "Lena Dunham may be moving on from her ex-boyfriend Jack Antonoff with a new man", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2018/03/lena-dunham2.jpg?crop=0px%2C57px%2C1407px%2C738px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}