{"url": "https://web.archive.org/web/20180524233845/http://usbreakingnews.net:80/bombshell-obama-paid-fbi-informant-over-1-million-to-do-it-to-trump-even-after-the-election", "text": "Just mere hours ago, General Michael Flynn’s son, Michael Flynn Jr., sent out a very odd tweet which some say may be in reference to the payments that have been traced from the corrupt Barack Hussein Obama regime to the now notorious FBI informant, Stephan Halper.\n\nThe tweet reads warning: You’re all going down. You know who you are. Mark my word….\n\nYou’re all going down. You know who you are. Mark my word…. — 🇺🇸MFLYNNJR🇺🇸 (@mflynnJR) May 21, 2018\n\nt’s now being reported that less than a week after Stefan Halper was confirmed to be an informant for the FBI who was the one who infiltrated the Trump campaign back in 2016, there is now alleged confirmation that the 73-year-old Oxford University professor and former U.S. government official was paid handsomely by the Obama administration starting in 2012 for various research projects.\n\nHalper, who is said to be a longtime CIA and FBI asset, once even reportedly ran a spy-operation on the Jimmy Carter administration during the late 70’s, was recruited by the FBI to spy on several Trump campaign aides during the 2016 U.S. election.\n\nBut here is the kicker. An astringent search of public records is now revealing that between 2012 and 2018, Halper received a total of $1,058,161 from the Department of Defense. Why would anyone receive that kind of money from the DOJ? Especially someone like Halper?\n\nStefan Halper was the same person who invited George Papadopolous to London, where he just so happened to sit down next to that infamous Australian “Diplomat” (who also worked with the Clinton Foundation) — Jacob Wohl (@JacobAWohl) May 11, 2018\n\nIn essence, Stefan Halper was the bag-man who enabled Brennan and Clapper to carry out the spying against the Trump Campaign at Obama’s request — Jacob Wohl (@JacobAWohl) May 11, 2018\n\nInterestingly enough, the most recent payment to Halper for $411,575 was made in two different installments which had a start date of September 26, 2016, only three days after a September 23 news article by Michael Isikoff was published about Trump aide Carter Page. The article used information fed to Isikoff by the fake Russian dossier creator Christopher Steele. It was later confirmed that the FBI used that article, along with the unverified Russian dossier as supporting evidence in a FISA warrant application for Page.\n\nVia 100% Fed Up:\n\n“According to the Website USASPENDING.gov, the payments to Halper are for “RESEARCH AND DEVELOPMENT IN THE SOCIAL SCIENCES AND HUMANITIES (2012),” “RESEARCH AND STUDIES – THE YEAR 2030, (2014)”, “RUSSIA-CHINA RELATIONSHIP STUDY. (2015),” and “INDIA AND CHINA ECON STUDY (2016).”\n\nHalper’s most recent award was noted recently by Trump supporter Jacob Wohl, which piqued the interest of internet researchers who continued the analysis.”\n\nStefan Halper was the same person who invited George Papadopolous to London, where he just so happened to sit down next to that infamous Australian “Diplomat” (who also worked with the Clinton Foundation) — Jacob Wohl (@JacobAWohl) May 11, 2018\n\n“Wohl calls Stefan Halper the “bag man” who enabled Brennan and Clapper to carry out the spying against the Trump Campaign at Obama’s request:”\n\nIn essence, Stefan Halper was the bag-man who enabled Brennan and Clapper to carry out the spying against the Trump Campaign at Obama’s request — Jacob Wohl (@JacobAWohl) May 11, 2018\n\n“The second installment of Halper’s 2016 DoD contract is dated July 26, 2017 in the amount of $129,280 – around three months before the FISA warrant on Carter Page was set to expire following repeated renewals signed by Deputy AG Rod Rosenstein and a federal judge.\n\nOn July 28, he emailed Page with what the Trump campaign aide describes as a “cordial” communication, which did not seem suspicious to him at the time.\n\nIn the email to Page, Halper asks what his plans are post-election, possibly probing for more information. “It seems attention has shifted a bit from the ‘collusion’ investigation to the ‘ contretempts’ [sic] within the White House and, how–or if–Mr. Scaramucci will be accommodated there,” Halper wrote.”\n\nHow much time has the MSM spent talking about the massive cash payments sent to Stefan Halper to spy on our President? ZERO.\n\n— Jacob Wohl (@JacobAWohl) May 21, 2018\n\nHalper approached Page during an election-themed conference at Cambridge on July 11, 2016, six weeks before the September 26 Department of Justice payment start date. They would remain in contact for the next 14 months where they frequently met and exchanged emails.\n\nHere is the infamous article via Yahoo News:\n\n“U.S. intelligence officials are seeking to determine whether an American businessman identified by Donald Trump as one of his foreign policy advisers has opened up private communications with senior Russian officials — including talks about the possible lifting of economic sanctions if the Republican nominee becomes president, according to multiple sources who have been briefed on the issue.\n\nThe activities of Trump adviser Carter Page, who has extensive business interests in Russia, have been discussed with senior members of Congress during recent briefings about suspected efforts by Moscow to influence the presidential election, the sources said. After one of those briefings, Senate minority leader Harry Reid wrote FBI Director James Comey, citing reports of meetings between a Trump adviser (a reference to Page) and “high ranking sanctioned individuals” in Moscow over the summer as evidence of “significant and disturbing ties” between the Trump campaign and the Kremlin that needed to be investigated by the bureau.\n\nSome of those briefed were “taken aback” when they learned about Page’s contacts in Moscow, viewing them as a possible back channel to the Russians that could undercut U.S. foreign policy, said a congressional source familiar with the briefings but who asked for anonymity due to the sensitivity of the subject. The source added that U.S. officials in the briefings indicated that intelligence reports about the adviser’s talks with senior Russian officials close to President Vladimir Putin were being “actively monitored and investigated.”\n\nA senior U.S. law enforcement official did not dispute that characterization when asked for comment by Yahoo News. “It’s on our radar screen,” said the official about Page’s contacts with Russian officials. “It’s being looked at.”\n\nPage is a former Merrill Lynch investment banker in Moscow who now runs a New York consulting firm, Global Energy Capital, located around the corner from Trump Tower, that specializes in oil and gas deals in Russia and other Central Asian countries. He declined repeated requests to comment for this story.\n\nTrump first mentioned Page’s name when asked to identify his “foreign policy team” during an interview with the Washington Post editorial team last March. Describing him then only as a “PhD,” Trump named Page as among five advisers “that we are dealing with.” But his precise role in the campaign remains unclear; Trump spokeswoman Hope Hicks last month called him an “informal foreign adviser” who “does not speak for Mr. Trump or the campaign.” Asked this week by Yahoo News, Trump campaign spokesman Jason Miller said Page “has no role” and added: “We are not aware of any of his activities, past or present.” Miller did not respond when asked why Trump had previously described Page as one of his advisers.\n\nThe questions about Page come amid mounting concerns within the U.S. intelligence community about Russian cyberattacks on the Democratic National Committee and state election databases in Arizona and Illinois. In a rare public talk this week, former undersecretary of defense for intelligence Mike Vickers said that the Russian cyberattacks constituted meddling in the U.S. election and were “beyond the pale.” Also, this week, two senior Democrats — Sen. Dianne Feinstein, ranking minority member on the Senate Intelligence Committee, and Rep. Adam Schiff, ranking minority member on the House Intelligence Committee — released a joint statement that went further then what U.S. officials had publicly said about the matter.\n\n“Based on briefings we have received, we have concluded that the Russian intelligence agencies are making a serious and concerted effort to influence the U.S. election,” they said. “At the least, this effort is intended to sow doubt about the security of our election and may well be intended to influence the outcomes of the election.” They added that “orders for the Russian intelligence agencies to conduct such actions could come only from very senior levels of the Russian government.”\n\nPage came to the attention of officials at the U.S. Embassy in Moscow several years ago when he showed up in the Russian capital during several business trips and made provocative public comments critical of U.S. policy and sympathetic to Putin. “He was pretty much a brazen apologist for anything Moscow did,” said one U.S. official who served in Russia at the time.\n\nHe hasn’t been shy about expressing those views in the U.S. as well. Last March, shorty after he was named by Trump as one of his advisers, Page told Bloomberg News he had been an adviser to, and investor in, Gazprom, the Russian state-owned gas company. He then blamed Obama administration sanctions — imposed as a response to the Russian annexation of Crimea — for driving down the company’s stock. “So many people who I know and have worked with have been so adversely affected by the sanctions policy,” Page said in the interview. “There’s a lot of excitement in terms of the possibilities for creating a better situation.”\n\nPage showed up again in Moscow in early July, just two weeks before the Republican National Convention formally nominated Trump for president, and once again criticized U.S. policy. Speaking at a commencement address for the New Economic School, an institution funded in part by major Russian oligarchs close to Putin, Page asserted that “Washington and other West capitals” had impeded progress in Russia “through their often hypocritical focus on ideas such as democratization, inequality, corruption and regime change.”\n\nAt the time, Page declined to say whether he was meeting with Russian officials during his trip, according to a Reuters report.\n\nBut U.S. officials have since received intelligence reports that during that same three-day trip, Page met with Igor Sechin, a longtime Putin associate and former Russian deputy prime minister who is now the executive chairman of Rosneft, Russian’s leading oil company, a well-placed Western intelligence source tells Yahoo News. That meeting, if confirmed, is viewed as especially problematic by U.S. officials because the Treasury Department in August 2014 named Sechin to a list of Russian officials and businessmen sanctioned over Russia’s “illegitimate and unlawful actions in the Ukraine.” (The Treasury announcement described Sechin as “utterly loyal to Vladimir Putin — a key component to his current standing.” At their alleged meeting, Sechin raised the issue of the lifting of sanctions with Page, the Western intelligence source said.\n\nU.S. intelligence agencies have also received reports that Page met with another top Putin aide while in Moscow — Igor Diveykin. A former Russian security official, Diveykin now serves as deputy chief for internal policy and is believed by U.S. officials to have responsibility for intelligence collected by Russian agencies about the U.S. election, the Western intelligence source said.”\n\nH/T 100Percent FedUp\n\nRelated", "images": ["https://web.archive.org/web/20180524233845im_/https://i0.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180524-230523.png?resize=55%2C55", "https://web.archive.org/web/20180524233845im_/https://i1.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/ice_screenshot_20180403-235938.png?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i0.wp.com/rwnofficial.com/wp-content/uploads/2018/05/ward-payments.jpg?resize=890%2C294&ssl=1", "https://web.archive.org/web/20180524233845im_/https://i1.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/Muslim-4-750x445.jpg?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i1.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180524-225242.png?resize=55%2C55", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/rwnofficial.com/wp-content/uploads/2018/05/ward-payments-2.jpg?resize=740%2C134&ssl=1", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/ice_screenshot_20180419-221827.png?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i1.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/1-1.jpg?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/http://usbreakingnews.net/wp-content/uploads/2018/04/the-logo.jpg", "https://web.archive.org/web/20180524233845im_/https://i0.wp.com/rwnofficial.com/wp-content/uploads/2018/05/ward-email-carter-page-1.jpg?resize=740%2C695&ssl=1", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180522-233034.png?resize=700%2C367", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/Dgqm81523898755.png?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180523-151547.png?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180522-233034.png?fit=700%2C367", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180524-230103.png?resize=55%2C55", "https://web.archive.org/web/20180524233845im_/https://i0.wp.com/rwnofficial.com/wp-content/uploads/2018/05/ward-payments-3.jpg?resize=938%2C170&ssl=1", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/comey1.jpg?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i1.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/JluDR1524000054.png?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/http://usbreakingnews.net/wp-content/plugins/itro-popup/images/close-icon.png", "https://web.archive.org/web/20180524233845im_/https://i0.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/eric-bower-mayor-of-bloomsburg-pa-facebook-640x480-640x381.jpg?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/egdnp1524083395.png?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i1.wp.com/usbreakingnews.net/wp-content/uploads/2018/04/HKLwM1523309293.png?resize=300%2C165", "https://web.archive.org/web/20180524233845im_/https://i1.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180524-225615.png?resize=55%2C55", "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180524-230103.png?resize=300%2C165"], "top_img": "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180522-233034.png?fit=700%2C367", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180524233845/http://usbreakingnews.net/bombshell-obama-paid-fbi-informant-over-1-million-to-do-it-to-trump-even-after-the-election/", "title": "BOMBSHELL!! Obama Paid FBI Informant Over $1 MILLION To Do It To Trump! EVEN AFTER THE ELECTION!", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no, minimal-ui", "og": {"locale": "en_US", "type": "article", "title": "BOMBSHELL!! Obama Paid FBI Informant Over $1 MILLION To Do It To Trump! EVEN AFTER THE ELECTION! - US Breaking News", "description": "Just mere hours ago, General Michael Flynn’s son, Michael Flynn Jr., sent out a very odd tweet which some say may be in reference to the payments that have been traced from the corrupt Barack Hussein Obama regime to the now notorious FBI informant, Stephan Halper. The tweet reads warning: You’re all going down. You …", "url": "https://web.archive.org/web/20180524233845/http://usbreakingnews.net/bombshell-obama-paid-fbi-informant-over-1-million-to-do-it-to-trump-even-after-the-election/", "site_name": "US Breaking News", "updated_time": "2018-05-22T21:31:17+00:00", "image": {"identifier": "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180522-233034.png?fit=700%2C367", "secure_url": "https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180522-233034.png?fit=700%2C367", "width": 700, "height": 367}}, "article": {"publisher": "https://www.facebook.com/magazine20/?ref=bookmarks", "section": "NEWS", "published_time": "2018-05-22T21:30:01+00:00", "modified_time": "2018-05-22T21:31:17+00:00"}, "twitter": {"card": "summary_large_image", "description": "Just mere hours ago, General Michael Flynn’s son, Michael Flynn Jr., sent out a very odd tweet which some say may be in reference to the payments that have been traced from the corrupt Barack Hussein Obama regime to the now notorious FBI informant, Stephan Halper. The tweet reads warning: You’re all going down. You […]", "title": "BOMBSHELL!! Obama Paid FBI Informant Over $1 MILLION To Do It To Trump! EVEN AFTER THE ELECTION! - US Breaking News", "image": "https://web.archive.org/web/20180524233845im_/https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180522-233034.png?fit=700%2C367"}, "generator": "WordPress 4.9.6", "ca_title": "BOMBSHELL!! Obama Paid FBI Informant Over $1 MILLION To Do It To Trump! EVEN AFTER THE ELECTION!", "ca_image": "https://i2.wp.com/usbreakingnews.net/wp-content/uploads/2018/05/ice_screenshot_20180522-233034.png?resize=150%2C150"}, "movies": [], "publish_date": 1527024601.0, "source": "https://web.archive.org", "summary": ""}