{"url": "http://triblive.com/politics/politicalheadlines/8147758-74/bush-terrorism-florida#axzz3XO3B7Cm9", "text": "TribLIVE's Daily and Weekly email newsletters deliver the news you want and information you need, right to your inbox.\n\nCOLUMBUS, Ohio — America’s role as a world leader and coalition builder among nations has weakened under President Obama, allowing “Islamic terrorism” to spread, former Florida Gov. Jeb Bush said Tuesday.\n\nBush, a likely contender for the Republican presidential nomination in 2016, warned that “people are fearful for the security of our country,” and “voids are being filled by asymmetric threats that are quite dangerous.”\n\nHe said U.S. leaders should identify the threat for what it is — Islamic terrorism — noting that groups such as ISIS are spreading destruction beyond Iraq and Syria.\n\n“It’s not some isolated thing. It is a threat on Western civilization, and take them at their word — they want to destroy Western civilization,” he told the Tribune-Review in an interview before his speech to the Ohio Chamber of Commerce’s annual meeting.\n\nUnder Obama, Bush said, America’s strategy is “to isolate and not be fully engaged, because of the fatigue Americans legitimately feel about long-term engagements, in the Middle East particularly.”\n\n“One of the first things we have to do is to get back into the game and develop coalitions to take these terrorist groups out,” he said.\n\nTurkey, Egypt, Jordan, Saudi Arabia and Persian Gulf countries “are hugely important” as U.S. allies, Bush said, “with Egypt being perhaps the most important relationship that we have fractured.”\n\nThe United States should make clear that “we are going to be their partner for the long haul and not going to cut-and-run,” he said.\n\nBush has not decided whether to run for the White House, but he would like to have the job, he said.\n\nThe son and brother of presidents, Bush has formed the Right to Rise political action committee to raise money for himself and other GOP candidates. His travels this week — including the stop in Ohio, a state critical to presidential elections since 1960 — give the appearance of a campaign. From here he planned to go to New Orleans, then to Mississippi and New Hampshire.\n\nBush wants to be president because “I think I have the skills” to fix complex problems such as a structural deficit based on a system of entitlement from an earlier era, a hyper-regulatory environment that does little to help businesses, and fears about terrorism that hinder economic security and opportunity.\n\n“We have created one of the most complex, costly, high-tax systems that impales our competitive posture in the world,” he said. “We fix those things, and embrace our energy revolution that is right here in the industrial heartland, and turn our broken immigration system into an economic driver, (and) then we can grow at a far faster rate.”\n\nEven in the sixth year of economic recovery from the Great Recession, the median income for middle-class Americans “is below what it was at the start of the recovery,” Bush said. “That is the legacy that Barack Obama has brought us. He has divided the country. The wealthy are wealthier, the poor are more stuck, and the middle is getting squeezed.”\n\nAn undeclared political campaign has not prevented Bush from hurdling over others in his party — U.S. Sens. Ted Cruz of Texas, Rand Paul of Kentucky and Marco Rubio of Florida have announced — to hit Hillary Clinton, the Democrats’ only declared candidate, straight on.\n\nWhen Clinton formalized her candidacy on Sunday, Bush released an online video, saying: “We must do better than the Obama-Clinton foreign policy that has damaged relationships with our allies and emboldened our enemies.”\n\nRubio, who announced his campaign Monday, “is a great guy,” Bush said. “He is my friend, and you will never hear me say a disparaging thing about him.”\n\nThough Bush and Rubio won’t say it, each probably would prefer the other not run, said Chip Felkel, a South Carolina Republican strategist.\n\n“I’m sure there are a number of people in Florida who feel the same way,” he said.\n\nBush said his leadership PAC is named Right to Rise to signify a person’s ability to achieve, “no matter where we come from, as long as we are willing to work hard.” It is meant to put forth “the hopeful, optimistic, conservative message that I think is the winning one in 2016.”\n\n“We don’t win the ‘angry and against-things’ battle, or being pessimistic about the future,” he said of Republicans running for office. “But we do win if we give people substance and principles to apply, so that we can tear down the barriers to achieve their own success. That should be our mission.”\n\nA Quinnipiac University swing-state poll released in early April showed Bush as the front-runner in a possible 2016 presidential primary in Florida, leading with 24 percent of the vote. Wisconsin Gov. Scott Walker had 15 percent; Rubio, 12 percent.\n\nFelkel said Bush wisely has encouraged Republicans to focus on their accomplishments and not attack each other, as primary candidates did in 2012.\n\n“So far, his approach seems to be working,” Felkel said. The key, he said, would be winning over skeptical voters and separating from the pack.\n\nA RealClearPolitcs aggregate of data from five national polls in March showed Bush with a slight advantage in a field that included Cruz, Paul, Rubio, Walker, Govs. Bobby Jindal of Louisiana and Chris Christie of New Jersey, and former Arkansas Gov. Mike Huckabee, a 2008 presidential candidate.\n\nSalena Zito is a Trib Total Media staff writer. Reach her at [email protected].\n\n\n\n\n\n\n\n\n\n\n\n", "images": ["https://archive.triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/mugshots/default.jpg", "https://archive.triblive.com/wp-content/uploads/2018/11/GOP2016JebBushJPEG08d3d.jpg", "https://archive.triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/total-media.png", "https://archive.triblive.com/wp-content/uploads/2018/11/GOP2016JebBushJPEG0dbca.jpg", "https://archive.triblive.com/wp-content/themes/TribLIVE/assets/visuals/images/icons/head/TribLIVElogo.png", "https://ttm-validate.onecount.net/onecount/oc_track/tracker_nojs.php?_ca=d1a46b1ede4b1aa2d878872edaa4f2210c7f1f01"], "top_img": "https://archive.triblive.com/wp-content/uploads/2018/11/GOP2016JebBushJPEG0dbca.jpg", "keywords": [], "authors": ["Salena Zito"], "canonical_link": "https://archive.triblive.com/news/politics-election/call-islamic-terrorism-what-it-is-a-threat-to-west-jeb-bush-says/", "title": "Call ‘Islamic terrorism’ what it is: a threat to West, Jeb Bush says", "meta_data": {"viewport": "width=device-width", "robots": "FOLLOW", "og": {"locale": "en_US", "type": "website", "site_name": "TribLIVE.com", "title": "Call ‘Islamic terrorism’ what it is: a threat to West, Jeb Bush says", "url": "https://archive.triblive.com/news/politics-election/call-islamic-terrorism-what-it-is-a-threat-to-west-jeb-bush-says/", "image": "https://archive.triblive.com/wp-content/uploads/2018/11/GOP2016JebBushJPEG0dbca.jpg", "description": "COLUMBUS, Ohio — America`s role as a world leader and coalition builder among nations has weakened under President Obama, allowing “Islamic terrorism” to spread, former Florida Gov. Jeb Bush said Tuesday. Bush, a likely contender for the Republican presidential nomination in 2016, warned that “people are fearful for the security", "updated_time": "2015-04-14T23:36:02-04:00"}, "fb": {"app_id": 144410955752326}, "article": {"publisher": "https://www.facebook.com/triblive", "section": "News", "published_time": "2015-04-14T23:36:02-04:00", "modified_time": "2015-04-14T23:36:02-04:00", "mainsection": "News", "subsection": "Politics Election", "category": "News", "subcategory": "Politics Election", "title": "Call ‘Islamic terrorism’ what it is: a threat to West, Jeb Bush says", "author": "Salena Zito", "publishedtoweb": "2015-04-14T23:36:02-04:00"}, "apple-itunes-app": "app-id=328217517", "description": "COLUMBUS, Ohio — America`s role as a world leader and coalition builder among nations has weakened under President Obama, allowing “Islamic terrorism” to spread, former Florida Gov. Jeb Bush said Tuesday. Bush, a likely contender for the Republican presidential nomination in 2016, warned that “people are fearful for the security", "author": "Salena Zito", "pagetype": "story", "custom meta field": "Politics Election", "headline": "Call ‘Islamic terrorism’ what it is: a threat to West, Jeb Bush says", "docauthor": "Salena Zito", "pubdate": "2015-04-14T23:36:02-04:00", "twitter": {"card": "summary_large_image", "image": "https://archive.triblive.com/wp-content/uploads/2018/11/GOP2016JebBushJPEG0dbca.jpg", "site": {"identifier": "@triblive", "id": 20269833}, "creator": "@triblive", "title": "Call ‘Islamic terrorism’ what it is: a threat to West, Jeb Bush says", "description": "COLUMBUS, Ohio — America`s role as a world leader and coalition builder among nations has weakened under President Obama, allowing “Islamic terrorism” to spread, former Florida Gov. Jeb Bush said Tuesday. Bush, a likely contender for the Republican presidential nomination in 2016, warned that “people are fearful for the security", "app": {"name": {"iphone": "TribLIVE News and Sports", "ipad": "TribLIVE News and Sports"}, "id": {"iphone": 328217517, "ipad": 328217517}, "url": {"iphone": "tribbird://", "ipad": "tribbird://"}}}, "msvalidate.01": "C22A6839FDD3668802C5881CD17FC088"}, "movies": [], "publish_date": 1429068962.0, "source": "http://triblive.com", "summary": ""}