{"url": "http://www.youtube.com/user/JohnMcCaindotcom#p/u/2/FKm2JCniKpY", "text": "\"Yesterday, Republican primary voters nominated me for another term in the U.S. Senate. I’m honored by their support. Now, I have the privilege of standing before all the voters of Arizona and appealing for your support in the general election. As always, I consider myself fortunate to be subject to your judgment.\"I never had a hometown growing up. My dad was in the Navy and we moved every couple years. Arizona is the best home I’ve ever had, and serving Arizonans in the Senate is the best job and greatest privilege anyone could ask for. Thank you from the bottom of my heart.\"No matter which side of the presidential election you’re on, whether you’re satisfied or dissatisfied with your choices for president, this election is an important one. Hugely consequential issues are at stake.\"How can we help build a stronger economy? The great promise of America is we can all go as far as our industry, talent and dreams take us. But for some Americans, that promise doesn’t seem as certain as it did for previous generations. We need to make different choices – right away -- to get the kind of economic growth that offers the dignity of honest work and a fair chance to prosper to all Americans, no matter where they started in life\"How can we make safer a world that’s become much more dangerous in recent years? Will we have the strength and wisdom to face down challenges from old adversaries, and the courage and confidence to defeat the scourge of terrorism on our watch?\"How can we be secure in our own country? We need more control over our borders, but also smarter immigration policies that enforce the law and reflect our values.\"We need a healthcare system that provides what Obamacare promised but failed to deliver, healthcare insurance that is available, affordable and reliable.\"We need to keep our promises to veterans, to care generously for the health and welfare of those who risked everything to keep their promises to us.\"My opponent, Representative Ann Kirkpatrick, is a good person. But if Hillary Clinton is elected president, Arizona will need a Senator who will act as a check - not a rubber stamp.\"Ann Kirkpatrick won’t oppose higher taxes. She won’t oppose more federal spending. And she won’t oppose increased debts that slow economic growth. She won’t offer alternatives that trust in the innovation and industry of the American people and create jobs with a future. I will.\"She won’t insist that our military has the resources it needs to defend us from the many dangerous, complex threats we face. I will.\"She won’t exercise her right to advise and consent on presidential appointments to make sure we don’t have the wrong people in important jobs or Supreme Court Justices who will take the courts to liberal extremes. I will.\"She won’t support replacing the failed healthcare policies of the incumbent administration. I will. She said her vote for Obamacare was her proudest. She still maintains that even as 10,000 people in Pinal County face the prospect of losing their insurance because the system won’t work as promised.\"I voted against Obamacare and will continue to support efforts to replace it with a health care plan that work for everyone.\"These are some of the most important issues facing Arizona - but not the only important issues to be decided in the coming months. On each of these critical issues, I promise to do my best for the people who have done so much for me, and to give voice to the voiceless.\"I won’t get everything right. No one does. But I’ll use all the knowledge I’ve acquired from experience, and all the strength I have to help make Arizona and America a stronger, safer, more prosperous home for all of us.\"Thank you.\" Show less", "images": ["http://www.youtube.com/yts/img/pixel-vfl3z5WfW.gif", "http://s2.googleusercontent.com/s2/favicons?domain_url=http%3A%2F%2Fwww.johnmccain.com&feature=youtube_channel", "https://yt3.ggpht.com/a/AGF-l7_nuotRFAw-klRsVqdq7Xb_ghKLK18Yw1uSZw=s100-c-k-c0xffffffff-no-rj-mo", "https://www.youtube.com/pagead/viewthroughconversion/962985656/?backend=innertube&cname=1&cver=1_20191206&data=backend%3Dinnertube%3Bcname%3D1%3Bcver%3D1_20191206%3Bptype%3Dcview%3Btype%3Dcview%3Butuid%3DEyLs_rjU7gwtUNJR4wtjEQ&foc_id=EyLs_rjU7gwtUNJR4wtjEQ&label=followon_cvisit&ptype=cview", "https://yt3.ggpht.com/a/AGF-l7_nuotRFAw-klRsVqdq7Xb_ghKLK18Yw1uSZw=s900-c-k-c0xffffffff-no-rj-mo"], "top_img": "https://yt3.ggpht.com/a/AGF-l7_nuotRFAw-klRsVqdq7Xb_ghKLK18Yw1uSZw=s900-c-k-c0xffffffff-no-rj-mo", "keywords": [], "authors": [], "canonical_link": "https://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ", "title": "John McCain", "meta_data": {"title": "John McCain", "description": "Receive the latest official YouTube videos from JohnMcCain.com by subscribing to the JohnMcCaindotcom YouTube channel today! Log on to your YouTube account a...", "keywords": "john mccain mcain johnmccain johnmccaindotcom gop republican campaign president presidential election 2008 barack obam", "theme-color": "#ff0000", "og": {"site_name": "YouTube", "url": "https://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ", "title": "John McCain", "image": {"identifier": "https://yt3.ggpht.com/a/AGF-l7_nuotRFAw-klRsVqdq7Xb_ghKLK18Yw1uSZw=s900-c-k-c0xffffffff-no-rj-mo", "width": 900, "height": 900}, "description": "Receive the latest official YouTube videos from JohnMcCain.com by subscribing to the JohnMcCaindotcom YouTube channel today! Log on to your YouTube account a...", "type": "profile", "video": {"tag": "obam"}}, "al": {"ios": {"app_store_id": 544007664, "app_name": "YouTube", "url": "vnd.youtube://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ"}, "android": {"url": "https://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ?feature=applinks", "app_name": "YouTube", "package": "com.google.android.youtube"}, "web": {"url": "https://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ?feature=applinks"}}, "fb": {"app_id": 87741124305, "profile_id": "senatorjohnmccain"}, "twitter": {"card": "summary", "site": "@youtube", "url": "https://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ", "title": "John McCain", "description": "Receive the latest official YouTube videos from JohnMcCain.com by subscribing to the JohnMcCaindotcom YouTube channel today! Log on to your YouTube account a...", "image": "https://yt3.ggpht.com/a/AGF-l7_nuotRFAw-klRsVqdq7Xb_ghKLK18Yw1uSZw=s900-c-k-c0xffffffff-no-rj-mo", "app": {"name": {"iphone": "YouTube", "ipad": "YouTube", "googleplay": "YouTube"}, "id": {"iphone": 544007664, "ipad": 544007664, "googleplay": "com.google.android.youtube"}, "url": {"iphone": "vnd.youtube://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ", "ipad": "vnd.youtube://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ", "googleplay": "https://www.youtube.com/channel/UCEyLs_rjU7gwtUNJR4wtjEQ"}}}}, "movies": [], "publish_date": null, "source": "http://www.youtube.com", "summary": ""}