{"url": "people.com/politics/celebrities-slam-donald-trump-for-criticizing-san-juan-mayor/", "text": "Celebrities like Lady Gaga, John Legend, and Lin-Manuel Miranda have taken Donald Trump to task after the president criticized San Juan Mayor Carmen Yulín Cruz and other Puerto Rican officials who have been pleading for aid in the wake of Hurricane Maria.\n\nOn Saturday morning, the president — while at his golf course in New Jersey — lashed out at what he claimed was “poor leadership ability by the Mayor of San Juan and others in Puerto Rico, who are not able to get their workers to help” with hurricane relief efforts in the U.S. territory.\n\n“They want everything to be done for them when it should be a community effort,” Trump, 71, wrote. “10,000 Federal workers now on Island doing a fantastic job.”\n\n…Such poor leadership ability by the Mayor of San Juan, and others in Puerto Rico, who are not able to get their workers to help. They…. — Donald J. Trump (@realDonaldTrump) September 30, 2017\n\n…want everything to be done for them when it should be a community effort. 10,000 Federal workers now on Island doing a fantastic job. — Donald J. Trump (@realDonaldTrump) September 30, 2017\n\nHis words were met with backlash from some of Hollywood’s biggest stars.\n\n“It’s clear where the ‘poor leadership’ lies @realDonaldTrump,” Gaga, 31, wrote. “Puerto Rico is part of the United States. This is our responsibility.”\n\n“Trump continues to dominate the s——- president ever competition,” Legend, 38, wrote.\n\nI this it's clear where the 'poor leadership' lies @realDonaldTrump Puerto Rico is part of the United States. This is our responsibility. — xoxo, Gaga (@ladygaga) September 30, 2017\n\nTrump continues to dominate the shittiest president ever competition https://t.co/mUOiLfpfLT — John Legend (@johnlegend) September 30, 2017\n\nPeople could be dying as a direct result of you flippantly deciding to be an asshole about this. Step up, then step down. https://t.co/mltK1v7FeZ — Adam Scott (@mradamscott) September 30, 2017\n\nYou literally sent this from a golf course you fat bigot https://t.co/M8wTmZFARU — rob delaney (@robdelaney) September 30, 2017\n\nInstead of tweeting and playing golf, Trump needs to focus on helping Puerto Rico and other places devastated by the recent hurricanes.. — Leela James (@LeelaJames) September 30, 2017\n\n“Give Trump a chance!” they said. Well, Maria was his chance, to help millions of our citizens. Instead, he tweeted and sneered. Disgusted. — George Takei (@GeorgeTakei) September 30, 2017\n\nHe couldn't shine her shoes. She is a true leader and he is an ignorant clown.#impeachTrumpnow — Nancy Sinatra (@NancySinatra) September 30, 2017\n\nTo everybody who “held their noses” and voted for Trump…how’s it smelling out there to you now? — Eric Benét (@ebenet) September 30, 2017\n\nTrump’s loudest critic was Pulitzer Prize winner and Hamilton creator Miranda — whose father, Luis A. Miranda, Jr., moved to New York as a teenager from Puerto Rico.\n\n“You’re going straight to hell, @realDonaldTrump. No long lines for you. Someone will say, ‘Right this way, sir.’ They’ll clear a path,” Miranda, 37, wrote, standing up for Cruz. “She has been working 24/7. You have been GOLFING. You’re going straight to hell. Fastest golf cart you ever took.”\n\n“Did you tweet this one from the first hole, 18th hole, or the club?” he added. “Anyway, it’s a lie. You’re a congenital liar.”\n\nYou're going straight to hell, @realDonaldTrump.\n\nNo long lines for you.\n\nSomeone will say, \"Right this way, sir.\"\n\nThey'll clear a path. https://t.co/xXfJH0KJmw — Lin-Manuel Miranda (@Lin_Manuel) September 30, 2017\n\nShe has been working 24/7.\n\nYou have been GOLFING.\n\nYou're going straight to hell.\n\nFastest golf cart you ever took. https://t.co/5hOY23MBvQ — Lin-Manuel Miranda (@Lin_Manuel) September 30, 2017\n\nDid you tweet this one from the first hole, 18th hole, or the club?\n\nAnyway, it's a lie. You're a congenital liar.https://t.co/pxx7qvHPdf https://t.co/edFgHSHe3y — Lin-Manuel Miranda (@Lin_Manuel) September 30, 2017\n\nHurricane Maria pummeled Puerto Rico on Sept. 20 with ferocious 155-mph winds that ripped trees from the ground, tore roofs from buildings, and caused flooding that made many streets look like raging rivers. The most powerful storm of its kind to hit the island since 1932, it ravaged the island and left millions homeless.\n\nElectricity has been knocked out completely, with residents in need of electricity having to rely on backup generators. Experts estimate it could take half a year to restore power to the 3.5 million people who live there. Cell phone service has also been completely shut down.\n\nThe storm has claimed at least 16 lives in Puerto Rico so far, the Associated Press reports. Experts estimate that without electricity and supplies, that number could increase to thousands.\n\nImage zoom RIO GRANDE, PUERTO RICO - SEPTEMBER 27, 2017: Heydee Perez, age 29, and her son, Yenel Calera, age 4 have not received any aid one week after Hurricane Maria. The roof of their home is gone and they have very little to eat. (Photo by Carolyn Cole/Los Angeles Times via Getty Images)\n\nIn the wake of the growing crisis, Trump has been criticized for what some are calling his lackluster response to the hurricane-ravaged U.S. property. During a speech on his tax plan in Washington, D.C. on Friday, the president said the disaster relief effort has been complicated because the island is “surrounded by water.”\n\n“This is an island, surrounded by water. Big water. Ocean water,” he said.\n\nCruz, who is a member of the island’s Popular Democratic party and has been on the ground helping citizens, blasted FEMA in a press conference Friday, after receiving only “4 palates of water, 3 palates of meals, and 12 palates of infant food” from them.\n\n“We are dying here. And I cannot fathom the thought that the greatest nation of the world cannot figure out logistics for a small island of 100 miles by 35 miles long,” she said in a press conference, The Washington Post reported. “I am begging anyone that can hear us to save us from dying. If anybody out there is listening to us, we are dying and you are killing us with the inefficiency and the bureaucracy.”\n\nImage zoom San Juan's Mayor Carmen Yulin Cruz (left) hugs a woman during her visit to an elderly home in San Juan, Puerto Rico. THAIS LLORCA/EPA-EFE/Shutterstock\n\n“I am done being polite, I am done being politically correct. I am mad as hell because my people’s lives are at stake. And we are but one nation,” she added. “If we don’t get the food into people’s hands, what we are going to see is something close to a genocide.”\n\nShe also specifically criticized Homeland Security Secretary Elaine Duke for referring to U.S. response to the struggling Puerto Rico as a “good news story.”\n\n“Maybe from where she’s standing it’s a good news story,” Cruz said. “When you’re drinking from a creek, it’s not a good news story. When you don’t have food for a baby, it’s not a good news story.”\n\nRELATED VIDEO: Watch: Natasha Stoynoff Breaks Silence, Accuses Donald Trump of Sexual Attack\n\nIn response, Trump said Cruz’s critiques were politically driven.\n\n“The Mayor of San Juan, who was very complimentary only a few days ago, has now been told by the Democrats that you must be nasty to Trump,” he tweeted, before once again taking aim at the media.\n\n“The Fake News Networks are working overtime in Puerto Rico doing their best to take the spirit away from our soldiers and first Rs!” he wrote. “Shame!”\n\n.@realDonaldTrump hater, the Mayor of San Juan – is the perfect example of an opportunistic politician. Go ask PR Gov about responsiveness. pic.twitter.com/us3p78P9zK — Dan Scavino Jr. (@DanScavino) September 30, 2017\n\nso the average American can expect mockery from our government during a crisis if our mayor doesn't like trump? — A. Parent (@magsmac17) September 30, 2017\n\nDaniel Scavino, Jr., the White House Director of Social Media, also started slamming Cruz, calling her a “Trump hater.”\n\n“The Mayor of San Juan is the perfect example of an opportunistic politician. Go ask PR Gov about responsiveness,” Scavino, Jr. wrote — digging up a pre-election tweet of Cruz’s in which she said, in Spanish, that she doesn’t think Trump deserves to be president. “San Juan, PR Mayor has been hating on @realDonaldTrump long before he was our President. I’m not surprised by the show she is putting on…”\n\nAt least one user shot back at Scavino, Jr.’s claims. “So the average American can expect mockery from our government during a crisis if our mayor doesn’t like Trump?” she asked.", "images": ["https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/09/puerto-rico-hurricane-maria1.jpg", "https://secure.gravatar.com/avatar/59d6486f5205aabdbf65fd1a39fa97ee?s=300&d=blank&r=g", "https://peopledotcom.files.wordpress.com/2017/09/carmen-cruz.jpg", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/07/11375342_417123731803445_2077871559_n-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/09/donald-trump-stephen-curry-white-house-tweet.jpg?crop=0px%2C0px%2C1300px%2C682.5px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2017/09/donald-trump-stephen-curry-white-house-tweet.jpg?crop=0px%2C0px%2C1300px%2C682.5px&resize=1200%2C630", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/politics/celebrities-slam-donald-trump-for-criticizing-san-juan-mayor/", "title": "Celebrities Slam Donald Trump for Criticizing San Juan Mayor as She Pleads for Help for Her People", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Donald Trump, Lin-Manuel Miranda Puerto Rico, Lin-Manuel Miranda Hamilton, Carmen Yulín Cruz, San Juan Mayor, Puerto Rico Mayor, Carmen Yulín Cruz slams Trump, Puerto Rico Relief Efforts", "news_keywords": "Donald Trump, Lin-Manuel Miranda Puerto Rico, Lin-Manuel Miranda Hamilton, Carmen Yulín Cruz, San Juan Mayor, Puerto Rico Mayor, Carmen Yulín Cruz slams Trump, Puerto Rico Relief Efforts", "description": "Celebrities like Lady Gaga, John Legend, and Lin-Manuel Miranda have taken Donald Trump to task after the president criticized San Juan Mayor Carmen Yulín Cruz and other Puerto Rican officials who have been pleading for aid in the wake of Hurricane Maria", "og": {"title": "Celebrities Slam Donald Trump for Criticizing San Juan Mayor as She Pleads for Help for Her People", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/politics/celebrities-slam-donald-trump-for-criticizing-san-juan-mayor/", "description": "Celebrities like Lady Gaga, John Legend, and Lin-Manuel Miranda have taken Donald Trump to task after the president criticized San Juan Mayor Carmen Yulín Cruz and other Puerto Rican officials who have been pleading for aid in the wake of Hurricane Maria", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/09/donald-trump-stephen-curry-white-house-tweet.jpg?crop=0px%2C0px%2C1300px%2C682.5px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/politics/celebrities-slam-donald-trump-for-criticizing-san-juan-mayor/", "description": "Celebrities like Lady Gaga, John Legend, and Lin-Manuel Miranda have taken Donald Trump to task after the president criticized San Juan Mayor Carmen Yulín Cruz and other Puerto Rican officials who have been pleading for aid in the wake of Hurricane Maria", "media": "https://peopledotcom.files.wordpress.com/2017/09/donald-trump-stephen-curry-white-house-tweet.jpg?crop=0px%2C0px%2C1300px%2C682.5px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/politics/celebrities-slam-donald-trump-for-criticizing-san-juan-mayor/", "title": "Celebrities Slam Donald Trump for Criticizing San Juan Mayor as She Pleads for Help for Her People", "description": "Celebrities like Lady Gaga, John Legend, and Lin-Manuel Miranda have taken Donald Trump to task after the president criticized San Juan Mayor Carmen Yulín Cruz and other Puerto Rican officials who have been pleading for aid in the wake of Hurricane Maria", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/09/donald-trump-stephen-curry-white-house-tweet.jpg?crop=0px%2C0px%2C1300px%2C682.5px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}