{"url": "https://people.com/movies/jennifer-aniston-and-justin-theroux-split-after-two-years-of-marriage/", "text": "Jennifer Aniston and Justin Theroux have split after two and a half years of marriage — and seven years as a couple.\n\n“In an effort to reduce any further speculation, we have decided to announce our separation,” says a statement released by longtime Aniston publicist Stephen Huvane. “This decision was mutual and lovingly made at the end of last year. We are two best friends who have decided to part ways as a couple, but look forward to continuing our cherished friendship.\n\n“Normally we would do this privately, but given that the gossip industry cannot resist an opportunity to speculate and invent, we wanted to convey the truth directly. Whatever else is printed about us that is not directly from us, is someone else’s fictional narrative. Above all, we are determined to maintain the deep respect and love that we have for one another. “\n\nThe couple announced that they split at the end of the last year, however, they celebrated the New Year together with their annual vacation to Cabo San Lucas, Mexico alongside a handful of close pals including Jason Bateman and his family.\n\nImage zoom Pharrell and Jennifer Aniston at Ellen DeGeneres' birthday.\n\nThe two spent quite a bit of time apart in recent months raising questions. Theroux was often spotted in New York City away from their L.A. home. They have also had a busy year as Aniston signed on with Reese Witherspoon for a new Apple TV series and filmed Dumplin’ in Atlanta, while Theroux, 46, filmed the comedy The Spy Who Dumped Me in Budapest.\n\nOn Saturday, Aniston made an appearance at Ellen DeGeneres‘ birthday party without Theroux. She was spotted standing outside the Hollywood venue chatting with Pharrell.\n\nThe next day, the actress rang in her 49th birthday without the actor. Aniston celebrated in Malibu, California with a gathering including pals Courteney Cox, Andrea Bendewald, Leigh Kilton-Smith and Kristin Hahn on Sunday.\n\nTheroux, meanwhile, was spotted out in New York City on Friday walking his dog. (Last year, the duo vacationed together in Los Cabos, Mexico with friends).\n\nImage zoom Justin Theroux walks his dog in N.Y.C. days before Jennifer Aniston's birthday. Splash News Online\n\nSources recently told PEOPLE that their busy schedules worked for both of them and helped their marriage.\n\n“Justin often spends a few days in NYC by himself,” a source previously told PEOPLE. “When he is in NYC, Jen will catch up with friends and enjoys her own life. When Justin is in L.A., it’s very special for them. They socialize together with friends. They often go out to dinner or have people over.”\n\nAniston showed off the $21 million L.A. home they designed together in the March issue of Architectural Digest, saying, “I look around at my husband and my dogs and our home, and there’s nowhere else I want to be.”\n\nAniston and Theroux first met on the Hawaii set of 2008’s Tropic Thunder and began dating in 2011. They later married in a surprise and secret ceremony on August 5, 2015 — just a few days before Theroux’s 44th birthday. A source close to the actress told PEOPLE at the time that the two were happy to have pulled off the surprise wedding, inviting friends to a backyard party under the ruse of celebrating Theroux’s birthday.\n\nRELATED: Jennifer Aniston and Justin Theroux Were the Picture Perfect Couple During Their Last Vacation\n\n“They seemed ecstatic,” the source said. “They celebrated late and barely slept, but they were in the best mood. They were giddy to have pulled off an amazing wedding celebration with their friends. And they were proud to finally be married.”\n\nAniston was previously married to Brad Pitt from 2000 to 2005 after starting their relationship in 1998. She later dated Vince Vaughn and John Mayer after her divorce from Pitt.\n\nThis is Theroux’s first marriage after previously dating hair stylist Heidi Bivens for 14 years before their breakup in 2011, shortly before he started dating Aniston. Theroux and Bivens shared an apartment in New York City before the split.", "images": ["https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/02/justin-theroux2.jpg", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/02/splash-aniston-8.jpg", "https://peopledotcom.files.wordpress.com/2017/04/jennifer-aniston8.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2017/07/11375342_417123731803445_2077871559_n-1.jpg?fit=250%2C250", "https://secure.gravatar.com/avatar/5c1648abf15ab582b95dc580d09b34c5?s=300&d=blank&r=g", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2017/04/jennifer-aniston8.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "keywords": [], "authors": ["Ale Russian", "Mike Miller"], "canonical_link": "https://people.com/movies/jennifer-aniston-and-justin-theroux-split-after-two-years-of-marriage/", "title": "Jennifer Aniston and Justin Theroux Split 'Lovingly' After Two Years of Marriage", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "jennifer aniston, justin theroux, jennifer aniston justin theroux, jennifer aniston husband, jennifer aniston married, jennifer aniston justin, jennifer aniston divorce", "news_keywords": "jennifer aniston, justin theroux, jennifer aniston justin theroux, jennifer aniston husband, jennifer aniston married, jennifer aniston justin, jennifer aniston divorce", "description": "Jennifer Aniston and Justin Theroux have split after 2 and a half years of marriage, the Associated Press reports", "og": {"title": "Jennifer Aniston and Justin Theroux Split 'Lovingly' After Two Years of Marriage", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/movies/jennifer-aniston-and-justin-theroux-split-after-two-years-of-marriage/", "description": "Jennifer Aniston and Justin Theroux have split after 2 and a half years of marriage, the Associated Press reports", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2017/04/jennifer-aniston8.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/movies/jennifer-aniston-and-justin-theroux-split-after-two-years-of-marriage/", "description": "Jennifer Aniston and Justin Theroux have split after 2 and a half years of marriage, the Associated Press reports", "media": "https://peopledotcom.files.wordpress.com/2017/04/jennifer-aniston8.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/movies/jennifer-aniston-and-justin-theroux-split-after-two-years-of-marriage/", "title": "Jennifer Aniston and Justin Theroux Split 'Lovingly' After Two Years of Marriage", "description": "Jennifer Aniston and Justin Theroux have split after 2 and a half years of marriage, the Associated Press reports", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2017/04/jennifer-aniston8.jpg?crop=0px%2C0px%2C2000px%2C1050px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}