{"url": "www.thebump.com/news/ashton-kutcher-no-kids-photos-online", "text": "We've heard a lot about Wyatt and Dimitri Kutcher—like how Wyatt had a poop explosion all over dad, or how Dimitri is his parents' biggest fan. But we've never actually seen the daughter and son of Ashton Kutcher and Mila Kunis. On a recent podcast, Kutcher explained why.\n\n“My wife and I have chosen a career where we're in the public light, but my kids have not,” Ashton told Arianna Huffington on The Thrive Global Podcast. “I think they should have the right to choose that and I actually don't think that they should have images of them as children that are out there, that somebody could potentially blackmail them with. It's their private life; it's not mine to give away.”\n\nHe did almost give it away at the beginning. Shortly after Wyatt's birth in 2014, he shared several photos of different babies, refusing to identify which one was his daughter.\n\n\"Mila and I would like to welcome Wyatt Isabelle Kutcher to the world. May your life be filled with wonder, love, laughter, health, happiness, curiosity, and privacy,\" he wrote in the post. \"Can you guess which one is ours, or does it really matter? All babies are cute.\"\n\nKutcher and Kunis aren't alone in their decision to shield their children from the public eye. Dax Shepard and Kristen Bell are also known for keeping their kids off social media. And outside of the celebrity circuit, plenty of parents choose to keep their Facebook feeds child-free. And like Kutcher, they explain it's more about their child's autonomy than safety concerns.\n\nPHOTO: Getty Images", "images": ["https://media.front.xoedge.com/images/b0c3e021-ca3c-41f6-b800-b984ef5c38bd", "http://www.thebump.com/assets/animated-promo-static-1stframe-min-264b4df0ca56da6c004a8029f215c60267a733040a3ad3c3ad11e7b4d02d3359.jpg", "https://images.ctfassets.net/6m9bd13t776q/4SMby9mNTWq2qUOKgAgywQ/79c94361ba95205d335fe9990944ca4f/avatar.jpg?w=140&h=140&fit=thumb", "https://static.thebump.com/shared-web/social/Button_Pinterest%402x.png", "https://media.front.xoedge.com/images/b0c3e021-ca3c-41f6-b800-b984ef5c38bd~rs_1080.h", "http://b.scorecardresearch.com/p?c1=2&c2=6035362&cv=2.0&cj=1"], "top_img": "https://media.front.xoedge.com/images/b0c3e021-ca3c-41f6-b800-b984ef5c38bd", "keywords": [], "authors": [], "canonical_link": "https://www.thebump.com/news/ashton-kutcher-no-kids-photos-online", "title": "Here's Why You Won't See Ashton Kutcher's Kids Online", "meta_data": {"csrf-param": "authenticity_token", "csrf-token": "S+Qc87Q6ntggygNDTrMaix242cmoFnjxBhLJtYIIqIw5o8nhdr39LxMzJLpH6+oKC5PPUpzZmMQbHu3SeNdv7g==", "viewport": "initial-scale=1.0, maximum-scale=1.0, width=device-width, height=device-height", "description": "See why Ashton Kutcher and Mila Kunis don't post any photos of their children on social media.", "keywords": "TheBump.com - Pregnancy, Parenting and Baby Information, Baby Names, Pregnancy Information, Parenting Tips, Parenting Forums, Baby Names, Pregnancy Information, Parenting Tips, Parenting Advice, Baby Advice", "fb": {"app_id": 44019285167}, "og": {"description": "See why Ashton Kutcher and Mila Kunis don't post any photos of their children on social media.", "image": "https://media.front.xoedge.com/images/b0c3e021-ca3c-41f6-b800-b984ef5c38bd", "title": "Here&#39;s Why You Won&#39;t See Ashton Kutcher&#39;s Kids Online", "type": "article", "url": "https://www.thebump.com/news/ashton-kutcher-no-kids-photos-online"}, "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "http://www.thebump.com", "summary": ""}