{"url": "www.wmagazine.com/story/caitlyn-jenner-memoir-kardashian-controversy", "text": "Have you heard? A new controversy is absolutely tearing the Kardashian clan apart. The source of that controversy also just so happens to be available for purchase at your nearest seller of fine books. It's Caitlyn Jenner 's new memoir, and select Kardashian can't help but keeping talking about how very, very controversial it is.\n\nThe Secrets of My Life comes out almost two years after Jenner revealed she was indeed transgender and has undergone a process to confirm her gender (it's co-written by Buzz Bissinger, the famed sportswriters who also wrote the Caitlyn Jenner cover story for Vanity Fair ). It details Jenner's experience struggling with her gender identity in private while living as a sports hero, an icon of American masculinity and then, of course, her very public transition.\n\nOf course, Jenner's reality TV trailblazing family is mentioned throughout, and they clearly are very, very upset with it and don't care how many members of the book-buying public happen to know about it.\n\nDuring an appearance that airs today on Ellen , one of America's highest-rated daytime talk shows, Kardashian klan lynchpin Kim discussed her displeasure with parts of the book that happens to have a suggested retail price of $30 but is available to buy now from several online and bricks-and-motor retailers.\n\n“My heart breaks for my mom [Kris Jenner,] you know, because I feel like she’s been through so much and [Jenner is] promoting this book and she’s saying all these things,” Kardashian , who has just shy of 100 million Instagram followers, told host Ellen DeGeneres, who has 44 million Instagram followers. “I don’t think it’s necessary and I just feel like it’s unfair, things aren’t truthful.”\n\nKardashian refers to claims Caitlyn Jenner makes that Kris Jenner knew she was transgender before they were married.\n\nKim Kardashian says that while she hasn't talked to Caitlyn Jenner for a few weeks ever since news of the contents of the book began to surface in advance of its release, as is standard for any high-profile celebrity memoir, she will always love her.\n\n\"I feel like it’s taken [Jenner] a really long time to be honest with herself, so I don’t expect her to be honest about my mom now,\" Kardashian West told DeGeneres in a segment obtained by E! News before the interview aired. \"But it’s just so hurtful. I wish her all the success in the world, but not at our expense.”\n\nKris Jenner herself also reacted to the memoir on the family's long running reality show on an episode that premieres Sunday, just days before the book's scheduled release. \"None of it makes sense! Everything she says is all made up,\" Jenner rants on national television about her portrayal in her ex-spouse's book. \"Why does everything have to be that Kris is such a bitch?\"\n\nMeanwhile, Caitlyn Jenner, who also recorded an audio version of the book, recently claimed on Andy Cohen's SiriusXM talk show that she hasn't talked to Khloe Kardashian in two years. This despite the fact that claim is contradicted by scenes from the family's reality show. Still, we are left to assume that Khloe is also very mad about the book, which is also available to download on your Kindle, Nook or other e-reader devices.\n\nOf course, this all begs the question: Will anyone want to read something that apparently has caused so much highly publicized controversy within the Kardashian clan? The book may currently be number 28 on Amazon's best-seller list, but we can only imagine it might have climbed higher if not for this onslaught of negative publicity that all happens to coincide with its release.\n\nWe can also only hope that someday the wounds heal, and the extended Kardashian-Jenner family can someday reunite back into the family unit that supports each other's products and endeavors in perfect, publicity-optimized harmony.\n\nRelated: ****Inside Donald J. Trump's Inauguration Ball with Caitlyn Jenner, Rick Perry and Tony Soprano's Former Girlfriend\n\nSee What's Trending in W Video:", "images": ["https://media.wmagazine.com/photos/590231020c05f057f6126f9c/2:1/w_790,c_limit/GettyImages-509642778.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1897cc1eac746f6e754f/1:1/w_128,c_limit/Brad%20Pitt.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f1855cc1eac746f6e7549/1:1/w_128,c_limit/Kristen%20Stewert.jpg", "https://media.wmagazine.com/photos/590231020c05f057f6126f9c/4:3/w_1536/GettyImages-509642778.jpg", "https://vulcan.condenastdigital.com/wmag-services/photos/592f0706802c577242df3ef1/1:1/w_128,c_limit/Michelle_Obama_Face.png", "http://www.wmagazine.com/images/w_logo.svg"], "top_img": "https://media.wmagazine.com/photos/590231020c05f057f6126f9c/2:1/w_790,c_limit/GettyImages-509642778.jpg", "keywords": [], "authors": ["Kyle Munzenrieder", "Jamie Mccarthy"], "canonical_link": "https://www.wmagazine.com/story/caitlyn-jenner-memoir-kardashian-controversy", "title": "Caitlyn Jenner's Memoir Is Tearing the House Kardashian Asunder", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "msapplication-TileColor": "#ffffff", "theme-color": "#ffffff", "author": "Kyle Munzenrieder", "copyright": "Copyright (c) Condé Nast 2019", "description": "Caitlyn Jenner's new book is angering select Kardashians in one perfect, family-choreographed, attention-getting publicity attack.", "publishDate": "2017-04-27T19:03:27Z", "keywords": "kris jenner,khloe kardashian,kim kardashian,Cailtyn Jenner", "fb": {"app_id": 230068530489385, "admins": 108943, "pages": 40621875003}, "og": {"site_name": "W Magazine", "title": "Caitlyn Jenner's Memoir Is Tearing The House Kardashian Asunder", "url": "https://www.wmagazine.com/story/caitlyn-jenner-memoir-kardashian-controversy", "description": "Caitlyn Jenner's new book is angering select Kardashians in one perfect, family-choreographed, attention-getting publicity attack.", "type": "article", "image": "https://media.wmagazine.com/photos/590231020c05f057f6126f9c/2:1/w_790,c_limit/GettyImages-509642778.jpg"}, "twitter": {"card": "summary_large_image", "site": "wmag", "title": "Caitlyn Jenner's Memoir Is Tearing The House Kardashian Asunder", "description": "Caitlyn Jenner's new book is angering select Kardashians in one perfect, family-choreographed, attention-getting publicity attack.", "image": "https://media.wmagazine.com/photos/590231020c05f057f6126f9c/2:1/w_790,c_limit/GettyImages-509642778.jpg?mbid=social_retweet", "domain": "wmagazine.com"}, "version": "2.0.0"}, "movies": [], "publish_date": 1493319807.0, "source": "http://www.wmagazine.com", "summary": ""}