{"url": "ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "text": "Jonathan Demme, the Oscar-winning director of The Silence of the Lambs, Philadelphia, Rachel Getting Married, and much more, died Wednesday at age of 73.\n\nDemme’s varied career not only covered feature films; he was an accomplished director of concert films and documentaries as well, working with an equally diverse array of talent, from Oprah Winfrey and Laura Dern to Justin Timberlake and Spalding Gray.\n\nRELATED: Looking Back on Jonathan Demme’s Best Work • Where to Stream the Director’s Music Docs\n\nAs news of the filmmaker’s death continues to spread, celebrities and influencers within the entertainment industry have begun sharing their reactions on social media. See a selection of remembrances below.\n\n“A big hearted, big tent, compassionate man- in full embrace in his life of people in need- and of the potential of art, music, poetry and film to fill that need- a big loss to the caring world.” — Meryl Streep\n\n“Jonathan taught us how big a heart a person can have, and how it will guide how we live and what we do for a living. He was the grandest of men.” — Tom Hanks\n\n“I am heart-broken to lose a friend, a mentor, a guy so singular and dynamic you’d have to design a hurricane to contain him. Jonathan was as quirky as his comedies and as deep as his dramas. He was pure energy, the unstoppable cheerleader for anyone creative. Just as passionate about music as he was about art, he was and will always be a champion of the soul. JD, most beloved, something wild, brother of love, director of the lambs. Love that guy. Love him so much.” — Jodie Foster\n\n“I am really shocked and very sad to hear about Jonathan’s passing. He was one of the best, and a really nice guy as well who had such a great spirit. My condolences to his family.” — Anthony Hopkins\n\n“Jonathan Demme came into my life when he directed me in Melvin and Howard. I won an Oscar for that role and I can’t imagine that having happened with any other director. He was pure magic. Brilliant technically but he never let that make him isolated. He included everyone on that set in the making of the movie in the most edgy, thrilling, wildly collaborative way. He did the same thing in Philadelphia. And, there, we never forgot for a moment that that film could change the experience of being HIV positive in this country and it did. The heartbeat and the integrity of it began with Jonathan’s goodness and sense of justice. I’m so proud to have been in it.\n\nI think the last public appearance he may have made was to host the NYC screening of my son, Charlie McDowell’s film, The Discovery. It can’t have been easy for him to go to NYC from Nyack and do that a couple of weeks before his death. But Jonathan celebrated and honored creativity more fiercely than anyone I have ever known. My daughter worked with him in The Manchurian Candidate. We all admired him so much. I send all of our family’s love to his beautiful family and I will hold him where he’s always been, in my heart, forever.” — Mary Steenburgen\n\n“Whenever I ran into Jonathan, he was filled with enthusiasm and excitement about a new project. He took so much joy in moviemaking. His pictures have an inner lyricism that just lifts them off the ground — even a story like The Silence of the Lambs. I have great admiration for Jonathan as a filmmaker — I love the freshness of his style and his excellent use of music, from Buddy Holly to Miklos Rozsa. There’s so much more to be said, and I hardly know where to begin. I also loved him as a friend, and to me he was always young. My young friend. The idea that he’s gone seems impossible to me.” — Martin Scorsese\n\nVery sad to hear of the passing of the great Jonathan Demme. Admired his movies, his documentaries, his concert films. He could do anything. — edgarwright (@edgarwright) April 26, 2017\n\nToo many great films to mention: Something Wild, Stop Making Sense, Silence Of The Lambs, Melvin & Howard, among countless varied others. https://t.co/jU1pwXqlxq — edgarwright (@edgarwright) April 26, 2017\n\nRIP dearest Jonathan Demme. The world lost one of its purest, most loving and talented souls today. My heart is broken. I love you. — Christine Lahti (@ChristineALahti) April 26, 2017\n\nSad to hear that Jonathan Demme has passed. — Elijah Wood (@elijahwood) April 26, 2017\n\nTed Demme and I were worried about making The Ref when his uncle Jonathan Demme said something profound: \"Stop talking and start shooting.\" — Denis Leary (@denisleary) April 26, 2017\n\nDeeply sad to hear my friend, neighbor, and colleague Jonathan Demme has passed on. He was one of the real good guys. I miss you, buddy. — Stephen King (@StephenKing) April 26, 2017\n\nI know now that this was also the last time I saw Jonathan Demme. Fitting that it was in an act of love and generosity. Such a kind man. https://t.co/qYUZqXz2NU — Barry Jenkins (@BarryJenkins) April 26, 2017\n\nJonathan Demme and self in New York in 1996. He loved people, he loved filming them; I am so sad to hear he's gone. RIP JD xx pic.twitter.com/wbgdNZfih7 — Robyn Hitchcock (@RobynHitchcock) April 26, 2017\n\nRest In Peace, JD… — ABFoundation (@ABFalecbaldwin) April 26, 2017\n\nJonathan Demme optioned The Orchid Thief and steered it to becoming \"Adaptation\". He was brilliant, charming, warm, funny. RIP, Jonathan. — Susan Orlean (@susanorlean) April 26, 2017\n\nJust heard Jonathan Demme has passed. I can't process. He's a hero, an artist, an example, a goal, a visionary, a pinnacle & a master. RIP — Paul Feig (@paulfeig) April 26, 2017\n\nRest In Peace, Jonathan Demme. Passing of a great cinematic artist. — James Wan (@creepypuppet) April 26, 2017\n\nI picture Jonathan Demme only smiling at me with inquisitive light in his eyes. I'm saddened to think of the pain of his last act. Free now. — Jeffrey Wright (@jfreewright) April 26, 2017\n\nJonathan Demme was a great artist, humanitarian, activist & a warm encouraging colleague. I've known very few like him. He will be missed https://t.co/wQv5QRqHoN — Ron Howard (@RealRonHoward) April 26, 2017\n\nR.I.P #JonathanDemme one of a kind — Tony Todd (@TonyTodd54) April 26, 2017\n\n-artist – friend – neighbor – i will miss ur brilliance jonathan demme — ROSIE (@Rosie) April 26, 2017\n\nOften on tour I'll watch Jonathan Demme's \"Heart of Gold\" to remind me of what performance is about. Demme was a one of a kind filmmaker. — Mike Birbiglia (@birbigs) April 26, 2017\n\nUgh. Two artists I knew and liked both dead: Martha Lavey and Jonathan Demme. To paraphrase an S-town sundial: Not tedious, but brief. — Ira Glass (@iraglass) April 26, 2017\n\nHappier times. I will always love you Jonathan Demme. pic.twitter.com/grZRknHClb — Nia Vardalos (@NiaVardalos) April 26, 2017\n\nSad to hear of Jonathan Demme's passing. I did not get a chance to work with him, but came very close twice. What a warm, gracious man. — David Simon (@AoDespair) April 26, 2017\n\nJonathan Demme was a true inspiration. From humble Corman roots to deftly handling genre (sometimes more than one),he was an original.#RIP pic.twitter.com/ahtSdkvHvd — Joe Lynch (@TheJoeLynch) April 26, 2017\n\nI only worked with him once – he was just like his films: brilliant, curious & original. RIP Jonathan Demme – a truly great filmmaker. pic.twitter.com/eoHwxffZL3 — Beau Willimon (@BeauWillimon) April 26, 2017\n\nRIP Jonathan Demme. Silence of the Lambs is in my forever rolodex of nightmares & turns me into the terrified child I was when I 1st saw it. — Kumail Nanjiani (@kumailn) April 26, 2017\n\nOh no. Jonathan Demme. One of our great filmmakers one of the most beautiful souls on the planet. Another magical irreplaceable friend gone. — Stevie Van Zandt (@StevieVanZandt) April 26, 2017\n\nREST IN PEACE, MR. DEMME pic.twitter.com/BCWo17WytR — Bryan Fuller (@BryanFuller) April 26, 2017\n\nRIP Jonathan Demme. Director's director. Such love for his subject matter. Gorgeous moments and images devoid of vanity. One of the best. — Jay Baruchel (@BaruchelNDG) April 26, 2017\n\nJust heard about Jonathan Demme. He could literally do anything and did it all masterfully. Never knew him but everyone loved him. Sad news. — Eli Roth (@eliroth) April 26, 2017\n\nJonathan Demme was a gifted and versatile filmmaker. RIP. — Michael McKean (@MJMcKean) April 26, 2017\n\nVery sad to share this news about a wonderful director, a deep lover of movies, and a very kind man. https://t.co/jqP9MDXNs6 — Mark Harris (@MarkHarrisNYC) April 26, 2017\n\nSo sad to learn of the death of one of my all-time favorite directors, the brilliant, humane Jonathan Demme. Silence of the Lambs & others. — Anthony Rapp (@albinokid) April 26, 2017\n\nworth noting too that in the rather white film industry Demme really did try to give screen time to Black actors & stories pic.twitter.com/nAa0dfoYQY — Saladin Ahmed (@saladinahmed) April 26, 2017\n\n\"The chance to make a film that deals in an imaginative way with stuff you care tremendously about is a real high.\" — Jonathan Demme #RIP pic.twitter.com/Z7axx3fgt5 — Tribeca (@Tribeca) April 26, 2017", "images": ["https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2017/04/gettyimages-523360674.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768"], "top_img": "https://ewedit.files.wordpress.com/2017/04/gettyimages-523360674.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "keywords": [], "authors": ["Dan Heching"], "canonical_link": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "title": "Celebrities react to the death of Jonathan Demme: 'He could do anything'", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Jonathan Demme, Silence of the Lambs, Jonathan Demme dead,", "news_keywords": "Jonathan Demme, Silence of the Lambs, Jonathan Demme dead,", "description": "Jonathan Demme, Oscar-winning director of The Silence of the Lambs, died Wednesday at 73.", "og": {"title": "Celebrities React to the Death of Jonathan Demme: 'He Could Do Anything'", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "description": "Jonathan Demme, the Oscar-winning director of The Silence of the Lambs, Philadelphia, Rachel Getting Married, and much more, died Wednesday at…", "image": {"identifier": "https://ewedit.files.wordpress.com/2017/04/gettyimages-523360674.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "description": "Jonathan Demme, Oscar-winning director of The Silence of the Lambs, died Wednesday at 73.", "media": "https://ewedit.files.wordpress.com/2017/04/gettyimages-523360674.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "title": "Celebrities React to the Death of Jonathan Demme: 'He Could Do Anything'", "description": "Jonathan Demme, Oscar-winning director of The Silence of the Lambs, died Wednesday at 73.", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2017/04/gettyimages-523360674.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "fb": {"pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1493179200.0, "source": "http://ew.com", "summary": ""}