{"url": "http://www.nytimes.com/2008/09/21/business/21cong.html?pagewanted=1&ref=business", "text": "With Congressional Republicans warning that the bailout could be slowed by efforts to tack on additional provisions, Democratic leaders said they would insist on a requirement that the administration use its new role, as the owner of large amounts of mortgage debt, to help hundreds of thousands of troubled borrowers at risk of losing their homes to foreclosure.\n\n“It’s clear that the administration has requested that Congress authorize, in very short order, sweeping and unprecedented powers for the Treasury secretary,” the House speaker, Nancy Pelosi of California, said in a statement. “Democrats will work with the administration to ensure that our response to events in the financial markets is swift, but we must insulate Main Street from Wall Street and keep people in their homes.”\n\nMs. Pelosi said Democrats would also insist on “enacting an economic recovery package that creates jobs and returns growth to our economy.”\n\nEven as talks got under way, there were signs of how very much in flux the plan remained. The administration suggested that it might adjust its proposal, initially restricted to purchasing assets from financial institutions based in the United States, to enable foreign firms with United States affiliates to make use of it as well.\n\nThe ambitious effort to transfer the bad debts of Wall Street, at least temporarily, into the obligations of American taxpayers was first put forward by the administration late last week after a series of bold interventions on behalf of ailing private firms seemed unlikely to prevent a crash of world financial markets.\n\nA $700 billion expenditure on distressed mortgage-related assets would roughly be what the country has spent so far in direct costs on the Iraq war and more than the Pentagon’s total yearly budget appropriation. Divided across the population, it would amount to more than $2,000 for every man, woman and child in the United States.\n\nWhatever is spent will add to a budget deficit already projected at more than $500 billion next year. And it comes on top of the $85 billion government rescue of the insurance giant American International Group and a plan to spend up to $200 billion to shore up the mortgage finance giants Fannie Mae and Freddie Mac.\n\nAdvertisement Continue reading the main story\n\nAt his news conference, Mr. Bush also sought to portray the plan as helping every American. “The government,” he said, “needed to send a clear signal that we understood the instability could ripple throughout and affect the working people and the average family, and we weren’t going to let that happen.”\n\nA program to help troubled borrowers refinance mortgages — along with an $800 billion increase in the national debt limit — was approved in July. But financing for it depended largely on fees paid by Fannie Mae and Freddie Mac, which have been placed into a government conservatorship.\n\nRepresentative Barney Frank, Democrat of Massachusetts and chairman of the House Financial Services Committee, said in an interview that his staff had already begun working with the Senate banking committee to draft additions to the administration’s proposal.\n\nMr. Frank said Democrats were particularly intent on limiting the huge pay packages for corporate executives whose firms seek aid under the new plan, raising the prospect of a contentious battle with the White House.\n\n“There are going to be federal tax dollars buying up some of the bad paper,” Mr. Frank said. “They should accept some compensation guidelines, particularly to get rid of the perverse incentives where it’s ‘heads I win, tails I break even.’ ”\n\nMr. Frank said Democrats were also thinking about tightening the language on the debt limit to make clear that the additional borrowing authority could be used only for the bailout plan. And he said they might seek to revive a proposal that would give bankruptcy judges the authority to modify the terms of primary mortgages, a proposal strongly opposed by the financial industry.\n\nSenator Charles E. Schumer, Democrat of New York, who attended emergency meetings with the Treasury secretary, Henry M. Paulson Jr., and the Federal Reserve chairman, Ben S. Bernanke, on Capitol Hill last week, described the proposal as a good start but said it did little for regular Americans.\n\nPhoto\n\n“This is a good foundation of a plan that can stabilize markets quickly,” Mr. Schumer said in a statement. “But it includes no visible protection for taxpayers or homeowners. We look forward to talking to Treasury to see what, if anything, they have in mind in these two areas.”\n\nAdvertisement Continue reading the main story\n\nMs. Pelosi’s statement made clear that she would push for an economic stimulus initiative either as part of the bailout legislation or, more likely, as part of the budget resolution Congress must adopt before adjourning for the fall elections. Such a plan could include an increase in unemployment benefits and spending on infrastructure projects to help create jobs.\n\nSome Congressional Republicans warned Democrats not to overreach.\n\n“The administration has put forward a plan to help the American people, and it is now incumbent on Congress to work together to solve this crisis,” said Representative John A. Boehner of Ohio, the Republican leader.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You will receive emails containing news content , updates and promotions from The New York Times. You may opt-out at any time. You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Boehner added, “Efforts to exploit this crisis for political leverage or partisan quid pro quo will only delay the economic stability that families, seniors and small businesses deserve.”\n\nAides to Senator Barack Obama of Illinois, the Democratic presidential nominee, said he was reviewing the proposal. In Florida, Mr. Obama told voters he would press for a broader economic stimulus.\n\n“We have to make sure that whatever plan our government comes up with works not just for Wall Street, but for Main Street,” Mr. Obama said. “We have to make sure it helps folks cope with rising prices, and sparks job creation, and helps homeowners stay in their homes.”\n\nSenator John McCain of Arizona, the Republican nominee, issued a statement saying he, too, was reviewing the plan.\n\n“This financial crisis,” Mr. McCain said, “requires leadership and action in order to restore a sound foundation to financial markets, get our economy on its feet, and eliminate this burden on hardworking middle-class Americans.”\n\nIf adopted, the bailout plan would sharply raise the stakes for the new administration on the appointment of a new Treasury secretary.\n\nThe administration’s plan would allow the Treasury to hire staff members and engage outside firms to help manage its purchases. And officials said that the administration envisioned enlisting several outside firms to help run the effort to buy up mortgage-related assets.\n\nAdvertisement Continue reading the main story\n\nOfficials said that details were still being worked out but that one idea was for the Treasury to hold reverse auctions, in which the government would offer to buy certain classes of distressed assets at a particular price and firms would then decide if they were willing to sell at that price, or could bid the price lower.\n\nMindful of a potential political fight, Mr. Paulson and Mr. Bernanke held a series of conference calls with members of Congress on Friday to begin convincing them that action was needed not just to help Wall Street but everyday Americans as well.\n\nRepublicans typically supportive of the administration said they were in favor of approving the plan as swiftly as possible.\n\nSenator Mitch McConnell of Kentucky, the Republican leader, said in a statement, “This proposal is, and should be kept, simple and clear.” The majority leader, Senator Harry Reid, Democrat of Nevada, said that the bailout was needed but that Mr. Bush owed the public a fuller explanation.\n\nSome lawmakers were more critical or even adamantly opposed to the plan. “The free market for all intents and purposes is dead in America,” Senator Jim Bunning, Republican of Kentucky, declared on Friday.\n\nIt is far from clear how much distressed debt the government will end up purchasing, though it seemed likely that the $700 billion figure was large enough to send a reassuring message to the jittery markets. There are estimates that firms are carrying $1 trillion or more in bad mortgage-related assets.\n\nThe ultimate price tag of the bailout is virtually impossible to know, in part because of the possibility that taxpayers could profit from the effort, especially if the market stabilizes and real estate prices rise.\n\nLehman Can Sell to Barclays\n\nA federal bankruptcy judge decided early Saturday that Lehman Brothers could sell its investment banking and trading businesses to Barclays, the big British bank, the first major step to wind down the nation’s fourth-largest investment bank.\n\nAdvertisement Continue reading the main story\n\nThe judge, James Peck, gave his decision at the end of an eight-hour hearing, which capped a week of financial turmoil.\n\nThe deal was said to be worth $1.75 billion earlier in the week but the value was in flux after lawyers announced changes to the terms on Friday. It may now be worth closer to $1.35 billion, which includes the $960 million price tag on Lehman’s office tower in Midtown Manhattan.\n\nLehman Brothers Holdings Inc. on Monday filed the biggest bankruptcy in United States history, after Barclays PLC declined to buy the investment bank in its entirety.", "images": ["https://static01.nyt.com/images/2008/09/20/business/20bush.1-650.jpg", "https://static01.nyt.com/images/2008/09/20/business/20bush.1-75.jpg", "https://static01.nyt.com/images/2008/09/20/business/21cong-75.jpg"], "top_img": "https://static01.nyt.com/images/2008/09/20/business/20bush.1-75.jpg", "keywords": [], "authors": ["David M. Herszenhorn"], "canonical_link": "https://www.nytimes.com/2008/09/21/business/21cong.html", "title": "Administration Is Seeking $700 Billion for Wall Street", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "sourceApp": "nyt-v5", "applicationName": "article", "al": {"android": {"url": "nytimes://reader/id/1194816770029", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2008/09/21/business/21cong.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2008/09/21/business/21cong.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "twitter": {"app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nytimes://reader/id/1194816770029"}}, "site": "@nytimes", "url": "https://www.nytimes.com/2008/09/21/business/21cong.html", "title": "Administration Is Seeking $700 Billion for Wall Street", "description": "The Bush administration is requesting virtually unfettered authority for the Treasury to buy mortgage-related assets.", "image": "https://static01.nyt.com/images/icons/t_logo_150_black.png", "card": "summary", "creator": "herszenhorn"}, "robots": "noarchive", "hdl_p": "Administration Is Seeking $700 Billion for Wall Street in Possible Record Bailout", "description": "The Bush administration is requesting virtually unfettered authority for the Treasury to buy mortgage-related assets.", "genre": "News", "articleid": 1194816770029, "usageTerms": "https://help.nytimes.com/hc/en-us/articles/115014893968-Terms-of-sale", "hdl": "Administration Is Seeking $700 Billion for Wall Street", "pdate": 20080920, "utime": 20141128024114, "ptime": 20080920131527, "DISPLAYDATE": "Sept. 20, 2008", "dat": "Sept. 20, 2008", "lp": "The Bush administration is requesting virtually unfettered authority for the Treasury to buy mortgage-related assets.", "msapplication-starturl": "http://www.nytimes.com", "cre": "The New York Times", "slug": "21cong", "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/business/index.jsonp", "published": "2008-09-20T13:15:27-04:00", "modified": "2014-11-28T02:41:14-05:00", "section": "Business Day", "section-taxonomy-id": "104D1E63-9701-497B-8CF4-A4D120C9014E", "section_url": "https://www.nytimes.com/pages/business/index.html", "top-level-section": "business", "author": "https://www.nytimes.com/by/david-m-herszenhorn", "tag": "United States Politics and Government"}, "sectionfront_jsonp": "https://static01.nyt.com/services/json/sectionfronts/business/index.jsonp", "og": {"url": "https://www.nytimes.com/2008/09/21/business/21cong.html", "type": "article", "title": "Administration Is Seeking $700 Billion for Wall Street", "description": "The Bush administration is requesting virtually unfettered authority for the Treasury to buy mortgage-related assets.", "image": "https://static01.nyt.com/images/2008/09/20/business/20bush.1-75.jpg"}, "fb": {"app_id": 9869919170, "pages": 993603507345855}, "author": "David M. Herszenhorn", "tone": "news", "byl": "By DAVID M. HERSZENHORN", "PT": "article", "CG": "business", "PST": "News", "tom": "News", "edt": "NewYork", "des": "United States Politics and Government", "org": "Treasury Department", "keywords": "Mortgages,Treasury Department,Credit,United States Economy,National Debt (US),United States Politics and Government", "thumbnail": "https://static01.nyt.com/images/2008/09/20/business/20bush.1-75.jpg", "thumbnail_height": 75, "thumbnail_width": 75, "dfp-ad-unit-path": "business", "dfp-amazon-enabled": "false"}, "movies": [], "publish_date": 1221969600.0, "source": "http://www.nytimes.com", "summary": ""}