{"url": "www.thetalko.com/14-reasons-why-you-shouldnt-envy-the-kardashians/", "text": "The Kardashians have awoken many feelings in their viewers, with one of those feelings being envy. It is sometimes irresistible to not envy them. I mean, come on!! Their jobs seem pretty easy, they get paid millions of dollars, travel all around the world, dress to the nines, look gorgeous all the time and have a close knit family.\n\nIt seems like they have it all right? Well… that is for you to decide. The reality of things is that even if they became famous for doing reality TV, everything that we see on the screen is not real at all.\n\nRead this list and realize just whose life you would rather have. You might realize how amazing your life is and why you wouldn’t change it for the world.\n\n14 They will never have a 'normal' life again\n\nvia:youtube.com\n\nThis family is so famous they will probably never have normal lives again. They are Michael Jackson famous, if anything they are harassed more than he was. They can't even leave their homes without needing to look flawless as the paparazzi are always waiting to catch their every move. Wouldn't you go crazy?\n\n13 Their Beauty is Not As Real As It Seems\n\nvia:www.thekyliejenner.com\n\nThey make money out of their beauty, it is one of their most important assets, along with their bums. That is why it's no surprise that they have to invest millions of dollars in looking absolutely perfect every day.\n\nIt’s been reported by the Daily Mail that Kim Kardashian spends over $130,000 dollars a year on beauty treatments alone. With that amount of cash anyone would look flawless.\n\nSo next time you envy her beauty just think she pays a very high price tag to look that way.\n\n12 Pressure to be Beautiful\n\nVia: Youtube.com\n\nWomen around the world feel this constant pressure as well, but can you imagine how stressful it must be when your income depends on it and you have millions of eyes on you?\n\nKylie Jenner is one of the main examples of the pressure that can lead to an already beautiful girl to get a cosmetic procedure to look a certain way. She was not even 18 years old when she got her lips pumped to (I’m assuming) look like her older sisters, whose looks are reported as “beautiful” thanks to all of that cash they spend on it.\n\nPretty ironic isn’t it? That the older Kardashians negatively influenced their younger sibling into getting cosmetic procedures to looks like them.\n\n11 Stolen Childhoods\n\nvia:www.yournextshoes.com\n\nKylie and Kendal have spent nearly half their lives recorded by the cameras for the world to see. They’ve had to deal with very personal issues and have cameras record their every reaction, limiting their privacy.\n\nTeenage years are very difficult for most human beings; it is a difficult stage that involves a lot of changes and behavior that many of us wish to forget. These young girls have the entire world watching their every move, their lives, the failures and successes and it’s all being recorded for the world to remember.\n\nThe last years of their childhood was spent with other people around their house just recording everything, with their sisters putting on a show. Can you imagine what this can do to the mind of a child?\n\nKylie and Kendal don’t deserve our envy. They deserve our compassion.\n\n10 The Kardashians Have Suffered Great Pain\n\nvia:www.dailymail.co.uk\n\nThey’re humans with lives that have not been all perfect and they still smile, laugh and go on. They seem so happy most of the time and that’s actually something nice to see given that they’ve also had to deal with very painful events in their lives.\n\nTheir marriages and relationships have been ridiculed, especially Kim's 72 hour marriage to Kris Humphries. Khloe has the whole world giving opinions on her marriage and Kourtney is dealing with a very public breakup.\n\n9 They Have to Deal With a Lot of Humiliation\n\nvia:radaronline.com\n\nTo us the Kardashians might seem powerful; they are after all celebrities with millions of fans. Nevertheless in the celebrity world there are certain “categories”, do not be fooled by their millions of fans.\n\nWithin the Hollywood celebrity world the Kardashians are far away from being a part of the exclusive A list. They have actually been heavily criticize by BIG names in the entertainment industry like Jon Hamm, Daniel Craig, Michael Buble, Mariah Carey, Cher, Reese Witherspoon and even Barak and Michelle Obama.\n\nThey are considered too trashy, fame obsessed and foolish. Barack Obama doesn’t even like it when his daughters watch their show.\n\n8 Their Fame is a Result of a Scandalous Sex Tape\n\nvia:darkhorsenews.com\n\nIt’s no surprise to anyone that the Kardashians/Jenners owe their fame to Kim’s scandalous sex tape. As Barbara Walter said in an interview with the Kardashians “You don’t act, you don’t sing, you don’t dance. You don’t have…. Forgive me, any talents”.\n\nTheir fame came mainly as a product of Kim’s sex tape and Kris Jenner’s excellent capacity for marketing it to their advantage. If it wasn’t for that, it’s very, extremely unlikely we would know their names today.\n\n7 Kylie and Kendal Went Through their Dad’s Gender Transition\n\nWe all love Caitlin, there’s no doubt about that. The world felt proud when Bruce was brave enough to go through the public transition of becoming Caitlyn.\n\nNevertheless for Kylie and Kendal it was a pretty big emotional trauma. It was, after all, saying goodbye to their father Bruce and saying hello to Caitlyn.\n\nAnyone in the world would find this emotionally difficult, and to make matters worse Kylie and Kendal had to go through it in the public eye. In several chapters of Keeping Up With The Kardashians you can easily notice a troubled Kylie finding it hard to come to terms to her father’s decision.\n\n6 They Live Superficial Lifestyles\n\nvia:www.eonline.com\n\nAccording to Psychology Today, leading a materialistic and superficial life style can enhance the probability of developing depression.\n\nIt is the lack of spiritual and emotional fulfillment that can help create mental health issues, especially when narcissism is involved in the formula.\n\nAs we can see the Kardashian/Jenners expose every detail of their lives. Not only on their reality T.V. show but also on their social media, perfectly yet falsely portraying themselves in their best snapshots. These symptoms are categorized as symptoms of narcissistic personality disorder, which can lead to emotional trauma.\n\n5 They’re Self Obsessed\n\nvia:www.thedailybeast.com\n\nWhat the world needs is more empathetic human beings who are concerned about the well being of others, not people who are only concerned about themselves.\n\nThe Kardashians have famously portrayed themselves as self obsessed with their millions of selfies, which have led their younger sisters, Kylie and Kendal to follow the same footpath.\n\nBeing self obsessed can actually cause health problems, just like His Holiness the Dalai Lama says: People who have the tendency to use more self-referential terms (I, me, myself) tend to have more health problems and earlier deaths. Being self-absorbed has an immediate effect of narrowing one’s focus and blurring one’s vision.”\n\n4 Their Father is Known to Have Played Devil’s Advocate\n\nVia: Mirror.co.uk\n\nEveryone wants to admire their father for great qualities and for being a good person. Unfortunately for the Kardashians, their dad is known to have played devil’s advocate by famously defending O.J. Simpson in his murder trial after killing his wife Nicole Brown.\n\nO.J. Simpson’s case became famous because the world was certain that he got away with murder, thanks to his magnificent attorney Robert Kardashian.\n\nYes, their father was a very successful lawyer, but one with values that leaves many wondering about his integrity.\n\n3 Their Mother Has a Questionable History\n\nvia:www.dailymail.co.uk\n\nKris Jenner had an affair with Todd Waterman while still being married to Robert Kardashian. It has also been reported that she would leave her children at home while she enjoyed the good life.\n\nIt can't be pleasing to know that your mother cared more about her lover than her children. Rob Kardashian Jr. was just a baby when his mother would run off at night to have fun.\n\nIf this where not enough, in Robert Kardashian’s diary it was reported that Kris Jenner would beat up Kim Kardashian when she was a young teenager and she would also come home drunk.\n\n2 They Fight A Lot\n\nvia:www.youtube.com\n\nIt’s normal to fight with your siblings. Nevertheless to anyone who has ever watched the show they’d be very accustomed to always seeing them fight. Even over the simplest and most foolish things of all, like when Kim fought with her mother over an apartment in New York.\n\nInstead of feeling grateful and happy to have such a marvelous life style they focus on the little things to make a drama over anything. It kind of makes us wonder, are they even happy?\n\n1 They Are Very Much Hated\n\nvia:www.youtube.com\n\nThe Kardashians are those people we all love to hate. They might have millions of followers and fans, but these people are probably smaller in quantity than the haters. It doesn’t take long to scroll down the comments section on stories about them and read many negative comments about them.\n\nThey’ve had to grow a very thick skin to put up with a lot of the criticism that gets thrown their way. They are not like other celebrities who tend to have more fans than haters. Kim Kardashian in particular has appeared in several lists as one of the most hated people in the entertainment industry.\n\nOuch! No one would like to be on that list.\n\nSources:dailymail.co.uk, therichest.com, dailymail.co.uk, elephantjournal.com", "images": ["http://www.thetalko.com/public/build/images/re-logo-full-white.04d384d8.svg", "https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "http://www.thetalko.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2016/02/article-2308286-1942C024000005DC-676_964x645-e1456949130302.jpg", "https://www.facebook.com/tr?id=1803658626514362&ev=PageView&noscript=1", "http://www.thetalko.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "http://www.thetalko.com/public/build/images/tv-logo-full-white.642d3d01.svg"], "top_img": "https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2016/02/article-2308286-1942C024000005DC-676_964x645-e1456949130302.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.thetalko.com/14-reasons-why-you-shouldnt-envy-the-kardashians/", "title": "14 Reasons Why You Shouldn't Envy The Kardashians", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "The Kardashians have awoken many feelings in their viewers, with one of those feelings being envy. It is sometimes irresistible to not envy them. I mean, come on!! Their jobs seem pretty easy, they ge", "og": {"title": "14 Reasons Why You Shouldn't Envy The Kardashians", "type": "article", "image": {"identifier": "https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2016/02/article-2308286-1942C024000005DC-676_964x645-e1456949130302.jpg", "width": 816, "height": 503}, "url": "https://www.thetalko.com/14-reasons-why-you-shouldnt-envy-the-kardashians/", "locale": "en_US", "description": "The Kardashians have awoken many feelings in their viewers, with one of those feelings being envy. It is sometimes irresistible to not envy them. I mean, come on!! Their jobs seem pretty easy, they ge", "site_name": "TheTalko"}, "article": {"published_time": "2016-03-02T15:03:29Z", "section": "Entertainment"}, "fb": {"app_id": 1470061169975403}}, "movies": [], "publish_date": 1456931009.0, "source": "http://www.thetalko.com", "summary": ""}