{"url": "https://web.archive.org/web/20180413154033/http://usanews24h.tk/index.php/2018/04/12/obama-announces-bid-to-become-un-secretary-general/", "text": "Barack Obama has announced plans to become secretary general of the United Nations, allowing him to advance his globalist agenda on the world’s stage.\n\nAccording to Al-Jarida, Obama has no intention to step away from the spotlight, much to the dismay of other world leaders such as Israeli Prime Minister Benjamin Netanyahu:\n\nIsraeli Prime Minister Benjamin Netanyahu reportedly is planning payback for President Obama’s dismissing Mr. Netanyahu’s objections to the Iran nuclear deal last year. Mr. Netanyahu is said to be rallying moderate Arabs to thwart Mr. Obama’s bid to become the Secretary-General of the United Nations after he leaves the White House next year.\n\nMr. Obama has already discussed the issue with Republican, Democratic and Jewish officials in the United States, according to Kuwaiti newspaper Al-Jarida.\n\nMr. Netanyahu recently is said to have gotten wind of Obama’s plans which he calls the Obama Project. “Wasn’t eight years of having Obama in office enough?” Mr. Netanyahu is quoted in the Kuwaiti daily as telling associates. “Eight years during which he ignored Israel? And now he wants to be in a position that is liable to cause us hardships in the international arena.”\n\nTownhall.com reports: Further gripes Israel has with President Obama include the U.S. “moving closer to the Muslim Brotherhood, toppling the regime of Hosni Mubarak, and attempts to ally itself with political Islam,” the paper quotes a Netanyahu aide as saying.\n\nU.N. Secretary General Ban Ki-moon’s term expires in early 2017, making Obama’s bid for the position a possibility.\n\nLast year after his speech at West Point, some pointed out that he sounded an awful lot like he was campaigning for the role.", "images": ["https://web.archive.org/web/20180413154033im_/http://usanews24h.tk/wp-content/uploads/2018/04/Special-Report-Anchors-3-1-678x381-2.jpg", "https://web.archive.org/web/20180413154033im_/http://usanews24h.tk/wp-content/uploads/2018/04/Screenshot_1-80x60.png", "https://web.archive.org/web/20180413154033im_/http://usanews24h.tk/wp-content/uploads/2018/04/newsEngin.21704343_berman-donnally-80x60.jpg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180413154033/http://usanews24h.tk/index.php/2018/04/12/obama-announces-bid-to-become-un-secretary-general/", "title": "Obama Announces Bid To Become UN Secretary General – Usa News", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "generator": "WordPress 4.9.5", "fb": {"pages": 1436219273117667}, "ia": {"markup_url": "http://usanews24h.tk/index.php/2018/04/12/obama-announces-bid-to-become-un-secretary-general/?ia_markup=1"}}, "movies": [], "publish_date": 1523505600.0, "source": "https://web.archive.org", "summary": ""}