{"url": "www.therichest.com/lifestyles/15-reasons-why-jennifer-lawrence-cant-find-a-celeb-partner/", "text": "Jennifer Lawrence is an American actress who is best-known for her role as Katniss in The Hunger Games, but you might also know her from her role as Mystique in X-Men. She was once named one of the most influential people in the world back in the year 2013, but she has since been heard making some pretty questionable remarks that have people all over the world angry with her. Jennifer is known to be a very attractive young actress, but she hasn't exactly had the best of luck with men during her time in the spotlight, and that left us wondering what it is about this beautiful woman that has men running away faster than they could say bye.\n\nRELATED: Jennifer Lawrence's Response To Brad Pitt Dating Rumors\n\nIt turns out that this actress is not nearly as wonderful as we once thought she was, but perhaps if she just lightened up a bit and decided to be comfortable with herself, maybe she wouldn’t be so bad. Even though she may be referred to as “America’s Sweetheart” in the media, people are starting to see past her sweetheart act and realized that a lot of the stuff that she says and does make her look like the exact opposite of a sweetheart. From her sketchy dating history to her not-so-nice comments, it is no wonder why men are steering clear. There have been many failed relationships throughout the years with the actress and after doing some research we have compiled a list of 15 reasons why she might just be every Hollywood man’s worst nightmare.\n\n15 She Does Not Use Social Media\n\nvia: etonline.com\n\nSocial media has blown up over the years—it has just about taken over phone calls and texting, and just about everyone you know has it. There are even grandparents on Facebook using it as a way to communicate with their family. There are a ton of social media platforms out there that have taken over the lives of many people. For instance, Facebook has become the biggest social media platform that there is and it has done wonders for connecting people, but it has also been a huge relationship destroyer.\n\nAlthough Jennifer Lawrence does have some social media accounts out there, she only ever uses them if she has absolutely no other choice. The actress has said that she hates the idea of social media and the people who use it, so obviously she does not want the men that she dates to be active social media users. This might not seem like a crazy request at first, but for people in Hollywood, social media plays a big part in how they market things. So, this could very easily be a reason why men aren’t too keen on Jennifer.\n\n14 She Is Super Awkward\n\nvia: youtube.com\n\nWe all know how awkward dating and relationships can be, especially in the beginning before you really know the person that you are seeing, but sometimes that awkwardness doesn't go away after knowing each other for a while. Let’s be honest, most men don’t want to spend their lives with a woman who never gets comfortable with them or is unable to let loose.\n\nRELATED: Times Jennifer Lawrence Was Too Much To Handle\n\nFor Jennifer Lawrence, dating is as awkward as it gets, romance is often times something that she laughs about, and intimacy is just downright weird to her. That’s not saying that she doesn't enjoy romance, but she definitely does not know how to take it seriously. How is a man supposed to take her out on a nice date or share an intimate moment with her, if she isn’t taking it seriously? Maybe this has played a role in her failed relationships thus far.\n\n13 She Has A Long History Of Exes\n\nvia: metro.co.uk\n\nIf you are the average person, then you have probably had your fair share of ex-boyfriends or girlfriends. This is totally normal. After all, you don't want to just settle down with the first person that you meet. Instead, you want to see what's out there and make sure you are settling down with the right person for you. When you are under the spotlight, however, everyone tends to know your dating history.\n\nWhen you are as popular as Jennifer Lawrence is, the people who you have dated are certainly not a secret, and things like how long you have been with someone, and just about every date you have ever gone on is no longer confidential. For instance, we know that Jennifer has dated Nicholas Hoult, Chris Martin, Liam Hemsworth, Darren Aronofsky, and Graham Martin, just to name a few. It is possible that news of who she has dated in the past, or how many people she has dated in the past, has had an impact on how other men in Hollywood feel about her.\n\n12 She Wants To Jump Into Marriage\n\nvia: popsugar.com\n\nMarriage is a sacred bond that two people enter into together and it usually does not happen until they have spent at least a couple of years getting to know one another. It is a very touchy subject to some people, mostly men because they do not want to feel rushed or pressured into having to commit to just one person for the rest of their lives. So, it is safe to say that marriage is usually a topic that you would hold off on until you have known each other for a long time and are nice and comfortable with one another.\n\nJennifer Lawrence must not have gotten that memo because, in an interview, she talked about how she would love to jump into a marriage. In fact, she said that she knows exactly what she wants in a man and that if she were to find that perfect man, she definitely would not hesitate to talk marriage. It is easy to see why news of this might scare away any potential boyfriends, especially Hollywood men, who are already so committed to their careers.\n\n11 She Has Body Image Issues\n\nvia: giphy.com\n\nBody image issues are something that almost all women struggle with today, especially when we feel as though we have to live up to the expectations set by female figures in Hollywood. So it may come as a surprise to some of you that Jennifer Lawrence struggles with these issues herself, for others though, it is quite obvious. Jennifer has said in interviews that in Hollywood, as an actress, she is considered to be obese. Apparently, you have to be super tiny to live up to that awesome Hollywood standard, but you would probably agree with us when we say that she looks great!\n\nThere have been some rumors circulating that she may or may not have an eating disorder, and she always seems to be shoving food in her mouth and joking about eating, but again, these are just rumors. Regardless of whether the rumors are true, no man likes it when a girl calls herself fat or doesn't see herself the way that they see her. Sometimes it can even take its toll on a relationship, so it is a strong possibility that men are leaving whenever they notice her bad habit.\n\n10 Her Striking Good Looks Could Make Any Man Paranoid\n\nvia: pinterest.com\n\nDespite the fact that Jennifer Lawrence does not see herself the way that most of us see her, we have to be honest and admit the fact that she is beautiful. One would think that men would be throwing themselves at her and that they would be super happy to say that they were able to land someone as hot as her, but that does not seem to be the case at all. Maybe this has something to do with the fact that they have self-image issues themselves, but it could also be that they are intimidated by how good-looking she is and do not find her approachable. Some men refuse to date women who are significantly more attractive than they are because they are afraid that it will make them look bad. This could most certainly be a big reason as to why she is ever Hollywood man’s worst nightmare when it comes to dating.\n\nRELATED: Jennifer Lawrence's Hair And Makeup Evolution In Photos\n\n9 She Wants Someone Who Does Not Know Who She Is\n\nvia: cnn.com\n\nWhen you are an actor or actress in Hollywood and have starred in some pretty big name movies and shows like Jennifer has, then it is safe to say that you would be hard-pressed to go somewhere where no one knows who you are. Which is why it came as such a shocker when Jennifer Lawrence said that her ideal man would have no idea who she was. It is easy to see why she would like to meet someone who does not know who she is because when you are in the spotlight like she has been, rumors come out and everyone tends to think that they know everything about you when really they know nothing. However, if she is waiting to settle down with a guy until she does meet someone who does not know here, then she might be waiting for a very long time, possibly even forever.\n\n8 She Is Extremely Successful\n\nvia: urnaija.com\n\nWhen it comes to dating and relationships, there are a lot of men out there who like to be the successful ones in the relationship, mainly in terms of a career. This could be an issue for Jennifer Lawrence because of just how successful she is as an actress. Some men could find this to be a huge turn-off, or they could be intimidated by the fact that she is better off in her career than they are. There is nothing wrong with a little jealousy, but it is clear to see why some Hollywood men might find her to be a nightmare to date, especially if everyone is talking about her she is landing roles, while they seem to be having trouble landing roles themselves.\n\nOf course, this does not speak for all Hollywood men, as there are men out there who are more successful than her, as well as men who do not become so easily jealous. However, this combined with all of her other little quirks, is definitely something that could drive men away before a first date would even take place.\n\n7 She Is Always Lying\n\nvia: dailymail.co.uk\n\nWe all tell some white lies throughout our lives and usually, we are able to do this without anyone finding out or dealing with any repercussions. Lying is typically frowned upon, but let’s be honest here, who hasn’t said they were sick to get out of going to work or said that they loved the food that their mom cooked when really, it was atrocious? It is safe to say that everyone on earth has lied a good handful of times in their lives and sometimes we do it without even realizing that we are doing it. There are, however, people out there who take lying too far, and that is never a trait that someone wants in a significant other.\n\nWhen you are someone like Jennifer Lawrence however, and just about every moment of your life is closely followed by almost the entire world, even the smallest lie is usually discovered. For instance, when Jennifer Lawrence told the world that she would be taking a year off of acting to focus on activism, it was really just her way of saying that she wanted to take a little time off before decided what movie to get into next but that she didn’t want to sound lazy for doing it. It was quickly discovered that she was not doing a single thing for activism and the articles about her many lies started to spread like wildfire.\n\n6 She Is Very Intimidating\n\nvia: themarysue.com\n\nThere are plenty of strong, independent, and tough women out there these days. Some of these women are stronger than most men and could take them in a fight with no problem at all. While Jennifer Lawrence is not necessarily the strongest woman out there, she has been known to be able to stand up for herself and could take on a few guys she knows. The actress attributes this to the fact that she was raised in a house full of boys and was forbidden from playing with and making friends with all the girls in her neighborhood. This ultimately led her to take on more of a tomboy role in life, and she learned how to think, talk, and act like a boy. It also leads her to become quite competitive, and she definitely does not take any BS from anyone. With all of that being said, this is something that a lot of Hollywood men might find to be a huge turn-off because most of them want a more sweet and traditional female in their lives.\n\n5 She Takes On Some Crazy Roles\n\nvia: youtube.com\n\nActing is a difficult talent to have, for some it comes naturally, but for others, it takes a lot of hard work and dedication. It can be tough to fall into certain roles, especially the ones that you have no real life experiences to associate it with. Yet somehow, the acting in all the TV shows and movies that you see today is so believable in the final cut. If it were not for actors and actresses coming out and talking about how difficult it is in interviews, we would not know just how much work goes into portraying yourself as someone totally different.\n\nToo bad the same can not be said for Jennifer Lawrence because, in the movies where she plays a totally crazy girl, she makes it look so believable that we started to question whether she was really acting or not. Maybe acting just comes that naturally to her, perhaps she is just so good that she can play any personality without any issues at all. However, she has mentioned that she loves playing the role of a crazy girl, and maybe that’s because she is a little crazy herself. This could be a pretty big reason why she is every Hollywood man’s worst nightmare.\n\n4 She Runs Away When Things Get Real\n\nvia: isthismoviesuitable.com\n\nThere are two different types of people out there in the dating world — the ones who are ready to commit and be loyal, and then there are the ones who run at the first sight of anything too serious. Jennifer Lawrence just so happens to be the type that runs away from serious relationships. This may be hard to believe, seeing as how she has talked about being ready for marriage, but it is true. She has not taken a single one of her relationships seriously, and word has it that whenever even the slightest disagreement comes up, she runs away from the conversation and cuts her ties with that person instead of talking things out like a normal person would. It is obvious why this would be a turn-off for many men, and even more obvious as to why this would make her a nightmare for any Hollywood man.\n\n3 She Is Against Feminism\n\nvia: rumorsfeed.com\n\nJennifer Lawrence has dubbed herself a full-on feminist, which is the cool thing to be in Hollywood these days, but actions speak louder than words, and her actions have certainly shown us differently over the years. Maybe it was the strict household that she lived in and growing up not being allowed to play with other girls that made her take gender roles more seriously than most. Jennifer Lawrence was told growing up that she was not allowed to play with other girls, and other than her mother, she was the only female in her household. She was taught to play rough with the boys, walk, talk, and act like a boy. So, maybe this is why she is so set in her ways when it comes to what a woman should and should not do, although some people might think that this should have made her grow into a woman who thought differently.\n\n2 She Conforms To Gender Roles\n\nvia: youtube.com\n\nGrowing up, Jennifer Lawrence had quite a few brothers but no sisters. In fact, she and her mom were the only women in their household. She grew up watching her mom having dinner cooked and on the table, ready for her father when he would arrive home from work, and how she was expected to handle all of the cleaning, cooking, and children on her own. Of course, seeing her mom handle all of these things on her own probably should have made her realize that was not what she wanted for herself, or that any woman should have to conform to these basic gender roles, but instead she grew up believing that this way the way things should be, and she still thinks that way to this day. Of course, this will be a definite plus for anyone that she ends up marrying, but it is not how things should be.\n\n1 Her Romantic Roles With Male Actors\n\nvia: independant.co.uk\n\nHollywood movies often times tend to be filled with passionate and intimate moments between an actor and actress, and although these are just scenes of two people acting, they often times do involve the two people being very close. This could be a problem in many Hollywood relationships, It can't be easy watching your partner be that up close and personal with another man or woman.\n\nJennifer Lawrence is certainly no stranger to these kinds of scenes and although she has admitted that she hates doing those scenes and finds them to awkward and weird, it could certainly play a role in any relationship that she enters into. After all, she is a very attractive woman, despite what she might think about herself. So, seeing her do these scenes with other just as attractive men could be very hard on someone that she is dating.\n\nNEXT: Pics Of Jennifer Lawrence That Are Hot AF", "images": ["https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "http://www.therichest.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://static2.therichestimages.com/wordpress/wp-content/uploads/2018/03/Untitled-design-1-1.png", "http://www.therichest.com/public/build/images/hc-logo-full-white.5f66cfe4.svg", "http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "http://www.therichest.com/public/build/images/th-logo-full-white.7684e614.svg", "https://www.facebook.com/tr?id=150820128703309&ev=PageView&noscript=1"], "top_img": "https://static2.therichestimages.com/wordpress/wp-content/uploads/2018/03/Untitled-design-1-1.png", "keywords": [], "authors": [], "canonical_link": "https://www.therichest.com/lifestyles/15-reasons-why-jennifer-lawrence-cant-find-a-celeb-partner/", "title": "15 Reasons Why Jennifer Lawrence Is A Lot To Handle", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Despite Jennifer Lawrence's career success, she's had trouble with relationships in the past. We break down why she just can't seem to find love.", "og": {"title": "15 Reasons Why Jennifer Lawrence Is A Lot To Handle", "type": "article", "image": {"identifier": "https://static2.therichestimages.com/wordpress/wp-content/uploads/2018/03/Untitled-design-1-1.png", "width": 1200, "height": 600}, "url": "https://www.therichest.com/lifestyles/15-reasons-why-jennifer-lawrence-cant-find-a-celeb-partner/", "locale": "en_US", "description": "Here are 15 reasons why the stunning and talented Hollywood star just can't seem to find love.", "site_name": "TheRichest"}, "article": {"published_time": "2018-03-12T12:03:57Z", "section": "Lifestyle"}, "fb": {"app_id": 124380934395811}}, "movies": [], "publish_date": 1520856237.0, "source": "http://www.therichest.com", "summary": ""}