{"url": "ew.com/movies/2017/02/26/bill-paxton-dead-celebrities-react/", "text": "The entertainment industry is mourning Bill Paxton, who died Sunday at the age of 61.\n\nStars like Tom Hanks, Charlize Theron, Jordan Peele, William Shatner, Rob Lowe, Kumail Nanjiani, and Jamie Lee Curtis paid tribute to the late actor — best known for his roles in films like Aliens, Twister, Apollo 13, True Lies, Titanic, and the Golden Globe-nominated HBO series Big Love — on social media soon after the news of his death broke.\n\n“Devastated by the sudden loss of my close friend and one of the finest actors in the business, Bill Paxton. Renaissance man, raconteur and uniquely American national treasure,” Lowe tweeted Sunday morning. “His friendship was a blessing… In his memory, on this Oscar Sunday, watch One False Move or A Simple Plan to see this lovely leading man, at his finest.”\n\nReferencing Paxton’s role in Aliens, Josh Gad added: “The loss of #BillPaxton is beyond crushing. Once again, an icon, far too young, gone far too soon. Goodbye Private Hudson.”\n\nRead on for more industry reactions to Paxton’s death.\n\nBill Paxton was, simply, a wonderful man. A wonderful man… Hanx. — Tom Hanks (@tomhanks) February 26, 2017\n\nSome of my favorite memories are of floating around in a tiny vessel with big hearted,hilarious,brilliant Bill Paxton. Sad day. — Kevin Bacon (@kevinbacon) February 26, 2017\n\nCrushing. #RIPBillPaxton A gr8 talent & spirit. His passion contributed so much 2 #Apollo13 & all his wrk. We'll miss the hell out of U Bill https://t.co/j2Khv6fmCP — Ron Howard (@RealRonHoward) February 26, 2017\n\nHe made this movie great–he acted his heart out. What a talented man. My thoughts are with his family. pic.twitter.com/rUcmmYME3h — Helen Hunt (@HelenHunt) February 26, 2017\n\nYou were a great friend to me, Bill. AND one of the finest actors to share a set with. Sending so much love to Bill Paxton's family. — Charlize Theron (@CharlizeAfrica) February 26, 2017\n\nNooooo. Bill Paxton is gone. Such a funny, talented, loving human. Louise & the children & family my ❤& support 2 u. #truelies pic.twitter.com/d4zleWdOrR — Jamie Lee Curtis (@jamieleecurtis) February 26, 2017\n\nBill Paxton could play any role, but he was best at being Bill – a great human being with a huge heart. My thoughts are with his family. — Arnold (@Schwarzenegger) February 26, 2017\n\nThis man was a prince. Great actor. Never an unkind word. Sorry for his family & all of us who loved & had the honor to know/work with Bill. https://t.co/wI7GlNsG95 — Tom Arnold (@TomArnold) February 26, 2017\n\nCondolences to the family of Bill Paxton. I just heard the news. 😢 — William Shatner (@WilliamShatner) February 26, 2017\n\nALIENS, NEAR DARK, WEIRD SCIENCE, TRUE LIES, APOLLO 13, THE DARK BACKWARD, BIG LOVE, THE LAST SUPPER (1) — Patton Oswalt (@pattonoswalt) February 26, 2017\n\nAnd then masterclass performances in TRESPASS, A SIMPLE PLAN, ONE FALSE MOVE and FRAILTY (2) — Patton Oswalt (@pattonoswalt) February 26, 2017\n\nBill Paxton was a craftsman with the kind of acting range most of us only dream of. I can't believe he's gone. Unacceptable. (3) — Patton Oswalt (@pattonoswalt) February 26, 2017\n\nBill Paxton was notoriously one of the nicest people in the industry. He also gave us some of the all-time most iconic movie moments. — Jordan Peele (@JordanPeele) February 26, 2017\n\nReally bummed to hear about Bill Paxton this morning. Great guy, energy and always smilin'. Strength to the Paxton family. #restinlove — Dwayne Johnson (@TheRock) February 26, 2017\n\nBill Paxton. A very talented man. As skilled with comedy as he was with drama. Carpe Diem. #rip pic.twitter.com/2ULKQJUzI4 — Zach Braff (@zachbraff) February 26, 2017\n\nDevastated by the sudden loss of my close friend and one of the finest actors in the business, Bill Paxton. Renaissance man, raconteur and — Rob Lowe (@RobLowe) February 26, 2017\n\nuniquely American national treasure. His filmography speaks for itself. His friendship was a blessing. My love to Bunny, James and Lydia. — Rob Lowe (@RobLowe) February 26, 2017\n\nIn his memory, on this Oscar Sunday, watch \"One False Move\" or \"A Simple Plan\" to see this lovely leading man, at his finest. — Rob Lowe (@RobLowe) February 26, 2017\n\nBill Paxton was hands down one of the greatest guys that I have ever met. I feel lucky to have called him my friend. Bill, I love you. RIP. — Aaron Paul (@aaronpaul_8) February 26, 2017\n\nMy first day on Spy Kids 2 was with Bill Paxton. He came to my trailer & said hello and I told him I loved Titanic. Nicest guy in the world. — Emily Osment (@EmilyOsment) February 26, 2017\n\nRIP Bill Paxton. So very good every time. In addition to his iconic roles, he was amazing in Near Dark, A Simple Plan & Edge of Tomorrow. — Kumail Nanjiani (@kumailn) February 26, 2017\n\nVery sad to hear about Bill Paxton. His talent, enthusiasm and energy were unique. Our thoughts are with his family pic.twitter.com/W4IVuILHxv — Cary Elwes (@Cary_Elwes) February 26, 2017\n\nUgh RIP Bill Paxton. Hudson in \"Aliens\" and Simon in \"True Lies\" are awesome characters — Ike Barinholtz (@ikebarinholtz) February 26, 2017\n\nThoughts and prayers go out to the family of #BillPaxton who died at 61 due to surgical complications. Could not be nicer. #RIP pic.twitter.com/zvgWTVLPSX — Al Roker (@alroker) February 26, 2017\n\nBill Paxton was the fuckin man. So glad I was drunk enough to tell him exactly that one time at comic con. Legend. — Anders Holm (@ders808) February 26, 2017\n\nThe loss of #BillPaxton is beyond crushing. Once again, an icon, far too young, gone far too soon. 😢 Goodbye Private Hudson. — Josh Gad (@joshgad) February 26, 2017\n\nOnly 61! Sad to read on #Oscars day that talented actor Bill Paxton has passed. My thoughts & prayers to his family https://t.co/8K26qmKP1Y — Marlee Matlin (@MarleeMatlin) February 26, 2017\n\nSad news about Bill Paxton – too young. Always humanity, decency and touches of humor shining through his work. RIP. — Jeffrey Wright (@jfreewright) February 26, 2017\n\nI know im celebrating my baby's bday here but I just read about Bill Paxton. This is horrible news. What a great loss to cinema — michelle visage (@michellevisage) February 26, 2017\n\nUnbelievable. Bill Paxton is gone. Shocking. RIP — Michael Chiklis (@MichaelChiklis) February 26, 2017\n\nI am so saddened by Bill Paxton's passing. Had the pleasure of meeting him a few times in recent years and he was truly the loveliest guy. — edgarwright (@edgarwright) February 26, 2017\n\nNo!!! Bill Paxton passed away at 61. RIP a fine actor. 😞 — Dean Cain (@RealDeanCain) February 26, 2017\n\nHeartbroken to hear about #BillPaxton passing away! He was one of those actors that you don't… https://t.co/ftKyFNyIqp — Melissa Joan Hart (@MelissaJoanHart) February 26, 2017\n\nGrowing up walking through Blockbuster if Bill Paxton was on the cover I'd rent it. He easily helped shape my love of movies. RIP — Raviv Ullman (@ravivullman) February 26, 2017\n\nI am stunned & saddened at the passing of Bill Paxton. I just worked with him recently. A warm and beautiful soul and a talented actor. RIP — Lou Diamond Phillips (@LouDPhillips) February 26, 2017\n\nRest In Peace my sweet friend. pic.twitter.com/1QC7pzDZPz — Julie Benz (@juliebenz) February 26, 2017\n\nMy heart goes out to Bill Paxton's loved ones. A fantastic, hard working, devoted actor, father and director. — John Carroll Lynch (@MrJCLynch) February 26, 2017\n\nJust clicked on Twitter and discovered Bill Paxton has died at 61. So sorry to have lost him. I thought he was… https://t.co/hxFFvNesgL — Anne Rice (@AnneRiceAuthor) February 26, 2017\n\nWhat sad sad news.Bill Paxton was a genuinely good guy and an actor of great depth .Love and prayers for peaceful hearts to his family. — Melissa Gilbert (@MEGBusfield) February 26, 2017\n\nSaddened by the shocking loss of Bill Paxton. The greatest guy & wonderful actor. His enthusiasm and passion was infectious. See his films! — Ralph Macchio (@ralphmacchio) February 26, 2017\n\nSo sorry to hear about Bill Paxton's death. A lovely man. My thoughts are with his family. — Denis O'Hare (@denisohare) February 26, 2017\n\nGoodbye Bill Paxton. Thank you for decades of entertainment & for giving us some of the most quotable characters that still endure. #RIPchet — Tony Hawk (@tonyhawk) February 26, 2017\n\nOh #BillPaxton you were one of my favs, in everything #RIP — Constance Zimmer (@ConstanceZimmer) February 26, 2017\n\nReally sad about the passing of Bill Paxton….RIP — Belinda Carlisle (@belindaofficial) February 26, 2017\n\nMy fave thing about Bill Paxton was he saw his wife Louise on a London bus 30 yrs ago & never let her go. Everyone loved Bill. 💔 pic.twitter.com/xJESxj6OpX — Dana Delany (@DanaDelany) February 26, 2017\n\nWhat!!??? Bill Paxton??? Nooooo! — ICE T (@FINALLEVEL) February 26, 2017\n\nBill Paxton was always my favorite in TiTanic… And every movie he starred in. So sad to hear the news #RIP — Ashley Tisdale (@ashleytisdale) February 26, 2017", "images": ["https://secure.gravatar.com/avatar/0fff10be73f047f254864577aaffeab8?s=300&d=blank&r=g", "https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://ewedit.files.wordpress.com/2017/02/ap_836261460062.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768"], "top_img": "https://ewedit.files.wordpress.com/2017/02/ap_836261460062.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "keywords": [], "authors": ["Joey Nolfi"], "canonical_link": "https://ew.com/movies/2017/02/26/bill-paxton-dead-celebrities-react/", "title": "Tom Hanks, Charlize Theron, more stars pay tribute to Bill Paxton", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Bill Paxton, dead, celebrities", "news_keywords": "Bill Paxton, dead, celebrities", "description": "Hollywood is mourning the loss of the actor, who died after complications resulting from surgery.", "og": {"title": "Tom Hanks, Charlize Theron, More Stars Pay Tribute to Bill Paxton", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2017/02/26/bill-paxton-dead-celebrities-react/", "description": "The entertainment industry is mourning Bill Paxton, who died Sunday at the age of 61. Stars like Tom Hanks, Charlize…", "image": {"identifier": "https://ewedit.files.wordpress.com/2017/02/ap_836261460062.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/movies/2017/02/26/bill-paxton-dead-celebrities-react/", "description": "Hollywood is mourning the loss of the actor, who died after complications resulting from surgery.", "media": "https://ewedit.files.wordpress.com/2017/02/ap_836261460062.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2017/02/26/bill-paxton-dead-celebrities-react/", "title": "Tom Hanks, Charlize Theron, More Stars Pay Tribute to Bill Paxton", "description": "Hollywood is mourning the loss of the actor, who died after complications resulting from surgery.", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2017/02/ap_836261460062.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "fb": {"pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1488085200.0, "source": "http://ew.com", "summary": ""}