{"url": "www.womansworld.com/posts/meghan-markle-baby-shower-163579", "text": "Meghan Markle has had to give up a lot since marrying Prince Harry — and now she'll have to add baby showers to the list. The new Duchess of Sussex has managed to shake things up since joining the royal family, but she would be breaking royal protocol if she were to throw a bash before any future baby is born. This rule might be a bummer for Meghan, but it actually makes a lot of sense.\n\n\"[The royals] are clearly very wealthy, and a lavish baby shower would be seen as highly inappropriate,\" ABC News' royal expert Vickie Arbiter said back in 2013 when Kate Middleton was pregnant with Prince George. \"There's nothing they can't go out and buy themselves.\"\n\nWhether or not Meghan could accept baby-related gifts is murky. According to British rules, \"Gifts offered by private individuals living in the United Kingdom not personally known to the Member of the Royal Family should be refused where there are concerns about the propriety or motives of the donor or the gift itself.\" (This is why she and Prince Harry had to return more than $9 milion worth of wedding presents.) Gifts from strangers have to be turned down, but what about offerings from her friends? The answer seems unclear, but it's possible the Duke and Duchess of Sussex would return everything, including gifts from friends, just so they can't be accused of being improper.\n\nPrince Harry and Meghan Markle also have the option of just asking for donations in lieu of gifts, so they don't have to deal with the issue of acceptability. They did this at their wedding, although they received gifts anyway — including their new titles.\n\nBaby showers aren't quite as popular in the United Kingdom as they are here in America, so throwing a baby shower might also be odd in addition to inappropriate. Because Meghan is known for her rule-breaking streak, we guess that she'll at least have her dear friends visit to celebrate. Even a heartfelt congratulations over the phone would suffice.\n\nOf course, we won't have to worry about any of this until Meghan announces that she's expecting (if she ever does!).\n\nMore From Woman's World\n\nMeghan Markle's New British Accent Confuses Fans — But She's Not the Only Celeb to Change Her Voice\n\nWhy You'll Never See Meghan Markle Wearing Wedges Around the Queen\n\n4 Heartwarming Ways Meghan Markle Has Paid Tribute to Princess Diana", "images": ["https://bntp-assets.freetls.fastly.net/assets/magazines/womansworld_com/logo_main-d5e2ce966397fc8aea5821aa40a5d57ac2cb76d16461c5744251be4a094af0fd.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=8187616&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://images-production.freetls.fastly.net/uploads/posts/teaser_image/163579/meghan-markle-baby-shower.jpg?auto=compress&crop=top&fit=crop&q=55&w=1200&h=900", "https://bntp-assets.freetls.fastly.net/assets/magazines/womansworld_com/logo_simple-e39c670b35cf48f0adee8018d706e2ba39ff90e6d74530109fd44dff8193b7ee.png"], "top_img": "https://images-production.freetls.fastly.net/uploads/posts/teaser_image/163579/meghan-markle-baby-shower.jpg?auto=compress&crop=top&fit=crop&q=55&w=1200&h=900", "keywords": [], "authors": [], "canonical_link": "https://www.womansworld.com/posts/meghan-markle-baby-shower-163579", "title": "Why Meghan Markle Won't Be Able to Have a Baby Shower", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "csrf-param": "authenticity_token", "csrf-token": "4CrOC+1KQLisabAa/P8DL0nd8nIkNpLvdGxTSrgHdfhn5TIsKEcfQ7FKehF8fx6sqstdSCgG3r2euqH265drlw==", "fb": {"admins": 100001976642184, "app_id": 128947854104163, "pages": 78805390574}, "description": "We can't wait to see Prince Harry and Meghan Markle's kids, but Meghan won't get to celebrate with a baby shower. Here's why it's against royal rules.", "date": "2018-07-25T12:00:00-04:00", "og": {"title": "Why Meghan Markle Won't Be Able to Have a Baby Shower", "type": "article", "image": {"identifier": "https://images-production.freetls.fastly.net/uploads/posts/teaser_image/163579/meghan-markle-baby-shower.jpg?auto=compress&crop=top&fit=crop&q=55&w=1200&h=900", "width": 1200, "height": 900}, "description": "We can't wait to see Prince Harry and Meghan Markle's kids, but Meghan won't get to celebrate with a baby shower. Here's why it's against royal rules.", "url": "https://www.womansworld.com/posts/meghan-markle-baby-shower-163579", "site_name": "Woman's World"}, "article": {"author": "Melanie Aman", "published_time": "2018-07-25T16:00:53Z"}, "msapplication-TileImage": "https://bntp-assets.freetls.fastly.net/assets/magazines/womansworld_com/favicon_144-4380ca2cb7a0d1ae9a6d29b49eda4e34c7202e56294b35dca4f632753e93b998.png"}, "movies": [], "publish_date": 1532534453.0, "source": "http://www.womansworld.com", "summary": ""}