{"url": "https://www.quora.com/What-does-taken-for-granted-mean-Could-you-provide-an-example", "text": "\"Taken for granted\" is from the English idiom \"take for granted.\" As an idiom, the meaning of the whole phrase isn't based on the literal meanings of the words.\n\nThere are four possible usage versions of this idiom with closely connected yet different meanings. This can be quite difficult to distinguish even by native English speakers.\n\n#1 — to consider as true or real\n\nIn the 1st sense, \"take for granted\" at the simplest level means to consider as true or real (in the sense of to anticipate correctly). In short, to accept something as true without testing or questioning it. This usage dates from around 1600.\n\nI took it for granted that they would pay for their share, but I was wrong.\n\n#2 — to underestimate the value\n\nIn the 2nd sense, \"take [someone, something] for granted\" means to underestimate the value of that person or thing. In other words, to expect someone or something to be always available (such as to serve us without us needing to give recognition or thanks). In short, to give little or no value to that person or thing because we think we automatically deserve it.\n\nThe editors felt that the publisher was taking them for granted.\n\nI wish you didn't take me for granted.\n\nI guess that I take a lot of things for granted.\n\n#3 — to display or convey ungratefulness\n\nIn the 3rd sense, \"take [somebody] for granted\" means to not show that you are grateful when someone helps you or have been with you (especially in difficult times). In short, you fail to appreciate someone.\n\nOne of the problems with relationships is that, after a while, you begin to take each other for granted.\n\nWhen your own children are growing up, you tend to take them for granted, and then suddenly, they are all grown up.\n\nPoliticians seem to take voters for granted, except when they face a serious challenge.\n\n#4 — expectation that something is available by default\n\nIn the 4th sense, \"take [something] for granted\" means to expect something to be always available and forget that we are lucky to have it:\n\nWe take so many things for granted in this country — like having hot water whenever we need it.\n\nOriginally answered Feb. 15, 2015. Updated Aug. 27, 2017, to fix formatting.\n\nThanks:— “10,000+ people were sent your answer in the Quora Digest.” (27 Aug 2017)", "images": ["https://qph.fs.quoracdn.net/main-thumb-54173063-100-qtiwhrczvbdnguskcaqiobyrjeoqgocq.jpeg", "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico"], "top_img": "https://qsf.fs.quoracdn.net/-3-images.favicon.ico-26-ae77b637b1e7ed2c.ico", "keywords": [], "authors": [], "canonical_link": "https://www.quora.com/What-does-taken-for-granted-mean-Could-you-provide-an-example", "title": "What does \"taken for granted\" mean? Could you provide an example?", "meta_data": {"robots": "noarchive"}, "movies": [], "publish_date": null, "source": "https://www.quora.com", "summary": ""}