{"url": "dmgnews.com/index.php/2017/12/07/jennifer-lawrence-our-lord-satan-will-destroy-donald-trump/", "text": "[PHOTO:Hollywood star Jennifer Lawrence says she looks forward to ‘Satan destroying Donald Trump’]\n\nIn a bizarre rant, Oscar-winning Hollywood actress Jennifer Lawrence has said that she is “looking forward” to Donald Trump being “destroyed” by “our Lord Satan.”The Hunger Games star makes no secret of her disdain for the president and has been one of his more vocal critics since he first started his campaign to run for office.\n\nHer criticisms have often seemed a little misguided, but this time she seems to have attacked his “Jesus bullsh*t” Christian values.The White House Christmas decorations this year is themed “Time-honored traditions,” and features a nativity scene that was chosen by first lady Melania Trump – religious references being something that was avoided by the previous president.\n\nShortly after arriving for The Hollywood Reporter’s 2017 Women In Entertainment Breakfast held at Milk Studios on Wednesday (December 6) in Los Angeles, Lawrence was heard chatting with a group of friends in the VIP area, drink in hand, when the conversation turned sour after someone mentioned Donald Trump.”Don’t get me started on that guy,” she blasted, holding her glass up. “I’d love to throw this martini in his face!”\n\nAs the group laughed in agreement, she continued with the rant: “And what’s with all this nativity, Jesus bullsh*t in the White House all of a sudden?”That’s not our Lord.”Trump is not one of us.”I’m looking forward to watching Satan destroy that guy.”\n\nLawrence was then ushered away by her assistant leaving the group looking a little perplexed by the comments.This isn’t the first time the liberal actor has directed a strange tirade towards Mr. Trump.In September, Lawrence claimed that the spate of natural disasters that devastated the US and surrounding nations over the summer was down to “Mother Nature” taking her revenge on the US for voting in Donald Trump as president.\n\nMORE HERE: Jennifer Lawrence: Hurricanes are Revenge on the US for TrumpShe claimed that Hurricanes Harvey and Irma were an expression of “Nature’s rage” that had been sent to teach Americans a lesson for not believing in “climate change.”", "images": ["http://dmgnews.com/wp-content/uploads/2017/12/jennifer-lawrence-lord-satan-will-destroy-donald-trump-61217-330x195.jpg", "http://dmgnews.com/wp-content/uploads/2019/12/salvationarmydec092019-300x188.jpg", "http://dmgnews.com/wp-content/uploads/2019/12/dogtagsdec092019-300x180.jpg", "http://dmgnews.com/wp-content/uploads/2019/12/biometricdec092019-300x180.jpg", "http://dmgnews.com/wp-content/plugins/ultimate-social-media-plus/images/visit_icons/Follow/icon_Follow_en_US.png", "http://dmgnews.com/wp-content/uploads/2017/12/jennifer-lawrence-lord-satan-will-destroy-donald-trump-61217.jpg"], "top_img": "http://dmgnews.com/wp-content/uploads/2017/12/jennifer-lawrence-lord-satan-will-destroy-donald-trump-61217.jpg", "keywords": [], "authors": [], "canonical_link": "http://dmgnews.com/index.php/2017/12/07/jennifer-lawrence-our-lord-satan-will-destroy-donald-trump/", "title": "Jennifer Lawrence: ‘Our Lord Satan Will Destroy Donald Trump", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 4.9.12", "specificfeeds-verification-code-Y2c3R3ltaUhYNno1OUJPYnJNMEhzZXNmOGorWVRZL3ZXZndaRDgrZWdmWlExMktjNldmYisrZklzejF6VjNTYlh1djM1UTFLT2RrdUp6WDg0MDcyY04xYmVOb3VxcDA4bHd2d3B4am1RVkZGcmhNZ0RYS2kyVkJUSG5BNVhvTDR8bjFJMEVTeTlaQ3BMM05SeGRCKzJoZDRFMDc5NFErdWdqb1RiRTJHR0ZBYz0=": "1Q7EgtSl6n0dMfXU3TaE", "og": {"image": {"identifier": "http://dmgnews.com/wp-content/uploads/2017/12/jennifer-lawrence-lord-satan-will-destroy-donald-trump-61217.jpg", "type": "image/jpeg", "width": 620, "height": 340}, "description": "[PHOTO:Hollywood star Jennifer Lawrence says she looks forward to 'Satan destroying Donald Trump']\r\n\r\nIn a bizarre rant, Oscar-winning Hollywood actress Jennifer Lawrence has said that she is looking forward to Donald Trump being destroyed by our Lord Satan.The Hunger Games star makes no secret of her disdain for the president and has been one of his more vocal critics since he first started his campaign to run for office.\r\n\r\nHer criticisms have often seemed a little misguided, but this time she seems to have attacked his Jesus bullsh*t Christian values.The White House Christmas decorations this year is themed Time-honored traditions, and features a nativity scene that was chosen by first lady Melania Trump - religious references being something that was avoided by the previous president.\r\n\r\nShortly after arriving for The Hollywood Reporter’s 2017 Women In Entertainment Breakfast held at Milk Studios on Wednesday (December 6) in Los Angeles, Lawrence was heard chatting with a group of friends in the VIP area, drink in hand, when the conversation turned sour after someone mentioned Donald Trump.Don't get me started on that guy, she blasted, holding her glass up. I'd love to throw this martini in his face!\r\n\r\nAs the group laughed in agreement, she continued with the rant: And what's with all this nativity, Jesus bullsh*t in the White House all of a sudden?That's not our Lord.Trump is not one of us.I'm looking forward to watching Satan destroy that guy.\r\n\r\nLawrence was then ushered away by her assistant leaving the group looking a little perplexed by the comments.This isn't the first time the liberal actor has directed a strange tirade towards Mr. Trump.In September, Lawrence claimed that the spate of natural disasters that devastated the US and surrounding nations over the summer was down to Mother Nature taking her revenge on the US for voting in Donald Trump as president.\r\n\r\nMORE HERE: Jennifer Lawrence: Hurricanes are Revenge on the US for TrumpShe claimed that Hurricanes Harvey and Irma were an expression of Nature's rage that had been sent to teach Americans a lesson for not believing in climate change.", "url": "http://dmgnews.com/index.php/2017/12/07/jennifer-lawrence-our-lord-satan-will-destroy-donald-trump/", "title": "Jennifer Lawrence: ‘Our Lord Satan Will Destroy Donald Trump"}}, "movies": [], "publish_date": 1512622800.0, "source": "http://dmgnews.com", "summary": ""}