{"url": "http://www.nytimes.com/2009/02/17/education/17educ.html?hp", "text": "Expectations are running so high, and the appetite for information is so large among the nation’s educators, that when Mr. Duncan organized a conference call last Wednesday to begin explaining the stimulus bill’s terms to a few dozen state and district superintendents, 800 callers swamped the switchboard.\n\nMost of Mr. Duncan’s unusual power would come in disbursing a $54 billion stabilization fund intended to prevent public sector layoffs, mostly in schools. The bill sets aside $5 billion of that to reward states, districts and schools for setting high standards and narrowing achievement gaps between poor and affluent students. The law lets Mr. Duncan decide which states deserve awards and which programs merit special financing.\n\n“It’s hard to imagine moving that much money that quickly,” said Margaret Spellings, Mr. Duncan’s predecessor, who turned her seventh-floor office over to him last month. “The point is, it’s never been done before, and as much confidence as I have in Arne Duncan, there’s an awesome opportunity for slippage with that much money moving through the meat grinder.”\n\nMaybe Ms. Spellings is slightly jealous, since she and other secretaries stretching back decades had only small amounts of money for favored projects.\n\n“Teeny, teeny,” said Amy Wilkins, who as vice president at the Education Trust, a civil rights group, has studied the budgets of several of Mr. Duncan’s predecessors. “Margaret was looking for quarters in her pencil drawer.”\n\nMr. Duncan said he understood the unusual circumstances.\n\n“There’s going to be this extraordinary influx of resources,” he said in an interview. “So people say, ‘You’re going to be the most powerful secretary ever,’ but I have no interest in that. Power has never motivated me. What I love is opportunity, and this is a once-in-a-lifetime opportunity to do something special, to drive change, to make our schools better.”\n\nMr. Duncan said he intended to reward school districts, charter schools and nonprofit organizations that had demonstrated success at raising student achievement — “islands of excellence,” he called them. Programs that tie teacher pay to classroom performance will most likely receive money, as will other approaches intended to raise teacher quality, including training efforts that pair novice instructors with veteran mentors, and after-school and weekend tutoring programs.\n\nAdvertisement Continue reading the main story\n\nThe stimulus money will help states avert some, but most likely not all, of the education cutbacks for the 2009-10 school year resulting from state budget shortfalls that currently total some $132 billion. California, for instance, is facing a $41 billion budget shortfall, much of it in school spending, but will receive some $11 billion in education money from the stimulus, estimates the National Education Association, the nation’s largest teachers union.\n\nPhoto\n\nThe positions of deputy secretary, under secretary and chief of staff and dozens of other senior posts at the Education Department remain unfilled, so Mr. Duncan is relying on help from career officers and consultants. He has appointed teams to develop procedures for distributing the stimulus billions quickly, and many aides, he said, have been working evenings and weekends to begin organizing the effort.\n\n“I want all of us to work hard enough and smart enough to take full advantage of this, because it’ll never happen again,” Mr. Duncan said last month in his first speech to hundreds of civil servants at department headquarters, as the outlines of the huge stimulus package were taking shape in Congress.\n\nUrging department employees not to be deferential, he described the reception he got on his first visit to his headquarters.\n\n“It was like, ‘Hello, Mr. Secretary-designate-nominee,’ and it didn’t feel right,” Mr. Duncan said. “My name is Arne. It’s not Mr. Secretary. Please just call me Arne.” That line drew a standing ovation.\n\nHe has hit it off well with Congress, too, so far. His wife, Karen, whom Mr. Duncan met in Australia, where he played professional basketball after his 1987 graduation from Harvard, accompanied him to his Senate confirmation, along with their daughter, Claire, 7, and son, Ryan, 4, who sat quietly during the hearing, reading storybooks.\n\n“If you and your wife have done such a great job with Ryan, who is so well behaved, I hope you can do that with every child in American classrooms,” said Senator Johnny Isakson, Republican of Georgia.\n\nAnother Republican senator, Lamar Alexander of Tennessee, said Mr. Obama had made “several distinguished cabinet appointments.”\n\nAdvertisement Continue reading the main story\n\n“I think you’re the best,” Mr. Alexander, who was education secretary under the first President Bush, said to Mr. Duncan.\n\nBut now comes the hard part.\n\nLast year the Education Department distributed about $59 billion to states, school districts and colleges, most of it along well-worn financing paths mapped out by Congress.\n\n“Congress usually spends two years debating the rules for how to spend $50 million,” said Jack Jennings, president of the Center on Education Policy, a research organization in Washington. “But this time they’re providing money without spelling out how it should be spent, so Arne Duncan and his staff are going to have to work out rules themselves in just weeks. He’s going to have his hands full.”\n\nCongress has stipulated some rules, of course. To receive a share of the $54 billion stabilization fund, governors must make several “assurances” to Mr. Duncan, intended to drive school reforms: that they are developing statewide data systems that can allow schools to track individual students’ academic progress, that they are assigning experienced teachers fairly to rich and poor schools alike, and so on. Mr. Duncan has the ticklish job of ruling on whether the governors’ assurances are convincing.\n\nAnd Congress has given him a $5 billion incentive fund that he can use to reward states that are raising student achievement and withhold money from states that are not. “We have states that tell the public that 90 percent of kids are meeting state standards,” Mr. Duncan said, “but when we look at how they’re doing on the National Assessment of Educational Progress, it’s nowhere close. I’m not going to reward that. I want to be transparent about the good, bad and the ugly.”\n\nSome states and districts will get less than what they believe is their share, which could create powerful enemies.\n\n“Secretary Duncan has a very challenging job,” said Joel Packer, a lobbyist for the National Education Association. “It’ll take a lot of effort to get this right.”", "images": ["https://static01.nyt.com/images/2009/02/16/us/17educ_600.JPG", "https://static01.nyt.com/images/2009/02/17/us/17educ2_650.JPG", "https://static01.nyt.com/images/2009/02/16/us/17educ_75.jpg"], "top_img": "https://static01.nyt.com/images/2009/02/16/us/17educ_75.jpg", "keywords": [], "authors": ["Sam Dillon"], "canonical_link": "https://www.nytimes.com/2009/02/17/education/17educ.html", "title": "For Education Secretary, Stimulus Means Dollars and Risk", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "sourceApp": "nyt-v5", "applicationName": "article", "al": {"android": {"url": "nytimes://reader/id/1194837873256", "package": "com.nytimes.android", "app_name": "NYTimes"}, "iphone": {"url": "nytimes://www.nytimes.com/2009/02/17/education/17educ.html", "app_store_id": 284862083, "app_name": "NYTimes"}, "ipad": {"url": "nytimes://www.nytimes.com/2009/02/17/education/17educ.html", "app_store_id": 357066198, "app_name": "NYTimes"}}, "twitter": {"app": {"name": {"googleplay": "NYTimes"}, "id": {"googleplay": "com.nytimes.android"}, "url": {"googleplay": "nytimes://reader/id/1194837873256"}}, "site": "@nytimes", "url": "https://www.nytimes.com/2009/02/17/education/17educ.html", "title": "For Education Secretary, Stimulus Means Dollars and Risk", "description": "Arne Duncan must decide how to disburse $100 billion in emergency aid for schools and colleges.", "image": "https://static01.nyt.com/images/icons/t_logo_150_black.png", "card": "summary"}, "robots": "noarchive", "hdl_p": "For Education Chief, Stimulus Means Power, Money and Risk", "description": "Arne Duncan must decide how to disburse $100 billion in emergency aid for schools and colleges.", "genre": "News", "articleid": 1194837873256, "usageTerms": "https://help.nytimes.com/hc/en-us/articles/115014893968-Terms-of-sale", "hdl": "For Education Secretary, Stimulus Means Dollars and Risk", "pdate": 20090216, "utime": 20141124062716, "ptime": 20090216200400, "DISPLAYDATE": "Feb. 16, 2009", "dat": "Feb. 16, 2009", "lp": "Arne Duncan must decide how to disburse $100 billion in emergency aid for schools and colleges.", "msapplication-starturl": "http://www.nytimes.com", "cre": "The New York Times", "slug": "17educ", "article": {"collection": "https://static01.nyt.com/services/json/sectionfronts/education/index.jsonp", "published": "2009-02-16T20:04:00-05:00", "modified": "2014-11-24T06:27:16-05:00", "section": "Education", "section-taxonomy-id": "C7303E0D-6EB2-4FD3-B968-530EF9F38EB1", "section_url": "https://www.nytimes.com/pages/education/index.html", "top-level-section": "education", "author": "https://www.nytimes.com/by/sam-dillon", "tag": "Education Department (US)"}, "sectionfront_jsonp": "https://static01.nyt.com/services/json/sectionfronts/education/index.jsonp", "og": {"url": "https://www.nytimes.com/2009/02/17/education/17educ.html", "type": "article", "title": "For Education Secretary, Stimulus Means Dollars and Risk", "description": "Arne Duncan must decide how to disburse $100 billion in emergency aid for schools and colleges.", "image": "https://static01.nyt.com/images/2009/02/16/us/17educ_75.jpg"}, "fb": {"app_id": 9869919170, "pages": 993603507345855}, "author": "Sam Dillon", "tone": "news", "byl": "By SAM DILLON", "PT": "article", "CG": "education", "PST": "News", "tom": "News", "edt": "NewYork", "des": "Education and Schools", "per": "Duncan, Arne", "org": "Education Department (US)", "keywords": "Obama Stimulus Plan,Education and Schools,Duncan  Arne,Education Department (US)", "thumbnail": "https://static01.nyt.com/images/2009/02/16/us/17educ_75.jpg", "thumbnail_height": 75, "thumbnail_width": 75, "dfp-ad-unit-path": "education", "dfp-amazon-enabled": "false"}, "movies": [], "publish_date": 1234846800.0, "source": "http://www.nytimes.com", "summary": ""}