{"url": "people.com/parents/jessica-alba-cash-warren-welcome-third-child-son-hayes/", "text": "Cash Warren is no longer the lone male in his and Jessica Alba‘s household!\n\nThe spouses of nine years welcomed their third child and first son, Hayes Alba Warren, on Sunday, Dec. 31, Alba announced on Instagram Monday alongside the first photo of her baby boy shared to social media.\n\nThe newest member of the family joins Alba and Warren’s two daughters: Haven Garner, 6, and Honor Marie, 9½.\n\n“Hayes Alba Warren 12/31/17 Best gift to ring in the New Year!!” wrote the actress. “Cash and I feel so blessed. Haven and Honor are already obsessed with their new baby bro. 👶🏽💙 #familyof5”\n\nWarren chimed in on Instagram too, sharing a photo of himself gazing down at his son alongside a beautiful message that read, “Hayes Alba Warren: You sure know how to ring in the new year! You showed up a few days early but we couldn’t be any happier.”\n\n“Your Mamma is the strongest woman I know … you’re so lucky to have her by your side,” he added. “You have two amazing sisters who already adore you and I know you’ll be thankful to have them guide the way.”\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nRELATED VIDEO: Pregnant Jessica Alba Says Having a Boy Is “Gonna Be a Whole Situation”\n\nFor more coverage, follow our babies magazine on Flipboard.\n\nWarren continued in his post, “On your first day of life, I promise to love you, to cherish you, and to provide you with a sandbox full of dreams to explore. Welcome to the family my sweet baby Hayes! 12/31/2017.”\n\nAlba, 36, first announced she was expecting in July, sharing a cute Boomerang of Honor, Haven and herself holding up huge “1,” “2” and “3” balloons, respectively.\n\n“@cash_warren and I are officially going to be outnumbered #babyonboard #herewegoagain 👶🏼🤰🏽#blessed🙏,” she captioned the post.\n\nIn late October, the actress and Honest Company co-founder revealed in another cute clip with her daughters that the baby on the way was a boy, showing the girls pulling on a string to release blue confetti from a suspended box.\n\nRELATED GALLERY: With Baby No. 3 on the Way, Take a Look at Jessica Alba and Cash Warren’s Too-Cute Family Photos\n\nAlba has been open about the excitement she and Warren, 38, feel about adding a little boy to their family. During a late-October visit to by The Rachael Ray Show, the Dark Angel alum joked she was looking forward to having “someone to love me more.”\n\n“When [Cash] comes home, [Haven and Honor are] like, ‘Daddy!’ It’s like a party,” she explained. “When I come home, they’re like, ‘Oh, hey Mom.’ I’m like, ‘I do everything for you! I cook, I do all the things!’ “\n\nEarlier that month, the star said on The Tonight Show Starring Jimmy Fallon that the family was “super stoked” and that having a son was “gonna be a whole situation.”\n\nImage zoom Jessica Alba and Cash Warren Jon Kopaloff/FilmMagic\n\nFROM PEOPLETV: Katherine Heigl Introduces Baby Joshua\n\nRELATED GALLERY: Honestly Chic! Shop 15 Outfits from Jessica Alba’s California Casual Pregnancy Style\n\nIn early November, Alba debuted a new line of Honest Company seasonal diaper prints for winter, saying in the accompanying reveal video, “What’s so exciting about this winter diaper reveal is that this will be the diaper [print] that the little baby in my tummy will be wearing.”\n\nAnd although the new baby’s sex is a nice bonus, what Alba was most looking forward to about caring for an infant one more time has everything to do with those first moments of new motherhood.\n\n“Cuddling!” she told PEOPLE in August of her most-anticipated activity once her newborn arrived. “Cuddling babies are the best.”", "images": ["https://peopledotcom.files.wordpress.com/2017/11/jessica-alba6.jpg", "https://peopledotcom.files.wordpress.com/2019/04/couple-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/01/jessica-alba-cash-baby.jpg?crop=0px%2C221px%2C2000px%2C1050px&resize=1200%2C630", "https://peopledotcom.files.wordpress.com/2019/03/john-delaney.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2018/04/mickey-pretzels-1-2000.jpg?&fit=250%2C250", "https://peopledotcom.files.wordpress.com/2017/07/11375342_417123731803445_2077871559_n-1.jpg?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/screen-shot-2019-04-25-at-8.41.31-am.png?fit=250%2C250", "https://peopledotcom.files.wordpress.com/2019/04/jessica-alba-cash-warren-paris-vacation.jpg?fit=250%2C250"], "top_img": "https://peopledotcom.files.wordpress.com/2018/01/jessica-alba-cash-baby.jpg?crop=0px%2C221px%2C2000px%2C1050px&resize=1200%2C630", "keywords": [], "authors": ["Jen Juneau"], "canonical_link": "https://people.com/parents/jessica-alba-cash-warren-welcome-third-child-son-hayes/", "title": "Jessica Alba and Cash Warren Welcome Son Hayes Alba", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Jessica Alba, Jessica Alba baby, Jessica Alba baby boy, Jessica Alba son, Jessica Alba third child, Jessica Alba kids, Jessica Alba son born, Jessica Alba baby boy born, Jessica Alba gives birth, Jessica Alba has baby, Jessica Alba baby boy born, Jessica Alba third child born, Jessica Alba childbirth, Jessica Alba birth, Jessica Alba gives birth to son, Jessica Alba welcomes son, Jessica Alba welcomes baby boy, Jessica Alba gives birth to baby boy, Jessica Alba pregnant, Jessica Alba expecting, Jessica Alba and Cash Warren, Is Jessica Alba pregnant, Jessica Alba baby 3, Jessica Alba pregnancy, Jessica Alba kids, Jessica Alba children, Jessica Alba daughter, Jessica Alba daughters, Jessica Alba family, Cash Warren, Jessica Alba Cash Warren, Jessica Alba husband, Jessica Alba husband Cash, Jessica Alba Cash, Jessica Alba Instagram, Jessica Alba baby bump, Jessica Alba baby belly, Jessica Alba maternity, Jessica Alba daughter Haven, Jessica Alba Haven, Jessica Alba Haven Garner, Jessica Alba Haven Garner Warren, Jessica Alba Haven Warren, Haven Warren, Haven Garner Warren, Jessica Alba daughter Honor, Jessica Alba Honor, Jessica Alba Honor Marie, Jessica Alba Honor Marie Warren, Jessica Alba Honor Warren, Honor Warren, Honor Marie Warren, Jessica Alba baby three, Jessica Alba expecting third child, Jessica Alba Instagram, Jessica Alba Instagram story, Jessica Alba Instagram stories, Jessica Alba Honest, Jessica Alba Honest Company, Jessica Alba The Honest Company, Honest, Honest Company, The Honest Company, Jessica Alba son Hayes, Jessica Alba Hayes, Jessica Alba Hayes Alba, Jessica Alba Hayes Alba Warren, Jessica Alba Hayes Warren, Hayes Warren, Hayes Alba Warren", "news_keywords": "Jessica Alba, Jessica Alba baby, Jessica Alba baby boy, Jessica Alba son, Jessica Alba third child, Jessica Alba kids, Jessica Alba son born, Jessica Alba baby boy born, Jessica Alba gives birth, Jessica Alba has baby, Jessica Alba baby boy born, Jessica Alba third child born, Jessica Alba childbirth, Jessica Alba birth, Jessica Alba gives birth to son, Jessica Alba welcomes son, Jessica Alba welcomes baby boy, Jessica Alba gives birth to baby boy, Jessica Alba pregnant, Jessica Alba expecting, Jessica Alba and Cash Warren, Is Jessica Alba pregnant, Jessica Alba baby 3, Jessica Alba pregnancy, Jessica Alba kids, Jessica Alba children, Jessica Alba daughter, Jessica Alba daughters, Jessica Alba family, Cash Warren, Jessica Alba Cash Warren, Jessica Alba husband, Jessica Alba husband Cash, Jessica Alba Cash, Jessica Alba Instagram, Jessica Alba baby bump, Jessica Alba baby belly, Jessica Alba maternity, Jessica Alba daughter Haven, Jessica Alba Haven, Jessica Alba Haven Garner, Jessica Alba Haven Garner Warren, Jessica Alba Haven Warren, Haven Warren, Haven Garner Warren, Jessica Alba daughter Honor, Jessica Alba Honor, Jessica Alba Honor Marie, Jessica Alba Honor Marie Warren, Jessica Alba Honor Warren, Honor Warren, Honor Marie Warren, Jessica Alba baby three, Jessica Alba expecting third child, Jessica Alba Instagram, Jessica Alba Instagram story, Jessica Alba Instagram stories, Jessica Alba Honest, Jessica Alba Honest Company, Jessica Alba The Honest Company, Honest, Honest Company, The Honest Company, Jessica Alba son Hayes, Jessica Alba Hayes, Jessica Alba Hayes Alba, Jessica Alba Hayes Alba Warren, Jessica Alba Hayes Warren, Hayes Warren, Hayes Alba Warren", "description": "Jessica Alba announced her third child on the way in July, revealing in October that she and husband Cash Warren would be expecting their first son", "og": {"title": "Jessica Alba and Cash Warren Welcome Son Hayes - See His Adorable First Photos", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/jessica-alba-cash-warren-welcome-third-child-son-hayes/", "description": "Jessica Alba announced her third child on the way in July, revealing in October that she and husband Cash Warren would be expecting their first son", "image": {"identifier": "https://peopledotcom.files.wordpress.com/2018/01/jessica-alba-cash-baby.jpg?crop=0px%2C221px%2C2000px%2C1050px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://people.com/parents/jessica-alba-cash-warren-welcome-third-child-son-hayes/", "description": "Jessica Alba announced her third child on the way in July, revealing in October that she and husband Cash Warren would be expecting their first son", "media": "https://peopledotcom.files.wordpress.com/2018/01/jessica-alba-cash-baby.jpg?crop=0px%2C221px%2C2000px%2C1050px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/jessica-alba-cash-warren-welcome-third-child-son-hayes/", "title": "Jessica Alba and Cash Warren Welcome Son Hayes - See His Adorable First Photos", "description": "Jessica Alba announced her third child on the way in July, revealing in October that she and husband Cash Warren would be expecting their first son", "site": "@people", "image": "https://peopledotcom.files.wordpress.com/2018/01/jessica-alba-cash-baby.jpg?crop=0px%2C221px%2C2000px%2C1050px&resize=1200%2C630"}, "fb": {"pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}