{"url": "www.velvetropes.com/backstage/where-do-the-kardashians-live/", "text": "Photo: Cosmopolitan Magazine\n\nThe Kardashians. A phrase engrained in the ethos of our world for eternity, and we love it! Love them or hate them, they have enormous staying power and influence on everything from beauty and fashion to criminal justice reform, they aren’t going anywhere. ‘Where do the Kardashians live in Calabasas and Hidden Hills’ is one of the most requested questions on Velvet Ropes. The answer is quite long because as you know, there are so many of them!\n\nBelow is a comprehensive list of all the Kardashian homes, not only in Calabasas and Hidden Hills but throughout the Los Angeles area.\n\nMap of Kardashian Houses\n\nWhere Does Kim Kardashian Live?\n\nThey have completed years of renovations on their Hidden Hills compound, and have finally moved in!\n\nThis is the home Kim and Kanye purchased for $20 million. They completely gutted it and the surrounding landscaping as you’ll see in the photos below. We haven’t gotten our hands on any recent photos of the completed renovation, but as soon as we have them, you’ll be the first to know!\n\nBelieve us, we scour EVERYDAY for more recent photos of this unbelievable home. if it weren’t in a gated community we’d send the team to get our own photos…but we aren’t trying to get arrested. What has been revealed about the 15,667 square foot French country-inspired home is that it boasts 8-bedrooms, 8-full bathrooms, and 2-half bathrooms.\n\nAmenities include a fitness room, spa, 2 swimming pools, 2 vineyards, a guest house, a recording studio, and a 1,050 square foot entertainment pavilion. The massive property, as well as the residence itself, provides the West crew plenty of space for their growing family and to thrive.\n\nIn November 2018, Kim and Kanye’s house was threatened by the Woolsey Wild Fire. They brought in a private firefighting crew to save not only their home but the entire neighborhood. Here’s a photo that show’s just how close the fire got to their home.\n\nMore Photos of Kim & Kanye’s Hidden Hills Home\n\nSee a more detailed article about what the home USED to look like here: Where Does Kim Kardashian Live – Her Home is Destroyed.\n\nKim Kardashian House – Her Former Bel Air Mansion\n\nKim & Kanye sold their nearly 9,000 square foot home in Bel Air, CA in November 2017. They completely overhauled it after the purchase and “Kimye’d” it – meaning a ton of white and grey.\n\nThe Mediterranean-style abode boasts 5-bedrooms, 7-bathrooms, and features an infinity-edge swimming pool & spa. The couple sold the home to a Ukrainian billionaire for 17.8 million back in November, 2017.\n\nThe home sold to a Ukranian philanthropist for $17.8 million, nearly double what they paid for it! Oh, and guess who lives next door…Kathy Griffin. Like, right next door.\n\nMore Photos of Kim & Kanye’s Former Bel Air Home\n\nWhere Does Khloé Kardashian Live?\n\nKhloé lives in the exclusive Calabasas community, The Oaks. She dropped $7.2 million on Justin Bieber’s former Spanish-style home in 2014. The house is GORGEOUS! It boasts 6-bedrooms, 7-bathrooms, and 9,214 square feet of luxury living space.\n\nThe Martin Lawrence Bullard-designed home was featured in Architectural Digest along with Kourtney’s house. Features include a personal dressing room & salon, a swimming pool & spa, beautiful landscaping and well-manicured grounds around the property, and several small fountains.\n\nMore Photos of Khloe’s Calabasas Home\n\nWhere Does Kourtney Kardashian Live?\n\nKourtney also lives in the Calabasas community, The Oaks, less than half a mile from Khloé. She purchased her 12,000 square foot home from NFL star Keyshawn Johnson for $8.5 million. The exterior of the home is crazy-wide with a sort of Roman vibe. Super unique and unexpected, but gorgeous.\n\nFeatures to the 6-bedroom, 7.5 bathroom home include a state-of-the-art kitchen with stainless steel appliances, beamed ceilings, and an elevator. It even has a massage room and a gym – seriously, what’s not to love about this place!?\n\nMore Photos of Kourtney’s Calabasas Home\n\nWhere Does Kylie Jenner Live?\n\nKylie Jenner House Hidden Hills\n\nKylie has purchased several homes in the last several years. Kylie Jenner’s house – her primary house that is – is a $12 million Cape Cod-inspired compound in Hidden Hills. The home is in a newer part of Hidden Hills and doesn’t have many nearby neighbors, which makes it perfect for the reclusive star.\n\nThe 13,000 square foot property features a gourmet kitchen, a gym, a game room, a 6-car garage, and a home theater. If none of the previous has you impressed, however, just take a look at Jenner’s gorgeous sparkling pool!\n\nCheck out more Kylie Jenner House photos here!\n\nKylie Jenner House Beverly Hills\n\nIn October 2018, Kylie and Travis Scott bought a MASSIVE modern-style home in Beverly Hills. It’s 9,680 square feet with 7-bedrooms and 10-bathroom, which includes the beds and baths in the guest house.\n\nNotable features include a chef’s kitchen, a massage room, a gym, a wine cellar, and a home theater. The exterior of the home\n\nThe brand new home sits at the end of a secluded cul-de-sac just a few minutes from the famed Beverly Hills Hotel. The exterior of the home is a muted tone and surrounded by lush gardens and trees creating a very jungle-like feel.\n\nThe interior is modern but comfy, with all the amenities you would expect a celeb home to have, but the master bedroom is the star. It’s 2,300 square feet!\n\nThe home was listed for $16.9M in April 2017, and after multiple price reductions, Kylie and Scott got a “deal” – they paid $13.45M.\n\nWe’ve got more where that came from! Check out more Kylie Jenner House in Beverly Hills Photos here!\n\nWhere Does Kendall Jenner Live?\n\nIn August 2017, Kendall listed her West Hollywood home (which she bought from John Krasinski and Emily Blunt) after a dangerous situation involving a stalker. Shortly after, in October 2017, Kendall closed on a new $8.55 million, more secure home in Mulholland Estates, where tons of stars live, including DJ Khaled and Christina Aguilera. The 6,625 square foot Spanish-style home was previously owned by actor Charlie Sheen.\n\nFeatures include 5-bedrooms, 8-bathrooms, a large backyard, a pool, tennis court, fire pit, and playground. The lush landscape on the property gives it an almost tropical vibe and only adds to the home’s appeal.\n\nKendall is the only member of the Kardashian/Jenner klan who doesn’t live or have a home in Calabasas or Hidden Hills. After all, she is the most removed from the “family complex” if you will.\n\nMore Photos of Kendall’s Beverly Hills Home\n\nWhere Does Rob Kardashian Live?\n\nRob moved into Kylie Jenner’s spare cape cod-style Hidden Hills home during his short-lived Blac Chyna romance. They rented the home for an undisclosed amount from Kylie, and we’re unsure if he still lives here. We do know that Kylie HAS NOT sold the home even though she has her own place nearby. Doubtful that it’s just sitting empty. The 7,400 square foot abode boasts 6-bedrooms, 7-bathrooms, and sits on 3.15 acres of land.\n\nNoteworthy features include a spacious swimming pool and stunning views of the nearby hills. Kylie bought the home in 2016 for $6 million.\n\nMore Photos of Rob’s Rented Hidden Hills Home\n\nWhere Does Kris Jenner Live?\n\nKris Jenner house, the home she purchased with then-husband Bruce Jenner in 2010, is still her main home. It’s perched atop the exclusive hills of Hidden Hills, where she is surrounded by her kids who all have homes nearby.\n\nThe home was completely overhauled and “glammed out” by Jeff Andrews Design. The Iconic entry with a checkered floor was even recreated for Kris’ self-titled talk show…though it was short lived.\n\nSome features to the 8,860 square foot home include 7-bedrooms, 9-bathrooms, and a gorgeous swimming pool. The interior of the home is decked out in gray and white tones, obviously a favorite with Jenner.\n\nMore Photos of Kris’ Hidden Hills Home\n\nKRIS’ OTHER HIDDEN HILLS HOME\n\nKris Jenner purchased a 9,400 square foot mansion across the street from Kim & Kanye in December 2017. The brand new build has 6-bedroom and 8-bathrooms.\n\nShe dropped $9.925 million on the new pad. Some outlets are reporting that this is an investment property due to it’s close proximity to her current home. However, we find it hard to believe. She paid top dollar for the brand new home – it’ll be tough to flip for a profit. Features to Jenner’s newest abode include a large swimming pool & spa, a game room, an outdoor barbecue area, and a home theater.\n\nShe has also said many times that “Kim lives across the street” in interviews, and her main home above is not across the street, this one is. Who knows!\n\nMore Photos of Kris’ Second Hidden Hills Home\n\nWhere Does Caitlyn Jenner Live?\n\n**UPDATED Saturday, November 10, 2018 – 12:20 PM with news of the SoCal wildfires**\n\nAlthough TMZ reported that Caitlyn’s home had been destroyed by the wildfires in the Malibu area, our friends at HollywoodPipeline got the exclusive images of her home, which is still standing.\n\n***\n\nAlthough her transition to Caitlyn is several years past, many people are still searching for ‘Where does Bruce Jenner live?’ We’ll answer the question, but seriously, let’s call her by her name. Caitlyn.\n\nCaitlyn Jenner purchased a secluded Malibu home in 2015 for $3.5 million. It’s a sleek hilltop pad with 360-degree views.\n\nAfter purchasing the home, Caitlyn completely redesigned the home with her own touches. The transformation could be seen in her E! series I Am Cait. It’s gorgeous! The 4-bedroom, 3.5-bathroom pad features indoor/outdoor fireplaces, a pool & spa, an outdoor dining area, a bar, and a 3-car garage.\n\nMore Photos of Caitlyn’s Malibu Home\n\nSources\n\nhttps://www.velvetropes.com\n\nhttps://www.tmz.com\n\nhttps://www.radaronline.com\n\nhttps://x17online.com\n\nhttps://www.architecturaldigest.com", "images": ["https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/Screen-Shot-2017-01-25-at-8.31.11-PM-640x426.png", "https://secure.gravatar.com/avatar/f00629aae43cbef5128155cc3e9e77a6?s=80&d=mm&r=pg", "https://img.velvetropes.com/homes/sidebar-home.png?home=138", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/7b7021fd3235a71f59f4411a66668c9c-640x426.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/5202ScottRobertsonRoad.0007-1-640x360.jpg", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/1016347198-03-alt-640x386.jpeg", "https://img.velvetropes.com/homes/sidebar-home.png?home=524", "http://www.tqlkg.com/image-8799682-13612816", "https://www.velvetropes.com/backstage/wp-content/themes/velvet-ropes/dist/images/logo.svg", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/31a63aade8376b3733b8214114690663.png", "https://img.velvetropes.com/celebs/a9e0e0aeb6816313493ead87a34754f8.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/e502e32c54a723ec85c72fe9bb2e4310-640x456.png", "https://img.velvetropes.com/celebs/9b8205774fb2972ea1e1528ea9d68b1e.png", "https://img.velvetropes.com/homes/sidebar-home.png?home=147", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/Screen-Shot-2018-11-10-at-12.33.48-PM-640x362.png", "https://img.velvetropes.com/homes/sidebar-home.png?home=148", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/a7e63b3eac71e158726010379104ffc0-640x427.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/Map-of-Calabasas-and-Hidden-Hills-640x328.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/Charlie-Sheen-Sells-Another-Mulholland-Estates-Mansion-062416-POOL-2-640x427.jpg", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/kris1-455781-e1514406566929-640x339.jpg", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/kardashians-featured.png", "https://img.velvetropes.com/celebs/42588aac7c22b537c6bfa61d738d33a6.png", "https://img.velvetropes.com/homes/sidebar-home.png?home=623", "https://img.velvetropes.com/celebs/f242838fef0e8821aa540dad6a712e73.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/Charlie-Sheen-Sells-Another-Mulholland-Estates-Mansion-062416-GARAGE-640x427.jpg", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/kardashians-featured-640x336.png", "https://img.velvetropes.com/homes/sidebar-home.png?home=136", "http://www.ftjcfx.com/image-8799682-11711260", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/Map-of-Calabasas-640x351.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/dam-images-celebrity-homes-2015-caitlyn-jenner-caitlyn-jenner-home-malibu-california-02-640x427.jpg", "https://img.velvetropes.com/celebs/d400d9d89ef19ba49576418fb3732c0f.png", "https://img.velvetropes.com/homes/sidebar-home.png?home=611", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/Screen-Shot-2018-11-10-at-12.29.03-PM-640x477.png", "https://img.velvetropes.com/celebs/aa7e2f68a1811530574be5c0f0313ff6.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/Screen-Shot-2017-01-23-at-12.46.31-PM-640x442.png", "https://img.velvetropes.com/homes/sidebar-home.png?home=833", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/09/Map-of-Hidden-Hills-640x309.png", "https://img.velvetropes.com/celebs/693896062e7248bedfd1ac3810cfef08.png", "https://img.velvetropes.com/celebs/9271785a1300b0e3e49a8ad134a0135f.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/549076-640x427.jpg", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/82708ce55d0ce185877592ecc8000217-640x427.png", "https://img.velvetropes.com/celebs/3fb21434ad96a0e0523e5dff40f85e18.png", "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/10/44CEB4A100000578-4937314-image-a-61_1506813487890.jpg", "https://www.velvetropes.com/backstage/wp-content/themes/velvet-ropes/dist/images/ava_cap.svg"], "top_img": "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/kardashians-featured.png", "keywords": [], "authors": ["Jessica Frye", "Jessica Loves Two Things Most In This World", "Celebrities", "Her Dog. She Can Be Seen Walking Along Venice Beach With Her Yellow Lab Mix In Tow", "Staring Off Into The Sky Hoping That Looking Uninterested", "Deep Will Get Her Discovered.", "She May Or May Not Have Followed Justin Timberlake'S Every Move Back In The Day But Now She Is Content To Write Out Her Obsession For Velvet Ropes Along With Ghost Writing Novels About Celebrity Romance.", "Jessica Recently Decided To Bring Her Passions To Twitter. When She'S Not Busy Writing", "Making Plans For Her Celebrity Life After Being Discovered", "You Can Find Her There."], "canonical_link": "https://www.velvetropes.com/backstage/where-do-the-kardashians-live/", "title": "Where Do the Kardashians Live: A Map & Photos of Their Empire", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Where do the Kardashians live is the golden question of our time, and their homes in Calabasas and Hidden Hills are insane! This is a map with all the details.", "og": {"image": {"identifier": "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/kardashians-featured.png", "width": 1200, "height": 630}, "locale": "en_US", "type": "article", "title": "Where Do the Kardashians Live: A Map & Photos of Their Empire", "description": "Where do the Kardashians live is the golden question of our time, and their homes in Calabasas and Hidden Hills are insane! This is a map with all the details.", "url": "https://www.velvetropes.com/backstage/where-do-the-kardashians-live/", "site_name": "Backstage with Velvet Ropes", "updated_time": "2019-11-16"}, "article": {"publisher": "https://www.facebook.com/velvetropesapp", "published_time": "2017-09-23", "modified_time": "2019-11-16"}, "fb": {"app_id": 1617382821872606}, "twitter": {"card": "summary_large_image", "site": "@velvetropesapp", "title": "Where Do the Kardashians Live: A Map & Photos of Their Empire", "description": "Where do the Kardashians live is the golden question of our time, and their homes in Calabasas and Hidden Hills are insane! This is a map with all the details.", "image": {"identifier": "https://cdn.velvetropes.com/backstage/wp-content/uploads/2017/01/kardashians-featured.png", "width": 1200, "height": 630}}}, "movies": ["https://www.youtube.com/embed/L8M3EEeEzAc?feature=oembed"], "publish_date": 1506139200.0, "source": "http://www.velvetropes.com", "summary": ""}