{"url": "ew.com/tv/2017/04/06/don-rickles-dead-celebrities-react-twitter/", "text": "Hollywood is mourning the loss of Don Rickles, the actor-turned-insult-comic who died Thursday at the age 90.\n\nRickles, who appeared on the Tonight Show with Johnny Carson more than 100 times and starred in John Landis’ Emmy Award-winning documentary about himself (Mr. Warmth), also voiced Mr. Potato Head on Toy Story and appeared on the Tonight Show to turn his harsh humor on host Jimmy Fallon.\n\nIn the wake of his death, celebrities and fellow comedians (many of whom had been influenced by Rickles) took to social media to pay tribute to the comedy giant in a series of heartfelt posts.\n\nIn lieu of flowers, Don Rickles' family has requested that people drop their pants and fire a rocket. #RIPDonRickles — Patton Oswalt (@pattonoswalt) April 6, 2017\n\n\"Is he laughing? Is MLK laughing? But folks… Oh nice, Dean Martin's here. Don't worry Dean, Jerry's right behind me.\" #RicklesInHeaven — Patton Oswalt (@pattonoswalt) April 6, 2017\n\n\"Hey Helen Keller, show's up here. Gandhi, stop hogging the breadsticks or we'll let Bob Hope tell jokes again.\" #RicklesInHeaven — Patton Oswalt (@pattonoswalt) April 6, 2017\n\n\"Oh great, Churchill and Capote are here tonight. Sorry folks, we're all out of scotch!\" #RicklesInHeaven — Patton Oswalt (@pattonoswalt) April 6, 2017\n\nMy friend, my dad, the funniest biggest hearted of them all. A beautiful husband and father. My heart is broken. Rest In Peace. Don Rickles. — bob saget (@bobsaget) April 6, 2017\n\nThe world just got a lot less funny and just when we needed it the most. I will treasure our friendship forever sweet Don. #RIPDonRickles pic.twitter.com/SGw5YF5GdK — John Stamos (@JohnStamos) April 6, 2017\n\nA God died today. Don Rickles, we did not want to ever lose you. Never. Hanx. — Tom Hanks (@tomhanks) April 6, 2017\n\nAw jeez. Rickles .Sweetest, funniest, legend and mensch. Came to a party at my house gave me a dollar and told me to get a nicer place.#RIP — Craig Ferguson (@CraigyFerg) April 6, 2017\n\n90 years with Don Rickles weren't enough. One of the sweetest and most lovely people I had the pleasure of knowing. We miss you already — Jimmy Kimmel (@jimmykimmel) April 6, 2017\n\nRIP Don Rickles. One of the funniest people that ever lived, you dumb schmuck. — billy eichner (@billyeichner) April 6, 2017\n\nGreatest Of All Time https://t.co/b7q4wmpFX0 — Jeff Ross (@realjeffreyross) April 6, 2017\n\nTook this photo at the Don Rickles tribute. Stewart, Deniro, Rickles, Scorsese, Seinfeld, and the top of Tracy Morgan's head. #Legends pic.twitter.com/lPUhApgBnJ — Travon Free (@Travon) April 6, 2017\n\nDon Rickles has passed away.\n\nA giant loss. — Billy Crystal (@BillyCrystal) April 6, 2017\n\nI grew up laughing with Don Rickles.He once grabbed my arm and gave me the sweetest complement ever. Made me walk on air. I'll never forget https://t.co/djWevLjZc7 — Richard Schiff (@Richard_Schiff) April 6, 2017\n\nRIP Don Rickles. Legend. — Jim Gaffigan (@JimGaffigan) April 6, 2017\n\nRIP to this sweet and lovely man pic.twitter.com/j8mseq1aSY — Andy Richter (@AndyRichter) April 6, 2017\n\nDon Rickles, you kept us laughing for so many years. We will miss you dearly. Thanks for the zingers. You were one of a kind. — George Takei (@GeorgeTakei) April 6, 2017\n\nGod Bless Don Rickles, aka, Mr. Warmth! Proud to have been heckled by him from the stage many times! #RIP — LeVar Burton (@levarburton) April 6, 2017\n\nR.I.P. Don Rickles, you old hockey puck. :( — 🌎Joshua Malina🌎 (@JoshMalina) April 6, 2017\n\nNoise/Funk (or Angels?), B'way, 20+ yrs ago, curtain call: I looked down into the 1st row of the audience. Don Rickles. My heart smiled. RIP — Jeffrey Wright (@jfreewright) April 6, 2017\n\nRIP Mr Warmth, Don Rickles. I've gone down a YouTube rabbit hole many times watching his old chat show appearances & roasts. So very funny. — edgarwright (@edgarwright) April 6, 2017\n\nI was honored to b publicly humiliated by this comedy titan a few times! I saw him give an impromptu wedding toast last yr & he killed! https://t.co/eiUUrhG8Ll — Ron Howard (@RealRonHoward) April 6, 2017\n\nDon Rickles was a cyclone of funny with a heart of gold. Is God ready for your maniacal wit? Would love to hear what you said on arrival. — Lewis Black (@TheLewisBlack) April 6, 2017\n\nRickles was awesome. — Michael McKean (@MJMcKean) April 6, 2017\n\nI saw Don Rickles at the Daily Show once. He had no idea who I was. He looked at my face & said \"Stop worrying. It's all going to be great\" https://t.co/jOriPr9tqu — John Hodgman (@hodgman) April 6, 2017\n\nSo sad to lose Don. He made me laugh harder& longer than anyone. He was the reason to go to Las Vegas, to watch a talk show. A legend. https://t.co/w3PgYNjes0 — Fred Willard (@Fred_Willard) April 6, 2017\n\nDon once begged me for a couple of bucks then told me to twist myself into a pretzel. Ego slayer! Comic Everest! Spank you, Mr Rickles. ;^) — Jim Carrey (@JimCarrey) April 6, 2017\n\nAwwww man Rickles is dead. Rest In Peace buddy. — Danny DeVito (@DannyDeVito) April 6, 2017\n\nThis clip of Don Rickles completely taking over Frank Sinatra's interview on Carson will be hilarious forever. 💔 https://t.co/yAxCZ4Gy4k — Jake Fogelnest (@jakefogelnest) April 6, 2017\n\nDon Rickles was simply the best. He created insult comedy &yet every 1 of his targets felt loved and honored. One of a kind.#RIPdonrickles — jason alexander (@IJasonAlexander) April 6, 2017\n\nRickles is gone. He was the best, you hockey pucks. RIP — marc maron (@marcmaron) April 6, 2017\n\nDon Rickles is gone at 90 years young. He was quite literally one of the funniest people to walk… https://t.co/IbakEHxwDe — Dane Cook (@DaneCook) April 6, 2017\n\nRIP Don Rickles, 90.\n\nOne of the funniest men who ever lived. pic.twitter.com/8RvD1hGj2R — Piers Morgan (@piersmorgan) April 6, 2017\n\nOof. RIP to the funniest. Mr.Warmth. Don Rickles pic.twitter.com/FsZhLdqCvg — Larry Murphy (@LarryMurphyJr) April 6, 2017\n\nThat last voice of old school brutal honest comedy has left us. I'm deeply saddened to learn that @DonRickles has passed. We needed him. — Iliza Shlesinger (@iliza) April 6, 2017\n\nOne of the funniest, ballsiest comics of all time. RIP Don Rickles. pic.twitter.com/wF9rPQjjVz — Jim Norton (@JimNorton) April 6, 2017\n\nDon Rickles created a style of stand up and owned (!!!) it his entire career of 60+ years. It's unparalleled. No, I mean, NO ONE did that. — Kevin Pollak (@kevinpollak) April 6, 2017\n\nI was honored to be Don's pal and work with him. My xx to his family. For sheer laughs and fearlessness, he's king. pic.twitter.com/OlmKBY7QoE — Richard Lewis (@TheRichardLewis) April 6, 2017\n\nA national treasure is gone. Don Rickles' talent was limitless. To know him was a gift. He kept me laughing during 58-years of friendship. pic.twitter.com/B1IXEa9S4g — Larry King (@kingsthings) April 6, 2017\n\nAs I was standing nearby, #DonRickles once whispered in my wife's ear, \"What are you doing with a loser like him?\" I was honored. #rip #sad — Kevin Nealon (@kevin_nealon) April 6, 2017\n\nDon Rickles, such sharp hilarious wit in an era when an insult comic didn't need to be vulgar to be funny. You will be missed -B #donrickles pic.twitter.com/448JH7bGSP — Barbara Eden (@Barbara_Eden) April 6, 2017\n\nHockey puck. We've lost @DonRickles I love him so. Smart, funny, a pro and most important deeply and honestly kind. Kind is what matters. — Penn Jillette (@pennjillette) April 6, 2017\n\nA legend who made fans laugh..an \"equal opportunity\" insult comic nicknamed Mr. Warmth which described a kind, loving man. RIP Don Rickles pic.twitter.com/btk6326gav — Terry Fator (@terryfator) April 6, 2017\n\nTop Dog and King of All Shit Talking Don Rickles!!! #DonRickles — MichaelRapaport (@MichaelRapaport) April 6, 2017\n\n💔💔💔Don Rickles💔💔💔 — Whitney Cummings (@WhitneyCummings) April 6, 2017\n\nBeing skewered by Don Rickles was side-splitting funny.\n\nA gentle soul with rapid fire wit. xoB pic.twitter.com/yl2mnT32Zz — Barbra Streisand (@BarbraStreisand) April 6, 2017\n\nHail hail an original genius vacated this realm! RIP #DonRickles — Roseanne Barr (@therealroseanne) April 6, 2017\n\nThe death of Don Rickles is a major loss to the comedy world. — Joy Behar (@JoyVBehar) April 6, 2017\n\nFirst time I met Don Rickles, he asked me how many cigarettes I smoked to look like that. RIP Don Rickles. Today, we are all hockey pucks pic.twitter.com/77i8h0NGpl — Brad Williams (@funnybrad) April 6, 2017\n\nA true giant, a legend, has passed away. Don Rickles changed the game as no had before. Look out, Lord! Don's on his way! #RIP — Dennis Haskins (@mrbelding) April 6, 2017\n\nDon Rickles was a great actor, and added so much to Casino, including repeatedly breaking up DeNiro! Make em laugh in Heaven Don. — Illeana Douglas (@Illeanarama) April 6, 2017\n\nRest In Peace Don Rickles. It was my pleasure to get to know him a little bit about 15 years ago. What a hilarious, generous and lovely guy. — Hank Azaria (@HankAzaria) April 6, 2017\n\nDon Rickles saw me in the audience. Had me stand up. Everyone applauded. Then he eviscerated me. I was honored. — Jeff Daniels (@Jeff_Daniels) April 6, 2017\n\nDon Rickles was one the absolute greats. I feel lucky for the times I was ever in his orbit, my thoughts are with his family today x — James Corden (@JKCorden) April 6, 2017\n\nWe lost one of the comedic greats today. 😥 Thank you, Don Rickles, for showing all of us how to be fearless with comedy. #RIPDonRickles pic.twitter.com/cTeZVkFfaN — Sean Hayes (@SeanHayes) April 6, 2017\n\nDon Rickles once called me a hockey puck on Larry Sanders. He could have beaten me silly with one and I still would've laughed. RIP genius. — Scott Thompson (@ScottThompson_) April 6, 2017\n\nStunned/saddened to hear Don Rickles passed away this morning. Just saw him again in LA recently–sharply funny onstage, sweet offstage. — Harry Shearer (@theharryshearer) April 6, 2017\n\nThe memories of Don feel *so* good. I’ll never forget a second of time spent with him. Rest In Peace Don Rickles. — John Mayer (@JohnMayer) April 6, 2017\n\nThinking of my friend Don Rickles. And the lifetime of smiles he both gave and made. Love to his wife and their family and friends. — John Mayer (@JohnMayer) April 6, 2017\n\nThose were the days, my friend @DonRickles We thought they'd never end. We loved you so. — Dick Van Dyke (@iammrvandy) April 6, 2017\n\nIt's a sad, sad day. I feel incredibly honored to have worked with Don Rickles, and to have been insulted by him. Repeatedly. pic.twitter.com/a4Hyop1VkF — Lee Unkrich (@leeunkrich) April 6, 2017\n\nOne of my favorite notes I got from Don Rickles: pic.twitter.com/bE2Zf6zbbW — Lee Unkrich (@leeunkrich) April 6, 2017\n\nRIP The Don. — Ricky Gervais (@rickygervais) April 6, 2017\n\nRIP God of Laughter. Comedy legend Don Rickles dies at 90 https://t.co/qbNaWTltxH # via @HuffPostEnt — Mark Ruffalo (@MarkRuffalo) April 6, 2017\n\nHe was the love of my life . Don Rickles is funnier right now in death than most comics are in life. pic.twitter.com/jcWIhdJsgX — Chris Rock (@chrisrock) April 6, 2017\n\nI was thrilled to interview/be insulted non-stop by the legendary Don Rickles. I will sorely miss this incredibly funny and lovable man. — Conan O'Brien (@ConanOBrien) April 6, 2017\n\nDon Rickles\n\nOne of a kind.. total legend. When I was a kid.. no comedian made me more uncomfortable & laugh harder all at the same time!! pic.twitter.com/qhXhFNMUfC — Billy Baldwin (@BillyBaldwin) April 6, 2017\n\n#RIP @DonRickles you will be horribly missed. But God will be so honored when you call him a Hockey Puck pic.twitter.com/kulixjkwTP — Sarah Silverman (@SarahKSilverman) April 6, 2017\n\nDon Rickles. One of the bravest, funniest, and sweetest guys that ever performed. A dear pal that we will all sorely miss. — Mel Brooks (@MelBrooks) April 6, 2017\n\nWe lost funnyman don rickles today. Loved that man. Funny and a sweetheart — Sinbad (@sinbadbad) April 6, 2017\n\nGonna miss Don Rickles. I've seen every Dean Martin Roast 100 times and still get excited for the Rickles stuff! Huge influence on me. — Larry The Cable Guy (@GitRDoneLarry) April 6, 2017\n\n#DonRickles was not only a comedic visionary and inspiration, but a close friend to my mother and I. Your 'warmth' lives on, Don. pic.twitter.com/EQYkjzTI9l — Melissa Rivers (@MelRivers) April 6, 2017", "images": ["https://ewedit.files.wordpress.com/2017/04/ap_764920574354.jpg?crop=87px%2C179px%2C1996px%2C1498px&resize=1200%2C630", "https://ewedit.files.wordpress.com/2017/09/lennykravitz.jpg?w=768", "https://ewedit.files.wordpress.com/2017/11/rolestout.jpg?w=768", "https://secure.gravatar.com/avatar/a68331e1081dd89755febde47da61940?s=300&d=blank&r=g", "https://ewedit.files.wordpress.com/2018/10/celebrity-binge.jpg?w=768"], "top_img": "https://ewedit.files.wordpress.com/2017/04/ap_764920574354.jpg?crop=87px%2C179px%2C1996px%2C1498px&resize=1200%2C630", "keywords": [], "authors": ["Nivea Serrao"], "canonical_link": "https://ew.com/tv/2017/04/06/don-rickles-dead-celebrities-react-twitter/", "title": "Don Rickles dies: Celebrities pay tribute", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Don Rickles, Don Rickles dead, Don Rickles died, celebrities, twitter, hollywood,", "news_keywords": "Don Rickles, Don Rickles dead, Don Rickles died, celebrities, twitter, hollywood,", "description": "Hollywood mourned the death of legendary comedian Don Rickles, posting tributes on social media.", "og": {"title": "Don Rickles Dies: Celebrities Pay Tribute", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2017/04/06/don-rickles-dead-celebrities-react-twitter/", "description": "Hollywood is mourning the loss of Don Rickles, the actor-turned-insult-comic who died Thursday at the age 90. Rickles, who appeared on…", "image": {"identifier": "https://ewedit.files.wordpress.com/2017/04/ap_764920574354.jpg?crop=87px%2C179px%2C1996px%2C1498px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/tv/2017/04/06/don-rickles-dead-celebrities-react-twitter/", "description": "Hollywood mourned the death of legendary comedian Don Rickles, posting tributes on social media.", "media": "https://ewedit.files.wordpress.com/2017/04/ap_764920574354.jpg?crop=87px%2C179px%2C1996px%2C1498px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2017/04/06/don-rickles-dead-celebrities-react-twitter/", "title": "Don Rickles Dies: Celebrities Pay Tribute", "description": "Hollywood mourned the death of legendary comedian Don Rickles, posting tributes on social media.", "site": "@ew", "image": "https://ewedit.files.wordpress.com/2017/04/ap_764920574354.jpg?crop=87px%2C179px%2C1996px%2C1498px&resize=1200%2C630"}, "fb": {"pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1491451200.0, "source": "http://ew.com", "summary": ""}